[
  {
    "id": 2,
    "name": "Roy Moore",
    "year": 2017,
    "description": "Former Alabama Chief Justice Roy Moore faced multiple allegations of sexual misconduct in 2017. Multiple women accused Moore of sexual assault when they were teenagers and he was in his 30s. The allegations first surfaced in November 2017 during his U.S. Senate campaign. Moore lost the special election to Democrat Doug Jones.",
    "position": [
      "judge",
      "candidate"
    ],
    "tags": [
      "judge",
      "candidate",
      "republican"
    ]
  },
  {
    "id": 4,
    "name": "Dennis Hastert",
    "description": "Former Speaker of the House Dennis Hastert sexually abused high school students while working as a wrestling coach. He was convicted in 2016 of structuring bank withdrawals to evade currency reporting requirements, related to paying hush money to victims of his abuse. He received a 15-month prison sentence."
  },
  {
    "id": 5,
    "name": "Joseph Russell Dendy",
    "year": 2017,
    "description": "Cobb County GOP Chairman Joseph Russell Dendy pleaded guilty in 2017 to 13 charges including child molestation, enticing a child for indecent purposes, and aggravated sexual battery. He received a life sentence with 30 years to serve. The crimes occurred from 2004 to 2011. He was arrested in May 2016."
  },
  {
    "id": 6,
    "name": "Howard Scott Heldreth",
    "year": 1992,
    "description": "Anti-abortion and anti-gay activist Howard Scott Heldreth was charged in 1992 with rape and kidnapping of a 16-year-old girl. He pleaded guilty to sexual battery and was sentenced to probation and required to register as a sex offender in Florida.",
    "position": [
      "activist"
    ],
    "crime": [
      "rape",
      "sexual abuse"
    ],
    "tags": [
      "activist",
      "republican"
    ]
  },
  {
    "id": 10,
    "name": "Edison Misla Aldarondo",
    "year": 2002,
    "description": "Puerto Rico House Speaker Edison Misla Aldarondo was charged in 2002 with rape of a 17-year-old friend of his stepdaughter. He was convicted of attempted rape, sexual abuse of a minor, and four counts of lewd conduct for molesting his stepdaughter beginning when she was 9 years old. He was sentenced to 13 years in prison in 2004.",
    "position": [
      "state legislator"
    ],
    "crime": [
      "rape",
      "sexual abuse",
      "child molestation"
    ],
    "tags": [
      "state legislator",
      "republican"
    ]
  },
  {
    "id": 13,
    "name": "Strom Thurmond",
    "year": 1925,
    "description": "U.S. Senator Strom Thurmond had sex with Carrie Butler, a 15-year-old Black housemaid working for his family, when he was 22 years old in 1925. Their daughter, Essie Mae Washington-Williams, was born in October 1925. Thurmond, who became known for pro-segregation politics, kept his daughter's existence secret until after his death in 2003.",
    "position": [
      "congress"
    ],
    "crime": [
      "rape",
      "sexual abuse"
    ],
    "tags": [
      "congress",
      "republican"
    ]
  },
  {
    "id": 15,
    "name": "Peter Dibble",
    "year": 2004,
    "description": "Connecticut legislator and Stonington first selectman Peter Dibble pleaded no contest in 2004 to having an inappropriate relationship with a 13-year-old girl. He was charged with repeated acts of sexual misconduct with the girl starting when she was 10 years old, including French-kissing her on at least 40 occasions.",
    "position": [
      "local official",
      "state legislator"
    ],
    "crime": [
      "sexual abuse",
      "child molestation"
    ],
    "tags": [
      "local official",
      "state legislator",
      "republican"
    ]
  },
  {
    "id": 16,
    "name": "Donald Lukens",
    "year": 1989,
    "description": "U.S. Representative Donald 'Buz' Lukens (R-OH) was convicted in 1989 of contributing to the delinquency of a minor after paying a 16-year-old girl $40 for sex. He was convicted again in 1996 on bribery and conspiracy charges related to his time in Congress and sentenced to 30 months in prison.",
    "position": [
      "congress"
    ],
    "crime": [
      "sexual abuse",
      "child exploitation"
    ],
    "tags": [
      "congress",
      "republican"
    ]
  },
  {
    "id": 18,
    "name": "Mark A. Grethen",
    "year": 2001,
    "description": "Republican businessman and activist Mark A. Grethen was convicted in 2001 of six counts of sex crimes involving children (two counts each of forcible sodomy, aggravated sexual battery, and indecent liberties with a child). He was sentenced to 26 years in prison. Shortly after conviction, he was briefly named 'Republican of the Year' in 2002 by the National Republican Congressional Committee. He was killed in prison in 2021.",
    "position": [
      "activist",
      "party member"
    ],
    "crime": [
      "rape",
      "sexual abuse",
      "child molestation"
    ],
    "tags": [
      "activist",
      "party member",
      "republican"
    ]
  },
  {
    "id": 19,
    "name": "Ralph Shortey",
    "description": "Oklahoma state senator and Donald Trump's 2016 Oklahoma campaign chair Ralph Shortey was arrested in March 2017 after being found in a motel room with a 17-year-old boy. He pleaded guilty in 2017 to child sex trafficking and was sentenced to 15 years in federal prison in 2018.",
    "position": [
      "state legislator",
      "party official"
    ],
    "crime": [
      "child exploitation",
      "sexual trafficking"
    ],
    "tags": [
      "state legislator",
      "party official",
      "republican",
      "maga"
    ]
  },
  {
    "id": 21,
    "name": "Dan Crane",
    "year": 1983,
    "description": "U.S. Representative Dan Crane (R-IL) was censured by the House of Representatives on July 20, 1983, by a vote of 421-3 for having sex with a 17-year-old congressional page. He lost his re-election bid in 1984.",
    "position": [
      "congress"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "congress",
      "republican"
    ]
  },
  {
    "id": 22,
    "name": "Mark Foley",
    "year": 2006,
    "description": "U.S. Representative Mark Foley (R-FL) resigned from Congress on September 29, 2006, after it was revealed he had sent sexually explicit instant messages and emails to teenage boys who had served as congressional pages. The scandal broke less than six weeks before the 2006 midterm elections.",
    "position": [
      "congress"
    ],
    "crime": [
      "sexual harassment",
      "child exploitation"
    ],
    "tags": [
      "congress",
      "republican"
    ]
  },
  {
    "id": 23,
    "name": "Beverly Russell",
    "year": 1995,
    "description": "Christian Coalition leader and South Carolina Republican Party official Beverly Russell admitted in 1988 to sexually molesting his stepdaughter Susan Smith beginning when she was 15 years old. The abuse continued for years. During Smith's 1995 murder trial, Russell testified about the abuse and urged the jury to spare her life, saying he bore responsibility for her actions.",
    "position": [
      "party official",
      "activist"
    ],
    "crime": [
      "sexual abuse",
      "child molestation"
    ],
    "tags": [
      "party official",
      "activist",
      "republican",
      "religious leader"
    ]
  },
  {
    "id": 24,
    "name": "Robert Bauman",
    "year": 1980,
    "description": "U.S. Representative Robert Bauman (R-MD) was charged on October 3, 1980, with soliciting sex from a 16-year-old male prostitute. Despite being a staunch conservative who often criticized American morality, charges were dropped after he completed court-supervised rehabilitation. He lost his re-election bid in November 1980.",
    "position": [
      "congress"
    ],
    "crime": [
      "sexual abuse",
      "child exploitation"
    ],
    "tags": [
      "congress",
      "republican"
    ]
  },
  {
    "id": 28,
    "name": "Stephen White",
    "year": 2003,
    "description": "Reverend Stephen White, who preached against homosexuality and sexual promiscuity at Yale and other campuses, was convicted in 2003 of criminal solicitation to commit involuntary deviate sexual intercourse. He was arrested in June 2003 after offering $20 to a 14-year-old boy in West Chester, Pennsylvania, for permission to perform oral sex. He faced a minimum 3-year prison term.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "sexual abuse",
      "child exploitation"
    ],
    "tags": [
      "religious leader",
      "republican"
    ]
  },
  {
    "id": 29,
    "name": "Jon Matthews",
    "year": 2004,
    "description": "Conservative talk show host Jon Matthews pleaded guilty in June 2004 to indecency with a child for exposing his genitals to an 11-year-old girl at his Sugar Land, Texas, home in October 2003. He initially received deferred adjudication but his probation was revoked in 2007 after violations, and he was sentenced to 3 years in prison.",
    "position": [
      "party member"
    ],
    "crime": [
      "sexual abuse",
      "child exploitation"
    ],
    "tags": [
      "party member",
      "republican"
    ]
  },
  {
    "id": 33,
    "name": "Andrew Buhr",
    "year": 2002,
    "description": "Republican politician and Missouri House candidate Andrew Buhr was charged in 2002 with two counts of first-degree sodomy with a 13-year-old boy. He was appointed by President Bush to the Commission on Presidential Scholars in November 2002 but lost the position within a month when the charges were filed. A mistrial was declared in January 2004 after he claimed he thought the boy was older.",
    "position": [
      "candidate",
      "party official"
    ],
    "crime": [
      "sexual abuse",
      "sodomy"
    ],
    "tags": [
      "candidate",
      "party official",
      "republican"
    ]
  },
  {
    "id": 34,
    "name": "Keith Westmoreland",
    "year": 2002,
    "description": "Tennessee state representative and former Sullivan County executive Keith Westmoreland was arrested in 2002 on seven felony counts of lewd and lascivious exhibition to girls under age 16. He exposed his genitals to children at a hotel pool in Sandestin, Florida. He later committed suicide.",
    "position": [
      "state legislator",
      "local official"
    ],
    "crime": [
      "sexual abuse",
      "child exploitation"
    ],
    "tags": [
      "state legislator",
      "local official",
      "republican"
    ]
  },
  {
    "id": 35,
    "name": "John Allen Burt",
    "year": 2003,
    "description": "Anti-abortion activist and Christian fundamentalist John Allen Burt was arrested in 2003 for molesting a 15-year-old girl living at his shelter 'Our Father's House.' He was convicted on April 1, 2004, of five counts of lewd and lascivious molestation and conduct. He was sentenced to 18 years in prison and died while serving his sentence in 2013.",
    "position": [
      "activist",
      "religious leader"
    ],
    "crime": [
      "sexual abuse",
      "child molestation"
    ],
    "tags": [
      "activist",
      "religious leader",
      "republican"
    ]
  },
  {
    "id": 36,
    "name": "Keola Childs",
    "year": 2000,
    "description": "Hawaii County Councilman Keola Childs pleaded guilty in 2000 to first-degree sexual assault for molesting a male child. The charge carried a possible sentence of 20 years in prison.",
    "position": [
      "local official"
    ],
    "crime": [
      "sexual assault",
      "child molestation"
    ],
    "tags": [
      "local official",
      "republican"
    ]
  },
  {
    "id": 42,
    "name": "Parker J. Bena",
    "year": 2001,
    "description": "Republican activist Parker J. Bena was a presidential elector for George W. Bush in 2000. In 2001, he pleaded guilty to possession of child pornography, including images of children as young as 3 years old, on his home computer. He was sentenced to 30 months in federal prison and fined $18,000.",
    "position": [
      "activist",
      "party official"
    ],
    "crime": [
      "child pornography"
    ],
    "tags": [
      "activist",
      "party official",
      "republican"
    ]
  },
  {
    "id": 46,
    "name": "5 years.",
    "year": null,
    "description": "5 years.",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 47,
    "name": "Richard A. Dasen Sr.",
    "year": 2005,
    "description": "Montana businessman and Republican benefactor Richard A. Dasen Sr. was convicted in May 2005 of promotion of prostitution, sexual abuse of children, and multiple felony prostitution counts. He paid women and girls for sex, took sexual photographs of girls under 18, and had sex with a 15-year-old girl. He was sentenced to 20 years with 18 suspended in September 2005.",
    "position": [
      "party member"
    ],
    "crime": [
      "sexual abuse",
      "child exploitation",
      "prostitution"
    ],
    "tags": [
      "party member",
      "republican"
    ]
  },
  {
    "id": 48,
    "name": "Tim Nolan",
    "description": "Former Kentucky judge and Trump Campbell County campaign chair Tim Nolan pleaded guilty in 2018 to 21 counts including human trafficking and child sex trafficking involving 19 victims (7 minors). He was sentenced to 20 years in federal prison. He used his position and threatened victims with arrest unless they performed sex acts.",
    "position": [
      "judge",
      "party official"
    ],
    "crime": [
      "sexual trafficking",
      "child exploitation",
      "sexual abuse"
    ],
    "tags": [
      "judge",
      "party official",
      "republican",
      "maga"
    ]
  },
  {
    "id": 124,
    "name": "Blake Farenthold",
    "year": 2018,
    "description": "U.S. Representative Blake Farenthold (R-TX) resigned from Congress in April 2018 after it was revealed he used $84,000 in taxpayer money to settle a sexual harassment lawsuit filed by his former communications director. The lawsuit alleged gender discrimination, sexual harassment, and creating a hostile work environment.",
    "crime": [
      "sexual harassment"
    ],
    "position": [
      "congress"
    ],
    "tags": [
      "congress",
      "republican"
    ]
  },
  {
    "id": 893,
    "name": "Andrew Hazelton, neo-Nazi from Portland, Maine",
    "year": 2022,
    "description": "Andrew Hazelton, neo-Nazi from Portland, Maine convicted for possession child sexual exploitation materials",
    "position": [],
    "crime": [
      "child exploitation"
    ],
    "tags": []
  },
  {
    "id": 894,
    "name": "Michael Alan Jones, Patriot Front member in NC, sexual",
    "year": null,
    "description": "Michael Alan Jones, Patriot Front member in NC, sexual assault of 14 and 15 year old girls. Was a Jan 6 insurrectionist.",
    "position": [],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": []
  },
  {
    "id": 895,
    "name": "Jonathan Charles Koch, Iowa white supremac",
    "year": 2011,
    "description": "Jonathan Charles Koch, Iowa white supremacist, child pornography",
    "position": [],
    "crime": [
      "child pornography"
    ],
    "tags": []
  },
  {
    "id": 896,
    "name": "August Kre",
    "year": 2015,
    "description": "August Kreis, former leader of Aryan Nations - SC, was sentenced to 50 years for child molestation",
    "position": [
      "party official"
    ],
    "crime": [
      "child molestation"
    ],
    "tags": [
      "party official"
    ]
  },
  {
    "id": 897,
    "name": "Warren Jeffs",
    "year": 2011,
    "description": "FLDS (Fundamentalist Church of Jesus Christ of Latter Day Saints) leader Warren Jeffs was convicted in August 2011 of child rape and aggravated sexual assault of a minor for raping a 15-year-old child bride and a 12-year-old child bride. He was sentenced to life in prison plus 20 years. Texas authorities discovered over 700 pieces of evidence including priesthood records and audio tape of sexual assault.",
    "position": [],
    "crime": [
      "rape"
    ],
    "tags": []
  },
  {
    "id": 898,
    "name": "Michael Scott Langton, Ferndale,",
    "year": null,
    "description": "Michael Scott Langton, Ferndale, WA, police officer (fired), tried to join Oath Keepers AFTER insurrection. Contacted woman he met as a witness on the job and asked her to bring her child for the two of them to have sex with him.",
    "position": [
      "law enforcement"
    ],
    "crime": [],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 899,
    "name": "James Comer",
    "year": 1991,
    "description": "U.S. Representative James Comer (R-KY) was accused by ex-girlfriend Marilyn Thomas of domestic violence in the 1990s. Thomas claimed Comer hit her, was controlling and abusive, impregnated her, and forced her to get an abortion in November 1991. Comer denied allegations but later admitted to leaking emails to discredit her story.",
    "position": [
      "congress",
      "party member"
    ],
    "crime": [
      "domestic violence",
      "violence"
    ],
    "tags": [
      "congress",
      "party member",
      "republican"
    ]
  },
  {
    "id": 900,
    "name": "Nathan Larson",
    "year": 2008,
    "description": "Far-right white supremacist and self-described pedophilia advocate Nathan Larson served 14 months in prison in 2008 for threatening the president. He created websites to facilitate sharing of child sexual abuse material and pedophilia advocacy. In 2020, he was arrested for kidnapping a 12-year-old girl. He died in custody in September 2021 while facing federal charges for soliciting child pornography.",
    "position": [],
    "crime": [
      "kidnapping"
    ],
    "tags": []
  },
  {
    "id": 901,
    "name": "James Mason",
    "year": 1994,
    "description": "White nationalist and influential neo-Nazi figure James Mason was arrested in the late 1980s-1990s and found to have nude images of a 15-year-old girl. In 1994, he was charged with sexual exploitation of a minor. He was convicted on weapons charges. Mason is best known as author of 'Siege', influential neo-Nazi manifesto advocating for white supremacist revolution.",
    "position": [],
    "crime": [
      "child exploitation",
      "rape"
    ],
    "tags": []
  },
  {
    "id": 902,
    "name": "John Cameron Denton, former",
    "year": 2020,
    "description": "John Cameron Denton, former Atomwaffen leader, accused of sharing child pornography",
    "position": [
      "party official"
    ],
    "crime": [
      "child pornography"
    ],
    "tags": [
      "party official"
    ]
  },
  {
    "id": 903,
    "name": "Stephen Parshall",
    "year": 2020,
    "description": "Boogaloo Boys member arrested May 30, 2020, for conspiracy to damage buildings and government property using Molotov cocktails during George Floyd protests in Las Vegas. Also pleaded guilty to multiple counts of child sexual exploitation and child pornography on November 3, 2022. Sentenced to life with possibility of parole in 10 years for terrorism charges and 33 years for sexual exploitation crimes.",
    "position": [
      "extremist/militia"
    ],
    "crime": [
      "terrorism",
      "explosives",
      "child sexual exploitation",
      "child pornography"
    ],
    "tags": [
      "Boogaloo Boys",
      "domestic terrorism",
      "child abuse",
      "gun violence"
    ]
  },
  {
    "id": 904,
    "name": "Jarl Judson Rockhill",
    "year": 2022,
    "description": "Jarl Judson Rockhill, 35, of West Linn, Oregon, convicted of sexual abuse in 2002 and 2003 and registered as sex offender. In 2010, convicted of felon in possession of a restricted weapon. In 2022, arrested for placing neo-Nazi propaganda on fence of Immigrant and Refugee Community Organization (IRCO) in Portland. Pled guilty to hate crime and sentenced to probation with anti-racist reading and writing requirements.",
    "position": [
      "neo-Nazi",
      "extremist"
    ],
    "crime": [
      "sexual abuse",
      "felon in possession of weapon",
      "hate crime"
    ],
    "tags": [
      "white supremacist",
      "hate crime",
      "sex offender",
      "extremist"
    ]
  },
  {
    "id": 905,
    "name": "Jesse Shenk",
    "year": 2021,
    "description": "Jesse Shenk, member of the Goyim Defense League (GDL), a neo-Nazi antisemitic organization founded by Jon Minadeo II, was arrested in March 2021 and charged with child endangerment and sexual exploitation of a 14-year-old girl. He engaged with the minor online and planned to meet up with her. Shenk is identified as a convicted pedophile.",
    "position": [
      "white nationalist"
    ],
    "crime": [
      "child endangerment",
      "sexual exploitation"
    ],
    "tags": [
      "neo-Nazi",
      "antisemitic",
      "Goyim Defense League",
      "child abuse",
      "pedophile"
    ]
  },
  {
    "id": 906,
    "name": "Kevin Alfred Strom",
    "year": 2008,
    "description": "Kevin Alfred Strom, founder of the white nationalist National Vanguard, was arrested January 4, 2007, in Greene County, Virginia, on charges of possession of child pornography and witness tampering. He pleaded guilty to one count of possession of child pornography in January 2008 and was sentenced to 23 months in prison, released September 3, 2008. In 1990, arrested for assaulting police officer during pro-apartheid rally.",
    "position": [
      "white nationalist",
      "National Vanguard founder"
    ],
    "crime": [
      "child pornography",
      "witness tampering"
    ],
    "tags": [
      "neo-Nazi",
      "child abuse",
      "white supremacist"
    ]
  },
  {
    "id": 907,
    "name": "Alexander Hillel Tre",
    "year": 2020,
    "description": "Alexander Hillel Treisman of Washington was arrested for a terrorist plot in NC that included the plans to assassinate Joe Biden. In search of his van, the found his plans and child pornography on 8 different devices",
    "position": [],
    "crime": [
      "child pornography"
    ],
    "tags": []
  },
  {
    "id": 908,
    "name": "Robert Lee West",
    "year": null,
    "description": "Robert Lee West, Portland, Oregon, Patriot Prayer associate who has stalked and doxxed police and the DA. He was convicted of rape and mayhem in California.",
    "position": [
      "law enforcement",
      "extremist"
    ],
    "crime": [
      "rape",
      "mayhem"
    ],
    "tags": [
      "Patriot Prayer",
      "vigilantism",
      "doxxing"
    ]
  },
  {
    "id": 909,
    "name": "Kyle Broussard",
    "year": null,
    "description": "Kyle Broussard, Patriot Prayer associated neo-Nazi, convicted of Rape 3.",
    "position": [
      "extremist"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "Patriot Prayer",
      "white supremacist"
    ]
  },
  {
    "id": 910,
    "name": "Jonathan Mark Myers",
    "year": 2022,
    "description": "Jonathan Mark Myers, 41, youth pastor and principal at Edinburgh parochial school, arrested October 27, 2022, on multiple felony charges including sexual misconduct with a minor and child seduction. Investigated for grooming and manipulating a victim starting at age 11-12, with inappropriate contact continuing into her adulthood. He threatened the victim with a firearm during one manipulative incident.",
    "position": [
      "youth pastor"
    ],
    "crime": [
      "sexual misconduct with minor",
      "child seduction"
    ],
    "tags": [
      "church abuse",
      "child abuse",
      "grooming",
      "gun violence"
    ]
  },
  {
    "id": 911,
    "name": "Timothy Jason Jeltema",
    "year": 2022,
    "description": "Timothy Jason Jeltema, former student minister at Champion Forest Baptist Church in Houston, Texas, was arrested in June 2018 after a 13-year-old victim reported online sexual misconduct. Investigation revealed he communicated with and requested photographs from approximately 20-25 juveniles ages 14-17 via Instagram and Snapchat. Sentenced to five years in prison on November 17, 2022, after pleading guilty to online solicitation of a minor, indecency with a child, and sexual performance by a child.",
    "position": [
      "student minister",
      "Baptist"
    ],
    "crime": [
      "online solicitation of minor",
      "indecency with child",
      "sexual performance by child"
    ],
    "tags": [
      "church abuse",
      "child abuse",
      "online grooming"
    ]
  },
  {
    "id": 912,
    "name": "Ryan Scott Walsh",
    "year": 2020,
    "description": "Ryan Scott Walsh, 27, youth director at Gulf Breeze Methodist Church, was arrested February 10, 2020, after reports of inappropriate contact with a 13-year-old female member of the youth group. Charged with transmitting obscene material to a minor, lewd and lascivious conduct involving a minor, and use of computer to solicit/seduce a child. Convicted and sentenced to more than 19 years in prison on October 7, 2020.",
    "position": [
      "youth director",
      "Methodist"
    ],
    "crime": [
      "sexual offense with minor",
      "obscene material to minor",
      "online solicitation"
    ],
    "tags": [
      "church abuse",
      "child abuse",
      "Methodist"
    ]
  },
  {
    "id": 913,
    "name": "Youth Trent Ivey Vestal Bapt",
    "year": 2022,
    "description": "Youth Pastor Trent Ivey at Vestal Baptist Church in South Knox, TN has been charged with sexual battery of two young girls.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 914,
    "name": "Michael Paul Keech",
    "year": 2022,
    "description": "Michael Paul Keech, 41, former youth pastor at West Columbia Baptist Church in Lexington, South Carolina, was arrested on October 20, 2022, and charged with four counts of criminal sexual conduct with a minor under 16. He allegedly sexually abused a teenage boy for more than two years, with incidents dating back to July 2019. Bond was denied and authorities sought to identify additional victims.",
    "position": [
      "youth pastor",
      "Southern Baptist"
    ],
    "crime": [
      "criminal sexual conduct with minor"
    ],
    "tags": [
      "church abuse",
      "child abuse",
      "Baptist",
      "sexual abuse"
    ]
  },
  {
    "id": 915,
    "name": "Thomas James Brackett",
    "year": 2022,
    "description": "Thomas James Brackett, 59, former Baltimore County youth pastor and third grade teacher, was arrested in South Carolina on October 21, 2022, on 11 warrants for criminal sexual conduct with minors and child abuse. He allegedly sexually abused children ages 8-11 while serving as a teacher at Tabernacle Christian School and youth pastor in 1984-1985. At the time of arrest, he was pastor of Holy Trinity Pentecostal Church in Andrews, South Carolina.",
    "position": [
      "youth pastor",
      "teacher"
    ],
    "crime": [
      "criminal sexual conduct with minors",
      "child abuse",
      "sexual abuse"
    ],
    "tags": [
      "church abuse",
      "child abuse",
      "Pentecostal"
    ]
  },
  {
    "id": 916,
    "name": "Sean Patrick Masopust",
    "year": 2022,
    "description": "Sean Patrick Masopust, 32, youth pastor at Northridge Church in Owatonna, Minnesota, was arrested February 2, 2022, for inappropriate relationship with a youth group member. During summer 2018, when Masopust was 28, he engaged in sexual contact with a 17-year-old, sending her nude photos and videos via Instagram and text, kissing her, and touching her inappropriately at the church and his home. Sentenced to 30 days confinement and 10 years probation.",
    "position": [
      "youth pastor"
    ],
    "crime": [
      "criminal sexual conduct"
    ],
    "tags": [
      "church abuse",
      "child abuse",
      "online grooming"
    ]
  },
  {
    "id": 917,
    "name": "Michael D'Attoma",
    "year": 2022,
    "description": "Michael D'Attoma, former youth pastor at Northside Baptist Church in Lexington, South Carolina (2009-2012), was named in civil lawsuits filed in 2022 by two women alleging he sexually abused them beginning in 2010 when they were teens in his youth group. Allegations include grooming, inappropriate texting, Skype requests to remove clothing, and inappropriate touching. Criminal investigations are underway but he has not been criminally charged. D'Attoma denies the allegations.",
    "position": [
      "youth pastor",
      "Southern Baptist"
    ],
    "crime": [
      "sexual abuse allegations"
    ],
    "tags": [
      "church abuse",
      "child abuse",
      "civil litigation"
    ]
  },
  {
    "id": 918,
    "name": "Sean M. Higgins",
    "year": 2020,
    "description": "Sean Higgins, 31, youth pastor and music leader at Harbor Baptist Church in Hainesport, New Jersey, and teacher at Harbor Baptist Academy, was arrested in October 2020. He victimized 13 boys ages 12-17 across seven states by pretending to be a teenage girl on Instagram and Snapchat, deceiving them into trading images, then blackmailing them to perform sexual acts. Indicted on 75 counts, he pled guilty to four counts of endangering the welfare of children and was sentenced to 27 years in prison.",
    "position": [
      "youth pastor",
      "teacher",
      "Baptist"
    ],
    "crime": [
      "online sexual exploitation of minors",
      "endangering welfare of child",
      "blackmail"
    ],
    "tags": [
      "church abuse",
      "child abuse",
      "online grooming",
      "Baptist"
    ]
  },
  {
    "id": 919,
    "name": "Kenneth Leo Baker",
    "year": 2014,
    "description": "Kenneth Leo Baker, 44, of Ashland, Oregon, youth pastor at First Baptist Church of Ashland, faced four felony and two misdemeanor sex charges for alleged incidents involving a single victim between 2006 and 2011. At least four incidents occurred when the girl was younger than 14. Arrested in October 2014 after confessing to church leaders, he pleaded guilty and received a sentence of 10.5 years in prison.",
    "position": [
      "youth pastor"
    ],
    "crime": [
      "sexual contact with juvenile"
    ],
    "tags": [
      "church abuse",
      "child abuse",
      "Baptist"
    ]
  },
  {
    "id": 920,
    "name": "Peter Bass, Oregon",
    "year": 2015,
    "description": "Peter Bass, Oregon youth pastor was sentenced to 33 years for multiple counts of rape of underage minor",
    "position": [
      "religious leader"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 921,
    "name": "Central Point, OR Dustin Colony-Herrera",
    "year": 2019,
    "description": "Central Point, OR youth pastor Dustin Colony-Herrera sexually abusing children in California. Pled no contest. District Court Judge Karen Townsend sentenced Herrera on May 26 to two, six-year prison sentences, which were suspended in favor of five years of sex offender probation.",
    "position": [
      "judge",
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "judge",
      "religious leader"
    ]
  },
  {
    "id": 922,
    "name": "NY Robert Fenton",
    "year": null,
    "description": "NY youth pastor Robert Fenton groomed and sexually abused minor child - to whom he was engaged when she",
    "position": [
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 923,
    "name": "Evansville, IN, Joshua Burton Henley",
    "year": null,
    "description": "Evansville, IN, youth pastor Joshua Burton Henley arrested for child sexual assault when he was a youth pastor in TN, several victims 12 to 16",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 924,
    "name": "Ronnie Lee Barron, youth",
    "year": null,
    "description": "Ronnie Lee Barron, youth pastor in Loris SC was charged with sexual exploitation of a minor while youth pastor in Conyers, GA",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child exploitation"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 925,
    "name": "Donald Courtney Biggs, MTN",
    "year": null,
    "description": "Donald Courtney Biggs, recently fired youth pastor at MTN Church, Medford, OR, wrote inappropriate text to a minor, filmed a woman undressing without consent, there are allegations of filming other women.",
    "position": [
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 926,
    "name": "Ben Courson, pastor",
    "year": null,
    "description": "Ben Courson, pastor of Applegate Christian Fellowship, was forced to step down after several accusations of sexual misconduct, abusing his ministerial authority to initiate sexual relationships with women.",
    "position": [
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 927,
    "name": "Jon Courson, former",
    "year": null,
    "description": "Jon Courson, former pastor of Applegate Christian Fellowship, is accused of using his position as pastor to initiate a relationship with a parishioner.",
    "position": [
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 928,
    "name": "Former youth pastor, Jeffrey",
    "year": 2021,
    "description": "Former youth pastor, Jeffrey Winston Forrest, was found guilty of two counts of sexually assaulting children and given 99 years for each conviction.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 929,
    "name": "Nicholas Kelley, youth",
    "year": null,
    "description": "Nicholas Kelley, youth pastor in Lawrencevill GA, charged with rape of a 14-year-old girl admitted to an inappropriate physical relationship",
    "position": [
      "religious leader"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 930,
    "name": "Shawn Fitzgerald, youth",
    "year": null,
    "description": "Shawn Fitzgerald, youth pastor and teacher, arrested on 408",
    "position": [
      "educator",
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "educator",
      "religious leader"
    ]
  },
  {
    "id": 931,
    "name": "Alexander Roesly, Pra",
    "year": null,
    "description": "Alexander Roesly, youth pastor at Praise Chapel of Church God in Union City solicited two minors, ages 13 and 15.",
    "position": [
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 932,
    "name": "Malo Monteiro, Faith Bapt",
    "year": 2018,
    "description": "Malo \"Victor\" Monteiro, youth pastor at Faith Baptist Church in Wildomar, CA, pled guilty to grooming and sexually assaulting minors. Sentenced to 5 years and 4 months.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 933,
    "name": "Wendel Nix, youth",
    "year": null,
    "description": "Wendel Nix, youth pastor in Aztec, NM, at Bible Baptist Church was arrested for sexual assault of minor. Pastor said he is a good guy who made a wrong decision. (Several times!!!!)",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 934,
    "name": "Bill Gothard, former leader of conservative homeschooling",
    "year": 2014,
    "description": "Bill Gothard, former leader of conservative homeschooling Institute in Basic Life Principles, resigned in 2014 after 30 women accused him of harassment and molestation, including a minor. Ten more women come forward in 2016 and sued alleging sexual abuse, nonconsensual touching, etc.",
    "position": [
      "party official"
    ],
    "crime": [
      "child molestation",
      "sexual abuse",
      "sexual harassment"
    ],
    "tags": [
      "party official"
    ]
  },
  {
    "id": 935,
    "name": "Kevin Etherington, Republican, first ass",
    "year": null,
    "description": "Kevin Etherington, Republican, first assistant district attorney of Logan and Payne Counties, has been arrested (and fired) for possession of child exploitation materials.",
    "position": [
      "party member"
    ],
    "crime": [
      "child exploitation"
    ],
    "tags": [
      "party member",
      "republican"
    ]
  },
  {
    "id": 936,
    "name": "Joseph Brody, a volunteer coordinator for Glenn Youngkin",
    "year": 2022,
    "description": "Joseph Brody, a volunteer coordinator for Glenn Youngkin (R) gubernatorial campaign in VA has been indicted for his role in January 6. Additionally, he has a history of threatening rape against women exposed in an epic 87-tweet thread",
    "position": [],
    "crime": [
      "rape"
    ],
    "tags": []
  },
  {
    "id": 937,
    "name": "North Carolina Benjamin Damron",
    "year": null,
    "description": "North Carolina youth pastor Benjamin Damron arrested for sexual assault of children he met through church",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 938,
    "name": "Jeff Taylor, First Bapt",
    "year": 2020,
    "description": "Jeff Taylor, former youth pastor at First Baptist Church in Strafford, MO, groomed a girl beginning when she was 11 and began raping her when she became a ten until she came forward at 19. He was arrested in 2020 and pleaded guilty in 2022, received a 9-year sentence, just one year more than his grooming and molestation of that girl.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child molestation",
      "rape"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 939,
    "name": "Rep-elect Brian Stout of Oregon",
    "year": 2022,
    "description": "Republican Rep-elect Brian Stout of Oregon was accused of sexual assault and threats, woman was granted restraining order.",
    "position": [
      "party member"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "party member",
      "republican"
    ]
  },
  {
    "id": 940,
    "name": "Samuel Rappylee Bateman",
    "year": null,
    "description": "Samuel Rappylee Bateman is a leader of the Fundamentalist LDS church and accused of of engaging in the transportation of minors in interstate commerce to engage in criminal sexual activity and travel interstate commerce to engage in illicit sexual conduct with minors,",
    "position": [
      "party official"
    ],
    "crime": [],
    "tags": [
      "party official"
    ]
  },
  {
    "id": 941,
    "name": "Jonathan Ryan Ensey, a",
    "year": null,
    "description": "Jonathan Ryan Ensey, a music director and worship leader at the conservative Living Way Fellowship in Conroe, TX was convicted of indecency with a child and soliciting a minor. TW: This article is more graphic than most.",
    "position": [
      "party official"
    ],
    "crime": [
      "prostitution"
    ],
    "tags": [
      "party official"
    ]
  },
  {
    "id": 942,
    "name": "Conrad Estrada Valdez, pastor",
    "year": null,
    "description": "Conrad Estrada Valdez, pastor of the conservative Restoration Outreach Christian Church in Houston, TX, pled",
    "position": [
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 943,
    "name": "Aaron Duane Shipman, pastor",
    "year": null,
    "description": "Aaron Duane Shipman, pastor of the fundamentalist conservative Bible Baptist Church in Odessa, TX, arrested for sexually assaulting a minor for two years.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 944,
    "name": "Brian Pounds, Assembly",
    "year": null,
    "description": "Brian Pounds, pastor at Assembly of God in Vernon, TX, accused of giving a minor meth and raping her.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 945,
    "name": "Sergio David Bezerra, piano teacher for Waco Bapt",
    "year": null,
    "description": "Sergio David Bezerra, piano teacher for Waco Baptist Academy has been sentenced to 80 years for molesting two children.",
    "position": [
      "educator"
    ],
    "crime": [
      "child molestation"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 946,
    "name": "William Frank Brown, pastor",
    "year": null,
    "description": "William Frank Brown, pastor of Bellmead (TX) First Baptist, wes sentenced to four 50-year concurrent sentences",
    "position": [
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 947,
    "name": "Benjamin Nelson, Bapt",
    "year": null,
    "description": "Benjamin Nelson, Baptist pastor in Texas, sentenced to 20 years for molesting a teen",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child molestation"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 948,
    "name": "Curt",
    "year": null,
    "description": "Curtis Jene Smith, after twice being convicted of molesting children, was hired as music director at a Waco Baptist Church.",
    "position": [],
    "crime": [
      "child molestation"
    ],
    "tags": []
  },
  {
    "id": 949,
    "name": "Gary Don Welch, Texas Bapt",
    "year": null,
    "description": "Gary Don Welch, Texas Baptist youth pastor, sentenced to 55 years for sexual assault of teen",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 950,
    "name": "Conner Jesse Penny, youth",
    "year": null,
    "description": "Conner Jesse Penny, youth pastor in Texas, confessed to abusing children after being arrested,",
    "position": [
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 951,
    "name": "Robert Shiflet, Texas",
    "year": null,
    "description": "Robert Shiflet, former Texas youth pastor, sentenced to 33 months for child sex trafficking, less than the minimum",
    "position": [
      "religious leader"
    ],
    "crime": [
      "sexual trafficking"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 952,
    "name": "William C. Robinson, William",
    "year": null,
    "description": "William C. Robinson, William C Robinson, pastor in Corpus Christi, arrested for sexual assaulting a child from age 9 to 14",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 953,
    "name": "David Pettigrew, Texas",
    "year": null,
    "description": "David Pettigrew, a Texas pastor, was sentenced to 30 years for producing child sexual exploitation material",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child exploitation"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 954,
    "name": "Lawrence Hopkins, Texas",
    "year": null,
    "description": "Lawrence Hopkins, Texas pastor, arrested for online solicitation of a minor in one of those stings where law enforcement officers pretend to be children.",
    "position": [
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 955,
    "name": "Ruben A. Garcia, a Texas Bapt",
    "year": null,
    "description": "Ruben A. Garcia, a Texas Baptist pastor, pleaded guilty and avoided jail in a case where he was charged with sexual assaulting a child, pleading down to enticing a child",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 956,
    "name": "Jerry Dale Carver, Texas Bapt",
    "year": null,
    "description": "Jerry Dale Carver, Texas Baptist pastor, lured a child into his car and sexually assaulted him according to the arrest affidavit",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 957,
    "name": "Shane Flournoy, Texas",
    "year": null,
    "description": "Shane Flournoy, a youth pastor and teacher at the Texas School for the Deaf, confessed to his minister that he fondled a teen. The minister went to the police.",
    "position": [
      "educator",
      "law enforcement",
      "religious leader"
    ],
    "crime": [
      "child molestation"
    ],
    "tags": [
      "educator",
      "law enforcement",
      "religious leader"
    ]
  },
  {
    "id": 958,
    "name": "Bradley Wayne Dixon",
    "year": null,
    "description": "Bradley Wayne Dixon was the dorm director at San Marcos Baptist Academy and has been convicted of sexually abusing four boys",
    "position": [],
    "crime": [
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 959,
    "name": "Santiago “Jimmy” Morales Jr., Bapt",
    "year": null,
    "description": "Santiago “Jimmy” Morales Jr., Baptist Academy dorm director, pled guilty and received ten years of probation for sexual assault of a teen.",
    "position": [],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": []
  },
  {
    "id": 960,
    "name": "George Alexander Diaz Menges, Gainesville,",
    "year": 2022,
    "description": "George Alexander Diaz Menges, Gainesville, FL, was an assistant to a failed Republican Congressional candidate was arrested four counts of sexual battery, two counts of aggravated battery, eight counts of battery and a charge of committing or facilitating a kidnapping.",
    "position": [
      "candidate",
      "congress",
      "party member"
    ],
    "crime": [
      "kidnapping"
    ],
    "tags": [
      "candidate",
      "congress",
      "party member",
      "republican"
    ]
  },
  {
    "id": 961,
    "name": "Lake Center police chief William Ray Pruitt has been",
    "year": null,
    "description": "Former Lake Center police chief William Ray Pruitt has been arrested for the sexual battery of a 14-year-old child.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 962,
    "name": "John Michael Mann, Oregon’s top admin",
    "year": null,
    "description": "John Michael Mann, Oregon’s top administrative law judge (for when there are disputes between citizens and state agencies) was indicted with 10 counts of encouraging child sexual abuse (possession of material)",
    "position": [
      "judge"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "judge"
    ]
  },
  {
    "id": 963,
    "name": "Richard J. Corkery, former",
    "year": null,
    "description": "Richard J. Corkery, former mayor of Coaldale, in Carbon Cty, PA was convicted of possession child sexual abuse : X material and sentenced to 9-36 months",
    "position": [
      "local official"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 964,
    "name": "Gordon Grabau, Special Deputy",
    "year": 2022,
    "description": "Gordon Grabau, Special Deputy Sheriff in Linn Cty, IA, was arrested on federal child sex abuse (child porn) charges.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 965,
    "name": "Chr",
    "year": null,
    "description": "Christopher Haenel pled guilty to possession child sex abuse material (child pornography) and was sentenced to 41 months",
    "position": [],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 966,
    "name": "Mark Aaron Griffin has been",
    "year": null,
    "description": "Mark Aaron Griffin has been accused of using his position as a Messianic rabbi to assault a woman by telling her that she was a gift to him from God and has been charged with four counts of sexual assault. The school board that banned Anne Frank’s book invited him to speak even after he was charged.",
    "position": [],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": []
  },
  {
    "id": 967,
    "name": "Nick Provenzano, aide to Illino",
    "year": 2018,
    "description": "Nick Provenzano, aide to Illinois GOP Rep. Randy Hultgren, was fired after being caught having a sexual encounter with a",
    "position": [
      "party official"
    ],
    "crime": [],
    "tags": [
      "party official",
      "republican"
    ]
  },
  {
    "id": 968,
    "name": "Richard “Dickie” Braswell",
    "year": 2022,
    "description": "Richard “Dickie” Braswell was re-elected to the Johnston County Commission (NC) on November 8, 2022, even though he was indicted for indecent liberties with a child in July.",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 969,
    "name": "Robert Morr",
    "year": null,
    "description": "Robert Morris was the Assistant Dean of The Wave Leadership College, a Christian college for pastors, so conservative it partnered with Choices Pregnancy Center, a fake clinic. He was sentenced to 6 years for possessing more than 500 child sexual abuse maters.",
    "position": [
      "party official",
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "party official",
      "religious leader"
    ]
  },
  {
    "id": 970,
    "name": "Dean Alan Smith, Morning Star Bapt",
    "year": null,
    "description": "Dean Alan Smith, pastor at Morning Star Baptist Church in Lame Deer, MT, was charged with sexually abusing four girls, three under age 12.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 971,
    "name": "Michael Br",
    "year": null,
    "description": "Michael Brisky - Cattaraugus County NY, Republican Election Commission = sexual harassment - complaint referred to AG",
    "position": [
      "party member"
    ],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "party member",
      "republican"
    ]
  },
  {
    "id": 973,
    "name": "Rudy Giuliani, former Trump lawyer and otherw",
    "year": null,
    "description": "Rudy Giuliani, former Trump lawyer and otherwise shameless hack, has been accused of sexual harassment. And never forget, the scene from the Borat 2 film",
    "position": [],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "maga"
    ]
  },
  {
    "id": 974,
    "name": "Matt Schlapp, chair of American Conservative Union and",
    "year": 2023,
    "description": "Matt Schlapp, chair of American Conservative Union and CPAC organizer, is accused of sustained, unwelcome groping of a Herschel Walker campaign staffer",
    "position": [
      "party official"
    ],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "party official"
    ]
  },
  {
    "id": 975,
    "name": "Barry S. Edwards, Florida Pinellas County Republican Party",
    "year": 2018,
    "description": "Barry S. Edwards, Florida Pinellas County Republican Party activist, professor, extorting sex from students",
    "position": [
      "activist",
      "party member"
    ],
    "crime": [],
    "tags": [
      "activist",
      "party member",
      "republican"
    ]
  },
  {
    "id": 976,
    "name": "John Rose, Tennessee",
    "year": null,
    "description": "John Rose, a Tennessee representative, was 42 when he met a high school girl at an Future Farmers of America competition. When she went to college, he married her. There is no allegation of criminal conduct, but a 42 y/o man selecting and grooming a high schooler for marriage is still predatory.",
    "position": [
      "state legislator"
    ],
    "crime": [],
    "tags": [
      "state legislator"
    ]
  },
  {
    "id": 977,
    "name": "Garrett Biggerstaff, former",
    "year": 2023,
    "description": "Garrett Biggerstaff, former pastor of Pleasant Grove Missionary Baptist Church Illinois (conservative, anti-gay, dominionist) has been arrested and charged with grooming.",
    "position": [
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 978,
    "name": "Joseph Kade Abbott, a teacher at the Apostolic Chr",
    "year": 2024,
    "description": "Joseph Kade Abbott, a teacher at the Apostolic Christian Academy in Merryville, TN is charged with sexual battery of a 14-year-old girl. In March 2024, he agreed to plead guilty.",
    "position": [
      "educator"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 979,
    "name": "Rafael Cuevas",
    "year": 2021,
    "description": "Rafael Cuevas took over as pastor of Temple of Prayer Assembly of God from his father Gabriel Cuevas. He was arrested in 2021 for raping a child under 12 several times over 4 years. A 2nd child came forward. He was sentenced to 20 years.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 980,
    "name": "Scott Yotka, Jacksonville",
    "year": null,
    "description": "Scott Yotka, a Jacksonville sheriff’s office dispatcher sentenced to 60 years for producing and distributing photos of himself sexually abusing young children",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 981,
    "name": "Aaron Mitchell, former Customs and Border Protection",
    "year": null,
    "description": "Aaron Mitchell, former Customs and Border Protection officer, indicted for kidnapping a 15-year-old and sexually assaulting them",
    "position": [],
    "crime": [
      "assault",
      "kidnapping"
    ],
    "tags": []
  },
  {
    "id": 982,
    "name": "Michael Patterson, former",
    "year": null,
    "description": "Michael Patterson, former city manager in Florence CO, pleaded guilty to sexual misconduct and was sentenced to two years probation, no jail time in a too-sweet plea deal. Charges included stalking, sexual contact with no consent, and providing alcohol to a minor. City settled harassment",
    "position": [],
    "crime": [
      "sexual harassment"
    ],
    "tags": []
  },
  {
    "id": 983,
    "name": "Oregon State Rep. Brian Stout has been",
    "year": 2023,
    "description": "Oregon State Rep. Brian Stout has been accused of sexual assault and threatening his accuser with violence. He claims the attacks are partisan but the accuser is a former volunteer for his campaign.",
    "position": [],
    "crime": [
      "assault",
      "sexual assault",
      "violence"
    ],
    "tags": []
  },
  {
    "id": 984,
    "name": "Dustin Spillers, a",
    "year": 2018,
    "description": "Dustin Spillers, a former youth pastor at the conservative Abba’s House church and a president of the PTA, was arrested for child molestation and child battery",
    "position": [
      "congress",
      "religious leader"
    ],
    "crime": [
      "child molestation"
    ],
    "tags": [
      "congress",
      "religious leader"
    ]
  },
  {
    "id": 985,
    "name": "John Blanchard a fervent Trump supporter who remains",
    "year": null,
    "description": "John Blanchard a fervent Trump supporter who remains pastor of Rock Church Virginia Beach was charged with soliciting sex from a police officer he believed to be a 17- year-old girl. For some reason the charges were dropped, a : X special prosecutor has now been assigned.",
    "position": [
      "law enforcement",
      "religious leader"
    ],
    "crime": [
      "prostitution"
    ],
    "tags": [
      "law enforcement",
      "maga",
      "religious leader"
    ]
  },
  {
    "id": 986,
    "name": "Chr",
    "year": null,
    "description": "Christopher Schroder, a Cincinnati police officer pleaded guilty to dereliction of duty for not turning in rape kits or investigating sexual assaults",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "assault",
      "rape",
      "sexual assault"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 987,
    "name": "Jason Kennedy, the principal of a conservative Chr",
    "year": null,
    "description": "Jason Kennedy, the principal of a conservative Christian school in Tennessee, has been charged with sexually abusing four children",
    "position": [
      "educator"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 988,
    "name": "Deric Wallace Peacock, former",
    "year": null,
    "description": "Deric Wallace Peacock, former youth pastor for South Hopewell Church of God, a conservative anti-gay church, was sentenced to 20 years for possessing and distributing child sexual abuse media with victims as young as 7.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 989,
    "name": "Sheriff’s Deputy",
    "year": null,
    "description": "Former Sheriff’s Deputy of Onandaga County, Alexander Nicholson, was charged with reoffending after being released from jail after serving his sentence for sexual abuse of minors. ht/Beks",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 990,
    "name": "Rocky Hayes",
    "year": null,
    "description": "Rocky Hayes was the Jones County Republican Party Chair. He was charged with three counts of possessing child sexual exploitation material ht Beks",
    "position": [
      "party member"
    ],
    "crime": [
      "child exploitation"
    ],
    "tags": [
      "party member",
      "republican"
    ]
  },
  {
    "id": 991,
    "name": "Gerald Fairbanks, Ada County",
    "year": null,
    "description": "Gerald Fairbanks, a former Ada County (ID) sheriff’s deputy, has been charged with 8 counts of lewd contact with a child and 2 counts of child sex abuse.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 992,
    "name": "Adam Jeremy Lew",
    "year": 2023,
    "description": "Adam Jeremy Lewis, an 8th grade teacher and wrestling coach at Pelham Park Middle School and Youth Director at Rock Mountain Lakes Baptist Church (far right) has been arrested for possession of child pornography.",
    "position": [
      "coach",
      "educator"
    ],
    "crime": [
      "child pornography"
    ],
    "tags": [
      "coach",
      "educator"
    ]
  },
  {
    "id": 993,
    "name": "Gareth Reece Goode, music school owner and active in",
    "year": 2023,
    "description": "Gareth Reece Goode, music school owner and active in church band at anti-gay church St. Paul Lutheran, was arrested for aggravated sexual assault of a child, indecency with a child and harassment. : X",
    "position": [],
    "crime": [
      "assault",
      "sexual assault",
      "sexual harassment"
    ],
    "tags": []
  },
  {
    "id": 994,
    "name": "Thomas Gilman Hartman, founding",
    "year": null,
    "description": "Thomas Gilman Hartman, founding pastor of Wings of Peace NW, in Arkansas, used his position to manipulate a man into sex out of fear of bond being revoked, Arrested for sexual assault third degree",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 995,
    "name": "Richard E. Jacklin, Kankakee County, Illino",
    "year": 2017,
    "description": "Richard E. Jacklin, Kankakee County, Illinois - was sentenced to 18 years for sexually assaulting a Shapiro Developmental Center resident in 2017.",
    "position": [],
    "crime": [
      "assault"
    ],
    "tags": []
  },
  {
    "id": 996,
    "name": "David Stone, a police office in Virginia has been",
    "year": 2023,
    "description": "David Stone, a police office in Virginia has been arrested for 50 counts of possessing child sexual exploitation material",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "child exploitation"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 997,
    "name": "Erich A. Bennett, a NJ police officer, used police databases",
    "year": null,
    "description": "Erich A. Bennett, a NJ police officer, used police databases to stalk and harass a woman who ended their relationship in",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 998,
    "name": "Adam James Maass, an Arkansas doctor",
    "year": 2022,
    "description": "Adam James Maass, an Arkansas doctor is accused of sexually assaulting his patients.",
    "position": [],
    "crime": [
      "assault"
    ],
    "tags": []
  },
  {
    "id": 999,
    "name": "Scott Chr",
    "year": null,
    "description": "Scott Christner, a youth pastor at Goshen First Baptist Church, was sentenced to 20 years for child molestation.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child molestation"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1000,
    "name": "Tony Ernest Bunton, Statesville NC",
    "year": 2021,
    "description": "Tony Ernest Bunton, a Statesville NC pastor, was arrested with 4 counts of child sexual exploitation in August 2021. While out on bail, he was arrested again for 30 counts of child sexual exploitation in October 2021.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child exploitation"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1001,
    "name": "Joshua Grover of Rockford, IL,",
    "year": 2023,
    "description": "Joshua Grover of Rockford, IL, was sentenced to 180 DAYS plus probation for 4 counts of possession of child sexual abuse material",
    "position": [],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1002,
    "name": "Troy Hinchey, Sheriff’s Deputy",
    "year": 2023,
    "description": "Troy Hinchey, a former Sheriff’s Deputy in Washington County, VA, has been charged with misdemeanor sexual battery.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1003,
    "name": "Insurrection",
    "year": null,
    "description": "Insurrectionist Daryl Johnson has been indicted for secretly recording women at a tanning salon.",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1004,
    "name": "NY Zelig, George Santos",
    "year": 2023,
    "description": "NY Congressman and real-life Zelig, George Santos has been accused of sexual harassment and of pursuing teenagers",
    "position": [
      "congress"
    ],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "congress"
    ]
  },
  {
    "id": 1005,
    "name": "Jaron Rosien",
    "year": 2023,
    "description": "Mayor Jaron Rosien of Washington, IA, also ran in GOP primary for state House but lost. He has been arrested for third degree sexual assault - accused of assaulting a customer at his bar. UPDATE: pled guilty, probation and",
    "position": [
      "congress",
      "local official",
      "party official"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "congress",
      "local official",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1006,
    "name": "Phillip Briggs, Spencerville,",
    "year": null,
    "description": "Phillip Briggs, Spencerville, OH, mayor resigned after being arrested for allegedly recording underage girls while they were undressing",
    "position": [
      "local official"
    ],
    "crime": [],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1007,
    "name": "Jonathan High, deacon of the Antioch Revival Church in",
    "year": null,
    "description": "Jonathan High, deacon of the Antioch Revival Church in Perry, FL, was sentenced to 22 years for secretly filming : X boys in church bathroom to produce child exploitation material.",
    "position": [],
    "crime": [
      "child exploitation"
    ],
    "tags": []
  },
  {
    "id": 1008,
    "name": "Daniel Gilbert Franklin, track coach at North Bay Haven",
    "year": null,
    "description": "Daniel Gilbert Franklin, track coach at North Bay Haven High School, admitted filming student while she showered. Charged with voyeurism",
    "position": [
      "coach"
    ],
    "crime": [],
    "tags": [
      "coach"
    ]
  },
  {
    "id": 1009,
    "name": "Fred Gammon",
    "year": 2023,
    "description": "Pastor Fred Gammon of Miami, OK was charged with felony child abuse. Gammon is the pastor of Wayside Assembly of God church in Wyandotte.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1010,
    "name": "Ted J. Tomaszewski, Republican",
    "year": null,
    "description": "Ted J. Tomaszewski, former Republican mayor and county commission candidate has been arrested for sexual assault of a 15-year-old.",
    "position": [
      "candidate",
      "local official",
      "party member"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "candidate",
      "local official",
      "party member",
      "republican"
    ]
  },
  {
    "id": 1011,
    "name": "Matthew T. Trav",
    "year": 2023,
    "description": "Matthew T. Travis, pastor of Apostolic Life United Pentecostal Church in Buffalo, TX, has been charged with three counts for Sexual Assault of a Child.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1012,
    "name": "Clark Trav",
    "year": 2023,
    "description": "Clark Travis, a pastoral leader at Centerville Apostolic Church and Apostolic Life United Pentecostal Church in Buffalo, TX was charged with five counts of Sexual Assault of a child and one count of Sexual Abuse of a Child under 14.",
    "position": [
      "party official",
      "religious leader"
    ],
    "crime": [
      "assault",
      "sexual abuse",
      "sexual assault"
    ],
    "tags": [
      "party official",
      "religious leader"
    ]
  },
  {
    "id": 1013,
    "name": "Rightwing Radio Host Daniel W. Merrick who has publ",
    "year": null,
    "description": "Rightwing Radio Host Daniel W. Merrick who has published several books and songs and fulminates against homosexuality and Democrats on his radio program and Facebook has been charged with 886 counts of child sexual exploitation materials and 1 of criminal use of communications facility. He blames his wife.",
    "position": [],
    "crime": [
      "child exploitation"
    ],
    "tags": []
  },
  {
    "id": 1014,
    "name": "Stephen Arthur Morr",
    "year": null,
    "description": "Stephen Arthur Morris, former pastor of anti-gay archconservative Oliver’s Grove Baptist Church, who is now serving 10-17 years for raping three minors has been charged with anothere 26 charges of raping a minor who is a relative. : X",
    "position": [
      "religious leader"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1015,
    "name": "Matthew Reiber, pastor",
    "year": null,
    "description": "Matthew Reiber, pastor of the anti-gay New Life Christian Church in Chickasaw, OK, has been charged with inappropriate touching of a minor child.",
    "position": [
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1016,
    "name": "Chad Rider, former youth leader at Church of the Nazarene",
    "year": 2023,
    "description": "Chad Rider, former youth leader at Church of the Nazarene and chiropractor, was sentenced to 60 years for producing child exploitation material in collaboration with the pastor David Pettigrew (965)",
    "position": [
      "party official",
      "religious leader"
    ],
    "crime": [
      "child exploitation"
    ],
    "tags": [
      "party official",
      "religious leader"
    ]
  },
  {
    "id": 1017,
    "name": "Anastasia Dawson has been",
    "year": null,
    "description": "Anastasia Dawson has been charged with seven felonies involveing sexual abuse of a minor whom she met while a youth leader at the Hamilton MO LDS church",
    "position": [
      "party official"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "party official"
    ]
  },
  {
    "id": 1018,
    "name": "Frank Pavone, Trump",
    "year": null,
    "description": "Frank Pavone, Trumpist former Catholic priest defrocked for blasphemous social media posts, is accused of sexual misconduct including coercive physical contact",
    "position": [
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "maga",
      "religious leader"
    ]
  },
  {
    "id": 1019,
    "name": "Jeffrey Bedwell, sentenced",
    "year": null,
    "description": "Jeffrey Bedwell, sentenced to 30 years for molesting a child for several years.",
    "position": [],
    "crime": [
      "child molestation"
    ],
    "tags": []
  },
  {
    "id": 1020,
    "name": "David Arthur Kendall",
    "year": 2022,
    "description": "David Arthur Kendall was convicted for a lewd act with a minor and is a lifetime registered sex offender. He also leads a MAGA group Maine First opposing trans people.",
    "position": [],
    "crime": [],
    "tags": [
      "republican"
    ]
  },
  {
    "id": 1021,
    "name": "Harry Brar, George Santos campaign finance",
    "year": null,
    "description": "Harry Brar, George Santos campaign finance committeeperson, was arrested for attacking an eleven-year- old boy and his mother, who caught him with her son",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1022,
    "name": "Charles Sutherland, a former librarian in Prince George’s",
    "year": 2023,
    "description": "Charles Sutherland, a former librarian in Prince George’s Co, Maryland, schools committed an anti-gay hate crime last year, painting groomer on public library library doors. Now he has been charged with possession child sexual exploitation material",
    "position": [],
    "crime": [
      "child exploitation"
    ],
    "tags": []
  },
  {
    "id": 1023,
    "name": "Jacob Woods, Rutherford County Bapt",
    "year": null,
    "description": "Jacob Woods, a youth pastor at Rutherford County Baptist Church in Smyrna, TN, began grooming an underage girl there and has been indicted for five counts of statutory rape.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1024,
    "name": "Denn",
    "year": null,
    "description": "Dennis Wayne Laferty, pastor of Thompson United Methodist Church in Geauga County, Ohio, has been charged with sexual battery, sexual imposition (victim between 13 and 16), and gross sexual imposition (under 13) of minors over the past 4 years.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1025,
    "name": "Michael Guglielmo, recently featured on FOX News as a",
    "year": null,
    "description": "Michael Guglielmo, recently featured on FOX News as a NH anti-trans activist who dressed up at Julius Caesar at a school board meeting has been charged with sexual grabbing a juvenile and assaulting a woman",
    "position": [
      "activist"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "activist"
    ]
  },
  {
    "id": 1026,
    "name": "Emanuel Rivera, a Vernon NJ, police officer, admitting",
    "year": null,
    "description": "Emanuel Rivera, a Vernon NJ, police officer, admitting making making sexual advances to women while on duty, admitted the balance of power and intimidation, plea deal “conspiracy to commit official misconduct” was facing sexual assault charges.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1027,
    "name": "Pastor Milton Martin III, of",
    "year": null,
    "description": "Pastor Milton Martin III, of the First Pentacostal Church in Chalmette, LA, was arrested for raping a child since she was 14 until she was 17 and reported him.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1028,
    "name": "Andrew Kloster, congressional",
    "year": null,
    "description": "Andrew Kloster, congressional counsel for Matt Gaetz, promotes rape culture. He once wrote “Consent is probably modern society’s most pernicious fetish.” He was talking about animals, arguing against outlawing bestiality. He said he wants a woman who looks like she just got punched. And much more including arguing slavery was voluntary.",
    "position": [
      "congress"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "congress"
    ]
  },
  {
    "id": 1029,
    "name": "Donald McKinney, City Council Pro Tem",
    "year": 2022,
    "description": "Donald McKinney, City Council and Mayor Pro Tem of Pickens, SC was arrested for sexually abusing a minor between 15 and 16",
    "position": [
      "local official"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1030,
    "name": "Brandon Michael Fox, a Daytona police officer",
    "year": 2023,
    "description": "Brandon Michael Fox, a Daytona police officer was sentenced to 25 years in prison and 45 years probation for possession of child sexual exploitation material : X",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "child exploitation"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1031,
    "name": "David Duffett, Bible Bapt",
    "year": null,
    "description": "David Duffett, youth pastor at Bible Baptist Church has been arraigned for felony sexual abuse of a minor",
    "position": [
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1032,
    "name": "Byron W",
    "year": null,
    "description": "Byron Wiscombe, former City Councilmember from Ammon, Idaho was sentenced from 3 to 33 years for raping a minor from when she was 14 until she was 21.",
    "position": [
      "local official"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1033,
    "name": "Gary Buckaloo, First",
    "year": 2023,
    "description": "Gary Buckaloo, former youth pastor at the rightwing First Baptist Church in Normangee and a school teacher, charged with Sexual Contact and Abuse of a Child under 14.",
    "position": [
      "educator",
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "educator",
      "religious leader"
    ]
  },
  {
    "id": 1034,
    "name": "International Churches of Chr",
    "year": 2023,
    "description": "International Churches of Christ joined other churches in institutionally providing cover and protection to sexual predators",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1035,
    "name": "William Morr",
    "year": null,
    "description": "William Morrissey, a school resource officer in Cayuga County, NY. was arrested for sexually abusing a 14yo girl ignored order of protection to contact her, cited for contempt",
    "position": [],
    "crime": [
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1036,
    "name": "Charles Wadlington, professor at Abilene Chr",
    "year": null,
    "description": "Charles Wadlington, professor at Abilene Christian University, sexual abuse of children : X",
    "position": [],
    "crime": [
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1037,
    "name": "Joshua Wine, Iowa",
    "year": null,
    "description": "Joshua Wine, Iowa National Guard recruiter, charged with sexuallly abusing a 10-year-old girl",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1038,
    "name": "Leslie Shawn Brock, Lockland",
    "year": 2022,
    "description": "Leslie Shawn Brock, Lockland city councilman until his arrest in 2022 for possession of CSAM was sentenced to three years in a plea deal.",
    "position": [
      "local official"
    ],
    "crime": [
      "child pornography"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1039,
    "name": "Jared Woodfill, Harr",
    "year": 2023,
    "description": "Jared Woodfill, Harris County, TX, GOP chair and anti-gay activist, knew his law partner Paul Pressler was accused of child sex abuse but not only continued to work with him, he lied to help cover it up.",
    "position": [
      "activist",
      "party official"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "activist",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1040,
    "name": "A state trooper in Alaska, Vance Peronto, pulled over a 16-",
    "year": 2023,
    "description": "A state trooper in Alaska, Vance Peronto, pulled over a 16- year-old girl, did not issue a citation, contacted her later, invited her to a hotel where he was met by police.Convicted of sexual abuse of a minor.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1041,
    "name": "Fulton Brock, a Maricopa County Superv",
    "year": null,
    "description": "Fulton Brock, a Maricopa County Supervisor, used his influence with Sheriff Joe Arpaio to protect his wife and daughter who were both sexually abusing a minor child.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1042,
    "name": "Nick Johnson, former coach at anti-gay Huntington",
    "year": 2023,
    "description": "Nick Johnson, former coach at anti-gay Huntington University, arrested for felony sexual battery",
    "position": [
      "coach"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "coach"
    ]
  },
  {
    "id": 1043,
    "name": "Jeffery York, pastor",
    "year": 2023,
    "description": "Jeffery York, pastor of the anti-gay New Beginnings Community Church in San Luis Obispo, was charged with sexually abusing a child for three years.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1044,
    "name": "Austin Haynes, former",
    "year": null,
    "description": "Austin Haynes, former West Virginia state delegate, was sued for sexual harassment by a woman who worked with him to pass a bill. He sent inappropriate messages and offered to work on bill for sex.",
    "position": [],
    "crime": [
      "sexual harassment"
    ],
    "tags": []
  },
  {
    "id": 1045,
    "name": "Jonathan Sauers, teacher at Faith Academy (uses RW",
    "year": 2023,
    "description": "Jonathan Sauers, teacher at Faith Academy (uses RW Abeka & Bob Jones University curriculum) has been arrested for sexually abusing a student.",
    "position": [
      "educator"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1046,
    "name": "Wesley Kendall Allen",
    "year": 2023,
    "description": "Wesley Kendall Allen was a prison guard in a youth facility in Utah where he sexually abused a young girl. While awaiting sentencing, another woman came forward to claim he raped her when she was a teen and he was a cop. He has a long history of being fired for sexual misconduct, employers passing the problem on to others.",
    "position": [],
    "crime": [
      "rape",
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1047,
    "name": "Johnny Hunt, former Southern Bapt",
    "year": 2022,
    "description": "Johnny Hunt, former Southern Baptist Conference president, is credibly accused of assaulting a pastor’s wife.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1048,
    "name": "John Perry, co-author of books by Mike Huckabee and Roy",
    "year": null,
    "description": "John Perry, co-author of books by Mike Huckabee and Roy Moore was accused of child molestation. In one case, the police investigated and sustained the accusation but it was outside the statute of limitations. In the other, it is civil litigation involving the same victim.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "child molestation"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1049,
    "name": "Matthew Durham",
    "year": 2023,
    "description": "Matthew Durham was arrested for domestic violence, allegedly attacking his wife in front of their children. He’s been suspended from the Oconee County Council and his trial was set for April 2023. He reconciled, his wife now refuses to testify so charges were dismissed on 3/30/2023",
    "position": [
      "local official"
    ],
    "crime": [
      "domestic violence",
      "violence"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1050,
    "name": "Texas State Rep. Bryan Slaton",
    "year": 2023,
    "description": "Texas State Rep. Bryan Slaton is under investigation for improper conduct with an intern - including providing her alcohol though she is under 21 & inviting her to his apartment after 10 pm",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1051,
    "name": "Paul Zunker, former Carver County W",
    "year": 2012,
    "description": "Paul Zunker, former Carver County Wis. GOP Chair, pled guilty to criminal sexual contact with a person under 16. He was sentenced to 6 mo. and 15 yrs probation in 2012. In 2013, he was charged again for the same crime with a different person. He now leads a sex addiction counseling nonprofit called Turnback Ministries",
    "position": [
      "party official"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "party official",
      "republican"
    ]
  },
  {
    "id": 1052,
    "name": "Todd Wade Allen, former Hutchinson, KS, police officer",
    "year": 2023,
    "description": "Todd Wade Allen, former Hutchinson, KS, police officer pled guilty to 12 felony sex crimes and 5 breach of privacy crimes.",
    "position": [
      "law enforcement"
    ],
    "crime": [],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1053,
    "name": "Timothy Wade Owen, former",
    "year": null,
    "description": "Timothy Wade Owen, former police officer in Edmond, OK, is charged with an improper relationship with a 14-year-old girl. Caught because a good person sent an anonymous letter to police.",
    "position": [
      "law enforcement"
    ],
    "crime": [],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1054,
    "name": "Joshua Craft, Otter Creek",
    "year": null,
    "description": "Joshua Craft, unsuccessful candidate Otter Creek Township Trustee, Vigo County in Indiana, who truthfully chose the name Josh38PervDad was charged with possession of CSAM",
    "position": [
      "candidate"
    ],
    "crime": [
      "child pornography"
    ],
    "tags": [
      "candidate"
    ]
  },
  {
    "id": 1055,
    "name": "Michael Wayne Coleman, a Mormon b",
    "year": 2014,
    "description": "Michael Wayne Coleman, a Mormon bishop in Arizona, was arrested for soliciting a minor. He was fired by the church immediately.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "prostitution"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1057,
    "name": "Ali Alexander, Stop the Steal organizer and Roger Stone",
    "year": null,
    "description": "Ali Alexander, Stop the Steal organizer and Roger Stone wannabe, has been asking underage boys for dick pics. AT least one was only 15, another 17.",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1058,
    "name": "Chr",
    "year": null,
    "description": "Christopher Link Jones who worked for InfoWars and more recently for a creationist theme park has been convicted of lewd acts on children and battery, has been arrested now for child sex abuse",
    "position": [],
    "crime": [
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1059,
    "name": "Kent Stermon, close DeSant",
    "year": null,
    "description": "Kent Stermon, close DeSantis ally and GOP donor killed himself, allegedly because police were investigating interaction with minor",
    "position": [
      "law enforcement",
      "party official"
    ],
    "crime": [],
    "tags": [
      "law enforcement",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1060,
    "name": "Bernd Niels “Dutch” Deblouw, a Republican who ran for",
    "year": 2022,
    "description": "Bernd Niels “Dutch” Deblouw, a Republican who ran for City Council in Longview, TX, was arrested in Aug 2022 for intent to promote child sex abuse material. He was arrested again in Apr 2023 for invasive video recording.",
    "position": [
      "local official",
      "party member"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "local official",
      "party member",
      "republican"
    ]
  },
  {
    "id": 1061,
    "name": "Scotty Campbell, TN",
    "year": 2023,
    "description": "Scotty Campbell, TN House Rep, resigned after subcommittee investigation found he sexually harassed at : X least one intern",
    "position": [
      "congress"
    ],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "congress"
    ]
  },
  {
    "id": 1062,
    "name": "Daniel Perry, the",
    "year": null,
    "description": "Daniel Perry, the convicted racist murderer that Gov Abbott wants to pardon is also a child predator.",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1063,
    "name": "Jacob Desormeaux, a Lafayette, LA, police officer",
    "year": null,
    "description": "Jacob Desormeaux, a Lafayette, LA, police officer was arrested for showing pornography to two underage teens, charged with two counts of obscenity with children.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "child pornography"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1064,
    "name": "Adrienne Peña-Garza, Chair of Hidalgo County",
    "year": null,
    "description": "Adrienne Peña-Garza, Chair of Hidalgo County Republicans and the sister of Aron Peña, has been sued for covering up her brother’s sexual harassment.",
    "position": [
      "party member",
      "party official"
    ],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "party member",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1065,
    "name": "William Lee Lawshe of F",
    "year": 2018,
    "description": "William Lee Lawshe of Fish and Wildlife in Florida was charged with possession CSAM. Another \"of the Year\" alumnus. National wildlife officer of the Year in 2018",
    "position": [],
    "crime": [
      "child pornography"
    ],
    "tags": []
  },
  {
    "id": 1066,
    "name": "John Brownlow, former admin",
    "year": null,
    "description": "John Brownlow, former administrator at Westminster Academy, sexual exploitation of a child, and much more. Westminster is part of ACCS (Doug Wilson)",
    "position": [],
    "crime": [
      "child exploitation"
    ],
    "tags": []
  },
  {
    "id": 1067,
    "name": "Regent University law school ass",
    "year": null,
    "description": "Former Regent University law school assistant dean Stephen L. McPherson - convicted of raping three underage girls",
    "position": [],
    "crime": [
      "rape"
    ],
    "tags": []
  },
  {
    "id": 1068,
    "name": "Percy Wilbur Rock Jr, candidate",
    "year": 2023,
    "description": "Percy Wilbur Rock Jr, candidate in the Republican primary for the Greencastle-Antrim School Board was charged with possessing child sexual abuse material. He admitted to police he has been looking at CSAM for 10 years.",
    "position": [
      "candidate",
      "law enforcement",
      "party member"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "candidate",
      "law enforcement",
      "party member",
      "republican"
    ]
  },
  {
    "id": 1069,
    "name": "Jim Duran, Ventura City Lead",
    "year": 2023,
    "description": "Jim Duran, Ventura City Councilman and Lead Pastor at The River Community Church knew his son was sexually abusing a 14-year-old girl and did not do mandatory reporting, his wife coerced the girl to not report.",
    "position": [
      "local official",
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "local official",
      "religious leader"
    ]
  },
  {
    "id": 1070,
    "name": "Andrea Speck, GOP",
    "year": null,
    "description": "Andrea Speck, failed GOP primary candidate for PA House, candidate for Huntingdon County Commission, has been charged with felony strangulation, misdemeanor simple assault and summary harassment,",
    "position": [
      "candidate",
      "congress",
      "party official"
    ],
    "crime": [
      "assault",
      "sexual harassment"
    ],
    "tags": [
      "candidate",
      "congress",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1071,
    "name": "Steven Crowder",
    "year": 2023,
    "description": "Steven Crowder was revealed to be a verbally and emotionally abusive husband on Ring video. His wife is divorcing him and he is furious that is allowed. In addition, workers allege he exposes his genitals at work.",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1072,
    "name": "Erickson Lee, law",
    "year": null,
    "description": "Erickson Lee, law enforcement officer and youth pastor, child sex crimes. NC",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child exploitation"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1073,
    "name": "Earl Worden, an activ",
    "year": 2022,
    "description": "Earl Worden, an activist in Open Carry Texas and YouTube personality who tested limits of taping police convicted of rape and also of child sexual abuse",
    "position": [
      "activist",
      "law enforcement"
    ],
    "crime": [
      "rape",
      "sexual abuse"
    ],
    "tags": [
      "activist",
      "law enforcement"
    ]
  },
  {
    "id": 1074,
    "name": "Emma Hancock",
    "year": null,
    "description": "Emma Hancock was a substitute teacher and acting in the capacity when she allegedly groped a teenaged boy in a classroom closet. She had an inappropriate relationship, text, exchange nudes. Her husband is Chief of Police, her father",
    "position": [
      "educator",
      "law enforcement"
    ],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "educator",
      "law enforcement"
    ]
  },
  {
    "id": 1075,
    "name": "Harry Jackson, Fairfax VA",
    "year": 2018,
    "description": "Harry Jackson, Fairfax VA school board candidate endorsed by the GOP, has been arrested for domestic violence against two of his wives. Pled no contest in 2018, twice sent to anger management/batterer intervention",
    "position": [
      "candidate",
      "party official"
    ],
    "crime": [
      "domestic violence",
      "violence"
    ],
    "tags": [
      "candidate",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1076,
    "name": "Kieran Cartharn, unsuccessful",
    "year": null,
    "description": "Kieran Cartharn, unsuccessful candidate for Columbus OH city council - pled to the lesser charge of gross sexual imposition, also domestic violence",
    "position": [
      "candidate",
      "local official"
    ],
    "crime": [
      "domestic violence",
      "violence"
    ],
    "tags": [
      "candidate",
      "local official"
    ]
  },
  {
    "id": 1077,
    "name": "Laverne Paul Fox, was",
    "year": 2021,
    "description": "Laverne Paul Fox, was the principal of Faith Baptist Academy in Wildomar, CA and the bus director for the church when he molested a 15-year-old girl sentenced to two years in prison",
    "position": [
      "educator"
    ],
    "crime": [
      "child molestation"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1078,
    "name": "Jana Bradford - tough on crime prosecutor",
    "year": null,
    "description": "Jana Bradford - tough on crime prosecutor is alleged to have enabled and covered up for her pedophile uncle. He raped children, created CSAM. More than 100 videos of him raping children.",
    "position": [],
    "crime": [
      "child pornography",
      "rape"
    ],
    "tags": []
  },
  {
    "id": 1079,
    "name": "Reginald 'Reggie' Loper, a member of the Effingham",
    "year": null,
    "description": "Reginald 'Reggie' Loper, a member of the Effingham County Board of Commissioners was arrested for child molestation, The Board said they “pray for him and his family as they deal with this situation.” I guess they won’t be praying",
    "position": [
      "local official"
    ],
    "crime": [
      "child molestation"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1080,
    "name": "Michael Sperou, North Clackamas Bible Community. Third",
    "year": 2023,
    "description": "Michael Sperou, North Clackamas Bible Community. Third conviction, two overturned and this was for raping a child while she was from 3 to 10 years old. Sentenced to 13 years.",
    "position": [],
    "crime": [
      "rape"
    ],
    "tags": []
  },
  {
    "id": 1081,
    "name": "Ron Causby, GOP",
    "year": null,
    "description": "Ron Causby, GOP podcaster/influencer and candidate for Tulsa County GOP Chair In Oklahoma was arrested for burglary and stalking - breaking into his estranged wife’s home though she no longer lived there. He’s very active in the anti-education movement",
    "position": [
      "candidate",
      "party official"
    ],
    "crime": [],
    "tags": [
      "candidate",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1082,
    "name": "Larry Wilcoxson, aide to GOP state Rep. Byron Donalds",
    "year": 2012,
    "description": "Larry Wilcoxson, aide to GOP state Rep. Byron Donalds and himself a candidate Hendry County Clerk has a troubling history of violent intimidation directed against women in politics, even REpublican women, a DV allegation from former girlfriend, and an arrest for child molestation.",
    "position": [
      "candidate",
      "clerk",
      "party member",
      "party official"
    ],
    "crime": [
      "child molestation"
    ],
    "tags": [
      "candidate",
      "clerk",
      "party member",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1083,
    "name": "Bart Jetton, Mayor",
    "year": null,
    "description": "Bart Jetton, Mayor of Reno, Texas, resigned after being charged with assault with a deadly weapon after his wife. His wife reported he made a terroristic threat when she called the",
    "position": [
      "local official"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1084,
    "name": "Jared Michael Boyce",
    "year": null,
    "description": "Jared Michael Boyce is a member of Patriot Front and he pleaded guilty to last month to nine felony counts of sexual exploitation of a minor and a misdemeanor count of dealing in material harmful to a minor.",
    "position": [],
    "crime": [
      "child exploitation"
    ],
    "tags": []
  },
  {
    "id": 1085,
    "name": "Shawn Bergstrand",
    "year": null,
    "description": "Shawn Bergstrand is the founder of Right-Side Up “Christian” fashion and sponsor of TurningPoint USA’s pastor’s summit. He is also a registeredsex offender convicted of attempted coercion and enticement of a minor",
    "position": [
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1086,
    "name": "Chr",
    "year": null,
    "description": "Christopher Hundl, was a pastor at Baylor Chapter of Chi Alpha but resigned. He has since been arrested and charged for continuous sexual abuse of a child.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1087,
    "name": "Chr",
    "year": null,
    "description": "Christopher Fourcade was Director of Children’s Ministries at First Christian Church, advisory board of Chamber, and Fostering Futures board member - arrested for molesting a 12-year-old child.",
    "position": [],
    "crime": [
      "child molestation"
    ],
    "tags": []
  },
  {
    "id": 1088,
    "name": "Matthew Porter, Bethel Bapt",
    "year": 2008,
    "description": "Matthew Porter, former youth pastor at Bethel Baptist Church in Bradenton, FL was sentenced to four months in jail and two years of probation for secretly recording minors changing clothes.",
    "position": [
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1089,
    "name": "Fabian Basabe, Republican state rep for Miami, Florida",
    "year": 2023,
    "description": "Fabian Basabe, Republican state rep for Miami, Florida is being investigated for slapping an aide. As of 7/6/23 he has been accused of sexual harassment",
    "position": [
      "party member"
    ],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "party member",
      "republican"
    ]
  },
  {
    "id": 1090,
    "name": "Donny Raney, pastor",
    "year": 2023,
    "description": "Donny Raney, pastor of Okeechobee Missionary Baptist",
    "position": [
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1091,
    "name": "Matthew Reilly, a Rhode",
    "year": null,
    "description": "Matthew Reilly, a Rhode Island Republican Councilman and local Party Chair has been charged with child molestation and solicitation of a child (a 12-year-old girl)",
    "position": [
      "local official",
      "party member",
      "party official"
    ],
    "crime": [
      "child molestation"
    ],
    "tags": [
      "local official",
      "party member",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1092,
    "name": "John Dizon, SUNY",
    "year": null,
    "description": "John Dizon, SUNY and Newburgh city police officer, arrested for raping a child under the age of thirteen. : X",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1093,
    "name": "Daryl Stagg, a powerful Bapt",
    "year": 2023,
    "description": "Daryl Stagg, a powerful Baptist leader, a strategist for Big Creek and CenLa Baptist associations, has been charged with three counts each of oral sexual battery, first degree rape, aggravated crimes against nature and indecent behavior with juveniles.",
    "position": [
      "party official"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "party official"
    ]
  },
  {
    "id": 1094,
    "name": "Faith Academy in Mobile, AL, will not allow a student to",
    "year": null,
    "description": "Faith Academy in Mobile, AL, will not allow a student to play softball without signing a “hold harmless” waiver after that student was sexually abused by soccer coach",
    "position": [
      "coach"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "coach"
    ]
  },
  {
    "id": 1095,
    "name": "Maryville Apostolic Church not only did not report sexual",
    "year": 2023,
    "description": "Maryville Apostolic Church not only did not report sexual abuse of children, they told families not to report it. They encouraged young girls to date older men.",
    "position": [],
    "crime": [
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1096,
    "name": "Mel Gibson, actor/activ",
    "year": 2011,
    "description": "Mel Gibson, actor/activist, pleaded no contest to domestic violence. Conviction vacated after he completed three years probation, took classes.",
    "position": [
      "activist"
    ],
    "crime": [
      "domestic violence",
      "violence"
    ],
    "tags": [
      "activist"
    ]
  },
  {
    "id": 1097,
    "name": "Brian Hawkins, San",
    "year": 2023,
    "description": "Brian Hawkins, San Jacinto City councilmember, was arrested on suspicion of assaulting two children.",
    "position": [
      "local official"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1098,
    "name": "Bradley Putnam, Freedom Fellowship",
    "year": 2022,
    "description": "Bradley Putnam, pastor at Freedom Fellowship in Keizer, OR, was sentenced to 27 months for child rape.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1099,
    "name": "Daniel Savala, former",
    "year": 2023,
    "description": "Daniel Savala, former youth pastor in Ketchikan Alaska where he was convicted for the sexual abuse of a child has been an itenierent pastor traveling from ministry to ministry. He was arrested in June 2023 for forcing kids to perform sex act in the home of a mentee.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1100,
    "name": "Joseph Charles Golinske - Proud Boy leader",
    "year": null,
    "description": "Joseph Charles Golinske - Proud Boy leader convicted of lewd conduct with a minor in Florida, of sexual assault in Michigan",
    "position": [
      "party official"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "party official"
    ]
  },
  {
    "id": 1101,
    "name": "Dwight C. John, on governing board of the Chr",
    "year": null,
    "description": "Dwight C. John, on governing board of the Christian and Missionary Alliance, was charged with 14 counts of child sex abuse plus 3 related felony counts. He is also associated with Daniel Savala",
    "position": [],
    "crime": [
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1102,
    "name": "Chi Alpha and Assemblies of God protected Daniel Savala",
    "year": 2012,
    "description": "Chi Alpha and Assemblies of God protected Daniel Savala and wrote leniency letters to reduce his sentence in 2012 impugning the victims. Allowed years of abuse to continue",
    "position": [],
    "crime": [
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1103,
    "name": "Steve Morgan, founder",
    "year": 1986,
    "description": "Steve Morgan, founder of The Network, raped a 15-year- old boy in 1986. People allege there has been a coverup of his past actions which should have been divulged. They also allege spiritual abuse.",
    "position": [],
    "crime": [
      "rape",
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1104,
    "name": "Chr",
    "year": null,
    "description": "Christopher Dorworth, former GOP state rep in Florida, current GOP lobbyists and Matt Gaetz buddy has been accused of trafficking and rape by a woman who was underage at the time.",
    "position": [
      "lobbyist",
      "party official"
    ],
    "crime": [
      "rape",
      "sexual trafficking"
    ],
    "tags": [
      "lobbyist",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1105,
    "name": "Zachary Reynolds, a teacher at Bunn High School in",
    "year": null,
    "description": "Zachary Reynolds, a teacher at Bunn High School in Louisville, North Carolina was charged with indecent liberties with a student",
    "position": [
      "educator"
    ],
    "crime": [],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1106,
    "name": "Jamie Flanery, Arkansas",
    "year": null,
    "description": "Jamie Flanery, former youth pastor, Arkansas is accused of sexually assaulting a fifteen-year-old girl. h/t",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1107,
    "name": "Donald Lee Flanery, Jamie Flanery’s",
    "year": null,
    "description": "Donald Lee Flanery, a former pastor and Jamie Flanery’s father, was sentenced to 35 years for raping a child.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1108,
    "name": "Anthony Emanuel, former",
    "year": 2008,
    "description": "Anthony Emanuel, former mayor of Trenton, GA, and failed Republican candidate for county executive (2008) was charged with child molestation.",
    "position": [
      "candidate",
      "local official",
      "party member"
    ],
    "crime": [
      "child molestation"
    ],
    "tags": [
      "candidate",
      "local official",
      "party member",
      "republican"
    ]
  },
  {
    "id": 1109,
    "name": "Scott Erickson, pastor",
    "year": 2023,
    "description": "Scott Erickson, pastor of Redemption Church in Arcadia FL, under investigation for child molestation h/t Beks",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child molestation"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1110,
    "name": "Michael Chayton Bullard, firefighter",
    "year": null,
    "description": "Michael Chayton Bullard, firefighter with Bullard VFD, charged with raping a child .",
    "position": [],
    "crime": [
      "rape"
    ],
    "tags": []
  },
  {
    "id": 1111,
    "name": "Terry Rud",
    "year": null,
    "description": "Terry Rudisill, former pastor of Cornerstone Independent Baptist Church in Lincolnton NC sexually assaulted a child : X while out on bail for sexually assaulting a different child. Via Beks",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1112,
    "name": "Stephanie Neipling, the",
    "year": null,
    "description": "Stephanie Neipling, the former deputy director of constituent services for former Governor Asa Hutchinson, has been arrested for sexually assaulting (raping) a fifteen- year-old boy.",
    "position": [
      "governor"
    ],
    "crime": [
      "assault",
      "rape"
    ],
    "tags": [
      "governor"
    ]
  },
  {
    "id": 1113,
    "name": "Angela Leigh Stewart, teacher at a private Chr",
    "year": null,
    "description": "Angela Leigh Stewart, teacher at a private Christian school, charged with crimes against special needs student",
    "position": [
      "educator"
    ],
    "crime": [],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1114,
    "name": "Michael James Shover, a",
    "year": null,
    "description": "Michael James Shover, a priest at Holy Redeemer in Pella, IA, was rallying in support of Iowa’s abortion ban when asked about pedophiles, referencing the Catholic church controversy. His reply was “Why is pedophilia wrong?” He said it several times. He’s now claiming that he was asserting the + LGBTQ+ stands for pedophile.",
    "position": [
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1115,
    "name": "Scott Saunders, Jr",
    "year": null,
    "description": "Scott Saunders, Jr was the mayor of Smithville, TX. He resigned shortly before his arrest for child sex crimes. He pleaded guilty to sexual assault and sexual assault of a child and was sentenced to 5 years deferred adjudication which means in 5 years, his record will be clean - erasing his history",
    "position": [
      "local official"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1116,
    "name": "Ray Uttaro, VA,",
    "year": null,
    "description": "Ray Uttaro, VA, was a law enforcement and corrections officer as well as with DARE. He has been charged with dozens of sex crimes against children. h/t Dara",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1117,
    "name": "Ferrell K",
    "year": 2021,
    "description": "Ferrell Kissiar, a Pentecostal pastor in Illinois, pled guilty to Child Sexual Abuse Material, and more. In an actual sex ring.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1118,
    "name": "Cole Wagner, Alabama Dept of Ed staff and ED of Alliance",
    "year": 2023,
    "description": "Cole Wagner, Alabama Dept of Ed staff and ED of Alliance for a Pro Life Alabama charged with child sex abuse",
    "position": [],
    "crime": [
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1119,
    "name": "Benjamin Yu, Lake Forest, CA, City Councilmember has",
    "year": null,
    "description": "Benjamin Yu, Lake Forest, CA, City Councilmember has been arrested for domestic violence. Lake Forest Councilmember Benjamin Yu arrested on suspicion of domestic violence",
    "position": [
      "local official"
    ],
    "crime": [
      "domestic violence",
      "violence"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1120,
    "name": "Lawrence Fourkiller, a teacher in Stillwell, OK",
    "year": null,
    "description": "Lawrence Fourkiller, a teacher in Stillwell, OK charged with sexual abuse of a child under 12",
    "position": [
      "educator"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1121,
    "name": "Brian Heck, Belgrade school trustee, who campaigned",
    "year": null,
    "description": "Brian Heck, Belgrade school trustee, who campaigned against any progressive social agenda, resigned after arrest in a child exploitation and human trafficking investigation.",
    "position": [],
    "crime": [
      "child exploitation",
      "sexual trafficking"
    ],
    "tags": []
  },
  {
    "id": 1122,
    "name": "Jose Tirado, a Seminole County Deputy, used h",
    "year": 2015,
    "description": "Jose Tirado, a Seminole County Deputy, used his access to information about investigations of child predators to warn them and help them evade arrest.",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1123,
    "name": "Dan Waddington, former police officer, Utah Valley",
    "year": null,
    "description": "Dan Waddington, former police officer, Utah Valley University adjunct professor of Criminal Justice, former DHS employee - arrested for possessiong child sexual abuse material. His FB is full of anti-Democratic posts and memes.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1124,
    "name": "Joel Womochil",
    "year": null,
    "description": "Joel Womochil was Police Chief of Burns, Kansas until he resigned a day before his arrest for possessing CSAM - even a child so young they used a pacifier h/t Beks He’s been sentenced to 60 years",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "child pornography"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1125,
    "name": "Ryan K",
    "year": 2013,
    "description": "Ryan Kissell, Special Ed teacher and football coach at Nodaway Valley Community School District, Iowa was arrested and charged with 46 counts of child sexual abuse. The child was under 12 for the duration of the abuse that began in 2013.",
    "position": [
      "coach",
      "educator"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "coach",
      "educator"
    ]
  },
  {
    "id": 1126,
    "name": "Jeff Thomas",
    "year": null,
    "description": "Jeff Thomas is no longer the Republican DA in Somerset County, PA. He was convicted by a jury of indecent assault and several other sexual assault crimes. He was sentenced to 7 years in prison.",
    "position": [
      "party member"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "party member",
      "republican"
    ]
  },
  {
    "id": 1127,
    "name": "Edward (Ed) Wonnacott, a Celebrate Recovery church",
    "year": null,
    "description": "Edward (Ed) Wonnacott, a Celebrate Recovery church leader in Springdale, AR. Charged with 13 counts of possessing Child Sexual Abuse Material.",
    "position": [
      "party official"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "party official"
    ]
  },
  {
    "id": 1128,
    "name": "Tivo McCrary, Executive Cornerstone",
    "year": null,
    "description": "Tivo McCrary, Executive Pastor at the anti-gay Cornerstone Church, was dismissed for sins against teen members = law enforcement is involved",
    "position": [
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1129,
    "name": "Bob Stine, former pres of MN/WI Bapt",
    "year": null,
    "description": "Bob Stine, former pres of MN/WI Baptist Convention, and pastor has been charged with sexually assaulting a child. This illustrates the value of sex-ed. That’s how she knew it",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1130,
    "name": "Bor",
    "year": 2023,
    "description": "Boris Epshteyn,Trump friend and supporter has been accused of groping two women.",
    "position": [],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "maga"
    ]
  },
  {
    "id": 1131,
    "name": "Dakota Kennermer, a",
    "year": null,
    "description": "Dakota Kennermer, a youth pastor in Twin Falls, Idaho, has been charged with sexual battery for fondling a teenage girl",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child molestation"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1132,
    "name": "Kyle Nelson Robinson, First Bapt",
    "year": null,
    "description": "Kyle Nelson Robinson, a pastor at First Baptist, Indialantic, FL, has been arrested for child molestation",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child molestation"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1133,
    "name": "Bob Young, GOP state rep in Ohio",
    "year": 2023,
    "description": "Bob Young, GOP state rep in Ohio arrested for violating a protective order issued after a domestic violence incident.",
    "position": [
      "party official"
    ],
    "crime": [
      "domestic violence",
      "violence"
    ],
    "tags": [
      "party official",
      "republican"
    ]
  },
  {
    "id": 1134,
    "name": "Joshua Harr",
    "year": null,
    "description": "Joshua Harris, former Wibaux County Deputy in MT, pleaded guilty to raping three children and to two counts of incest over the course of eight years.. He began raping one : X of the girls when she was",
    "position": [],
    "crime": [
      "rape"
    ],
    "tags": []
  },
  {
    "id": 1135,
    "name": "Amanda Buchanan Justice, a",
    "year": null,
    "description": "Amanda Buchanan Justice, a youth pastor, has stepped down as she has been charged with sexually assaulting a child under the age of fifteen. Her husband remains pastor, but also stepped down as youth pastor. NC",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1136,
    "name": "Scott D. Owen, a therap",
    "year": null,
    "description": "Scott D. Owen, a therapist in Utah recommended by a Morman Bishop to counsel LGBTIQA patients, lost his license FINALLY for sexually assaulting patients.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1137,
    "name": "Alexander Kenoyer, former Cripple Creek, CO, police",
    "year": null,
    "description": "Alexander Kenoyer, former Cripple Creek, CO, police detective arrested for continued sexual contact with a sex trafficking victim and coercion.Received probation in plea deal",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "sexual trafficking"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1138,
    "name": "Antonio Capilupi, a",
    "year": null,
    "description": "Antonio Capilupi, a high school teacher in Florida, was arrested for soliciting sex from underage children via computer and possession of Child Sexual Abuse Material.",
    "position": [
      "educator"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1139,
    "name": "Franklin Joseph Perkins, Eagle Scout leader, Martial Arts",
    "year": 2023,
    "description": "Franklin Joseph Perkins, Eagle Scout leader, Martial Arts instructor, and gymnastics coach was arrested for possession of Child Sexual Abuse Material",
    "position": [
      "coach",
      "party official"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "coach",
      "party official"
    ]
  },
  {
    "id": 1140,
    "name": "Justin R. Barron, firefighter,",
    "year": 2023,
    "description": "Justin R. Barron, firefighter, arrested and charged with raping a child",
    "position": [],
    "crime": [
      "rape"
    ],
    "tags": []
  },
  {
    "id": 1141,
    "name": "Fabian Marta, a funder of the Q-adjacent film Sound of",
    "year": null,
    "description": "Fabian Marta, a funder of the Q-adjacent film Sound of Freedom, and local school board advocate for anti-gay candidates and positions. Arrested for child kidnapping",
    "position": [
      "candidate"
    ],
    "crime": [
      "kidnapping"
    ],
    "tags": [
      "candidate"
    ]
  },
  {
    "id": 1142,
    "name": "Timothy Ballard, inspiration for Sound of Freedom and",
    "year": 2023,
    "description": "Timothy Ballard, inspiration for Sound of Freedom and leader of Operation Underground Railroad founded to rescue trafficked children has left the organization due to complaints about unspecified sexual misconduct.",
    "position": [
      "party official"
    ],
    "crime": [],
    "tags": [
      "party official"
    ]
  },
  {
    "id": 1143,
    "name": "Chr",
    "year": null,
    "description": "Chris Marsh, Florence City, SC, school board chair was sentenced to 11 years in prison for criminal sexual conduct with a minor",
    "position": [
      "party official"
    ],
    "crime": [],
    "tags": [
      "party official"
    ]
  },
  {
    "id": 1144,
    "name": "Robert Lazzell, First Bapt",
    "year": 2023,
    "description": "Robert Lazzell, First Baptist Church School Principal and Deacon, sentenced to twelve years for raping a former student since he was in 8th grade and continuing to harass him after he went to college",
    "position": [
      "educator"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1145,
    "name": "Jason Kerby",
    "year": null,
    "description": "Jason Kerby is a Christian musician in Abilene Texas who has been charged with producing Child Sexual Abuse Material using hidden cameras. His FB:",
    "position": [],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1146,
    "name": "Miracle Meadows in W. Virginia, founded by Susan Gayle",
    "year": null,
    "description": "Miracle Meadows in W. Virginia, founded by Susan Gayle Clark, has come to a 100 million settlement for allowing students to be beaten, raped, starved, confined in solitary. Students became pregnant from rape, got STDs. : X",
    "position": [],
    "crime": [
      "rape"
    ],
    "tags": []
  },
  {
    "id": 1147,
    "name": "Joshua Hageman, a",
    "year": null,
    "description": "Joshua Hageman, a police officer in Kansas, was charged with indecency with a child for sex crimes involving two 15- year-old girls. He pled guilty to a lesser charge. For some reason the judge gave him two years probation rather than the 5 the prosecution requested.",
    "position": [
      "judge",
      "law enforcement"
    ],
    "crime": [],
    "tags": [
      "judge",
      "law enforcement"
    ]
  },
  {
    "id": 1148,
    "name": "Allan Kyle Jones Lifeway",
    "year": null,
    "description": "Allan Kyle Jones pastor at the evangelical Lifeway Community Church in Alabama was arrested for possession of Child Sexual Abuse Material",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1149,
    "name": "Aaron Mirtsching, Thrive Church",
    "year": null,
    "description": "Aaron Mirtsching, pastor at Thrive Church in Burke County, NC, and a kindergarten teacher at a charter school, arrested twice of possession of Child Sexual Abuse Material and taking indecent liberties with a child.",
    "position": [
      "educator",
      "religious leader"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "educator",
      "religious leader"
    ]
  },
  {
    "id": 1150,
    "name": "Kenneth Seidens, Republican",
    "year": 2023,
    "description": "Kenneth Seidens, Republican city councilman in Alta Vista, KS, was arrested for child sex crimes",
    "position": [
      "local official",
      "party member"
    ],
    "crime": [
      "child exploitation"
    ],
    "tags": [
      "local official",
      "party member",
      "republican"
    ]
  },
  {
    "id": 1151,
    "name": "Robert Jordan, City Council member in Lou",
    "year": null,
    "description": "Robert Jordan, City Council member in Louisiana, Missouri arrested for sexual misconduct during his employment as a prison guard. Charges include sexual abuse of an offender.",
    "position": [
      "local official"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1152,
    "name": "Steven Bradley Coward, Latta, SC, City",
    "year": 2023,
    "description": "Steven Bradley Coward, Latta, SC, City Councilman - suspended by governor for domestic violence arrest",
    "position": [
      "governor",
      "local official"
    ],
    "crime": [
      "domestic violence",
      "violence"
    ],
    "tags": [
      "governor",
      "local official"
    ]
  },
  {
    "id": 1153,
    "name": "James (Jim) Pierce, city",
    "year": null,
    "description": "James (Jim) Pierce, city council member in Flower Mound, TX, was sentenced to life for continuous sexual abuse of a child plus 70 years for four counts of child indecency. He’s",
    "position": [
      "local official"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1154,
    "name": "Ruby Franke, influential mommy vlogger with at one time",
    "year": null,
    "description": "Ruby Franke, influential mommy vlogger with at one time more than 2 million subscribers, was charged with child abuse and neglect : X",
    "position": [],
    "crime": [
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1155,
    "name": "Jeremy Chesser, OH",
    "year": 2023,
    "description": "Jeremy Chesser, OH firefighter, charged with possessing and distributing Child Sexual Abuse Material and production. Admits sexually abuse of children.",
    "position": [],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1156,
    "name": "Kevin Tomafsky, former aide to Chr",
    "year": null,
    "description": "Kevin Tomafsky, former aide to Chris Christie, was arrested on charges he paid to “perform a sexual act” with a 6-year- girl. The girl’s father was arrested but unnamed to protect her privacy",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1157,
    "name": "Kevin Ruditsky, a Trump-supporting NJ police officer, has",
    "year": null,
    "description": "Kevin Ruditsky, a Trump-supporting NJ police officer, has been charged with stalking a 16-year-old girl.",
    "position": [
      "law enforcement"
    ],
    "crime": [],
    "tags": [
      "law enforcement",
      "maga"
    ]
  },
  {
    "id": 1158,
    "name": "Kelly Garrett Ivey, a",
    "year": 2023,
    "description": "Kelly Garrett Ivey, a youth pastor at Rock Springs Church, is accused of trying to sell a 16-year-old girl online on the dark web.",
    "position": [
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1159,
    "name": "Alan Placa",
    "year": 2023,
    "description": "Alan Placa is a priest, ironically and disgustingly appointed to deal with abuse allegations. But he was an abuser himself, so",
    "position": [
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1160,
    "name": "Tyler Selby, Music Min",
    "year": null,
    "description": "Tyler Selby, Music Ministert at Robinwood Baptist Church in Mississippi, charged with filming himself in a tub with a child committing sexual acts. 11/24, he changes his plea to guilty.",
    "position": [
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1161,
    "name": "Nicholas Garrett Corl, Mountain Avenue",
    "year": null,
    "description": "Nicholas Garrett Corl, youth pastor at Mountain Avenue Baptist in Banning, CA, was arrested for sexual battery/lewd acts with a child after someone who saw something said something.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1162,
    "name": "Derek Cornette has been removed as Davenport, IA,",
    "year": null,
    "description": "Derek Cornette has been removed as Davenport, IA, alderman by a 7-3 vote because of sexual harassment allegations, voice mails, police recordings, coming to work drunk",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1163,
    "name": "Jeff Jones, Monroe",
    "year": null,
    "description": "Jeff Jones, Monroe County WV Sheriff, was arrested",
    "position": [
      "law enforcement"
    ],
    "crime": [],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1164,
    "name": "Denn",
    "year": 2014,
    "description": "Dennis Prager dismisses sexual assaults as invented “to get votes” and overblown, defends marital rape,",
    "position": [],
    "crime": [
      "assault",
      "rape",
      "sexual assault"
    ],
    "tags": []
  },
  {
    "id": 1165,
    "name": "Erick Allen Mosteller, former LDS youth leader and",
    "year": null,
    "description": "Erick Allen Mosteller, former LDS youth leader and supporter of Sound of Freedom/Tim Ballard, was charged with 10 counts of Child Sexual Abuse Material, pleaded guilty to 2 in a deal. 250 days/4 yrs probation. Rape/Sodomy of infants and toddlers.",
    "position": [
      "party official"
    ],
    "crime": [
      "child pornography",
      "rape",
      "sexual abuse",
      "sodomy"
    ],
    "tags": [
      "party official"
    ]
  },
  {
    "id": 1166,
    "name": "Roger VanRaden, youth",
    "year": null,
    "description": "Roger VanRaden, youth pastor of Faith Baptist Church in Champaign, IL raped a child for four years until she was 18 and went to the police. Sentenced to 15 years.",
    "position": [
      "law enforcement",
      "religious leader"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "law enforcement",
      "religious leader"
    ]
  },
  {
    "id": 1167,
    "name": "David Cornelius, a First Bapt",
    "year": 2003,
    "description": "David Cornelius, a First Baptist of Danville high school math, science, and Bible teacher named David Cornelius was charged in 2003 with sexually abusing a young child in his wife's daycare, as well as soliciting sexual favors from a high school student at his new school position with Schlarman High School. He pleaded guilty and was sentenced to 4 years of probation.",
    "position": [
      "educator"
    ],
    "crime": [
      "sexual abuse",
      "prostitution"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1168,
    "name": "John Finley, FOX News VP, NY, fired for sexual harassment",
    "year": null,
    "description": "John Finley, FOX News VP, NY, fired for sexual harassment",
    "position": [],
    "crime": [
      "sexual harassment"
    ],
    "tags": []
  },
  {
    "id": 1169,
    "name": "Austin Perkins, youth min",
    "year": 2022,
    "description": "Austin Perkins, youth minister at Grace Fellowship Baptist Church in Cave Spring, GA. He was arrested in March 2022 with five others who shared Child Sexual Abuse Material. He pleaded guilty in September 2023, three counts of aggravated child molestation, child molestation, possession or control of any material depicting the minor in a sexual context and employing/using the minor to engage in/assist a person in sex.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child molestation",
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1170,
    "name": "State Sen. Tom Wright of Florida",
    "year": 2023,
    "description": "State Sen. Tom Wright of Florida was banned from DV shelter for lewd behavior with survivors has now physically attacked the director",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1171,
    "name": "Joseph C. Roberts, a member of the San Franc",
    "year": 2023,
    "description": "Joseph C. Roberts, a member of the San Francisco Republican Central Committee, made a name for himself when he claimed to have been wrongfully suspended from college due to complaints by three women who accused him of sexual misconduct. He was a vocal speaker against the #MeToo movement. He was arrested for murdering and dismembering his fiancée.",
    "position": [
      "party member"
    ],
    "crime": [],
    "tags": [
      "party member",
      "republican"
    ]
  },
  {
    "id": 1172,
    "name": "Tony Bunton, NC",
    "year": 2023,
    "description": "Tony Bunton, a NC pastor, pled guilty to possessing Child Sexual Abuse Material. He was sentenced to four years.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1173,
    "name": "Andrew Lynn Overheul, Jacksonville, FL, softball coach",
    "year": null,
    "description": "Andrew Lynn Overheul, Jacksonville, FL, softball coach sentenced to 20 years for secretly recording girls on his team.",
    "position": [
      "coach"
    ],
    "crime": [],
    "tags": [
      "coach"
    ]
  },
  {
    "id": 1174,
    "name": "Matthew Dessert, CA",
    "year": null,
    "description": "Matthew Dessert, CA Sheriff’s Deputy, arrested for continuous sexual abuse of a child (9 yo)",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1175,
    "name": "Gregory Norton, a former Bapt",
    "year": 2023,
    "description": "Gregory Norton, a former Baptist church youth group leader who also once worked as a nurse at a Jacksonville children’s hospital. Has been accused of sexual molestation of a teen he met at church functions.",
    "position": [
      "party official"
    ],
    "crime": [
      "child molestation"
    ],
    "tags": [
      "party official"
    ]
  },
  {
    "id": 1176,
    "name": "Martin Burns, pastor",
    "year": null,
    "description": "Martin Burns, pastor of Winamac Nazarene Church, has been charged with battering a child after a video of him leaning on the child’s chest surfaced. Indiana",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1177,
    "name": "Chr",
    "year": null,
    "description": "Christopher M Pruitt, pastor of evangelical Our Father’s House (Nazarene) has been charged with sexually abusing",
    "position": [
      "congress",
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "congress",
      "religious leader"
    ]
  },
  {
    "id": 1178,
    "name": "Kent Daniel Prestwich, an LDS primary school leader",
    "year": 2023,
    "description": "Kent Daniel Prestwich, an LDS primary school leader was arrested for possession of Child Sexual Abuse Material 10 counts /via Beks",
    "position": [
      "party official"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "party official"
    ]
  },
  {
    "id": 1179,
    "name": "Phillip Koons, a Ringling, OK, Hall of Fame football coach",
    "year": null,
    "description": "Phillip Koons, a Ringling, OK, Hall of Fame football coach created a culture of intimidation on his students - Charged with outraging public decency",
    "position": [
      "coach"
    ],
    "crime": [],
    "tags": [
      "coach"
    ]
  },
  {
    "id": 1180,
    "name": "Ronald VanOverloop, former",
    "year": null,
    "description": "Ronald VanOverloop, former pastor of the anti-gay Grace Protestant Reformed Church (MI) was sentenced to 45 days in jail in a plea agreement for assault though sexual battery was the initial charge. He is accused of inappropriately touching several minor girls",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1181,
    "name": "Justin B. Durham, Phelps",
    "year": null,
    "description": "Justin B. Durham, Phelps Co Sheriff’s Deputy, arrested and charged with possession of Child Sexual Abuse Material and raping 2 little girls and recording it. MO Update: Sentenced to 65 years",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "child pornography",
      "rape",
      "sexual abuse"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1182,
    "name": "Matt Inn",
    "year": 2023,
    "description": "Matt Innis, Lancaster GOP Chair, has been accused of sexual assault and stalking by a woman. She had an exclusion order which police refused to enforce, so she got a protection order. PA",
    "position": [
      "law enforcement",
      "party official"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "law enforcement",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1183,
    "name": "Anthony J. Dinch, GOP",
    "year": null,
    "description": "Anthony J. Dinch, who lost GOP primary for mayor & is running unopposed for Borough council in E. Washington PA arraigned on 9 charges, including involuntary deviate sexual intercourse with a person less than 16 years of age, unlawful contact with a minor — sexual offenses, and indecent assault of a person less than 16 years of age.",
    "position": [
      "local official",
      "party official"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "local official",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1184,
    "name": "Michael Queensland, Chief Clerk of WI Senate, who also",
    "year": null,
    "description": "Michael Queensland, Chief Clerk of WI Senate, who also worked for Sen. LeMahieu (R) , has resigned after investigation determines woman’s allegation of sexual misconduct and harassment is credible",
    "position": [
      "clerk"
    ],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "clerk"
    ]
  },
  {
    "id": 1185,
    "name": "Joseph Saggese, Republican",
    "year": null,
    "description": "Joseph Saggese, Republican candidate for an open seat on Matawan, NJ, city council, has been arrested & charged with strangulation, domestic assault, assault",
    "position": [
      "candidate",
      "local official",
      "party member"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "candidate",
      "local official",
      "party member",
      "republican"
    ]
  },
  {
    "id": 1186,
    "name": "Michael Tobin, former",
    "year": null,
    "description": "Michael Tobin, former police officer in Clarksville, IA, convicted on 11 charges of sexual exploitation of a minor",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "child exploitation"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1187,
    "name": "Robert Stahn, a counselor for survivors of child sexual",
    "year": 2023,
    "description": "Robert Stahn, a counselor for survivors of child sexual trauma, himself victimized a vulnerable adult who was nonverbal.",
    "position": [],
    "crime": [
      "child exploitation"
    ],
    "tags": []
  },
  {
    "id": 1188,
    "name": "Tammy Tyner, former",
    "year": null,
    "description": "Tammy Tyner, former Tammy Tyner Moran, was 2 years probation for raping two exchange students in her home.",
    "position": [],
    "crime": [
      "rape"
    ],
    "tags": []
  },
  {
    "id": 1189,
    "name": "Matthew Thomas Wyatt, guest preacher at Southside",
    "year": null,
    "description": "Matthew Thomas Wyatt, guest preacher at Southside Baptist Church. Charged with child sex crimes.",
    "position": [],
    "crime": [
      "child exploitation"
    ],
    "tags": []
  },
  {
    "id": 1190,
    "name": "Mike Bickle of the International House of Prayer, said",
    "year": null,
    "description": "Mike Bickle of the International House of Prayer, said opposing Trump is “a demonic attack coming against the Word of God.” He’s been accused of sexual misconduct,",
    "position": [
      "congress"
    ],
    "crime": [],
    "tags": [
      "congress",
      "maga"
    ]
  },
  {
    "id": 1191,
    "name": "Newton Crenshaw",
    "year": null,
    "description": "Newton Crenshaw is the President/CEO of Young Life Ministries which, under his leadership, is accused of covering up or ignoring sexual abuse allegations.",
    "position": [
      "party official"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "party official"
    ]
  },
  {
    "id": 1192,
    "name": "Robert W Austin of Sanderson, FL,",
    "year": null,
    "description": "Robert W Austin of Sanderson, FL, was a Dept of Corrections Chaplain, arrested for sending explicit messages to a police officer he believe to be a 14-year-old girl",
    "position": [
      "law enforcement"
    ],
    "crime": [],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1193,
    "name": "Corey White, youth",
    "year": 2024,
    "description": "Corey White, youth pastor at the anti-gay, hate church Redeemer Midland, has been arrested for possession of Child Sexual Abuse Material. Pleaded guilty January 2024",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1194,
    "name": "Adolphus “Dick” Pelley, has sat on the Athens City Council",
    "year": 2002,
    "description": "Adolphus “Dick” Pelley, has sat on the Athens City Council since 2002. He’s also a member of the Republican National Committee. He lost his professional counselors license after a woman complained he made sexual comments and ranted at the woman for not attending church",
    "position": [
      "local official",
      "party member"
    ],
    "crime": [],
    "tags": [
      "local official",
      "party member",
      "republican"
    ]
  },
  {
    "id": 1195,
    "name": "John Justin McCall, Grace River",
    "year": 2023,
    "description": "John Justin McCall, pastor/worship leader at Grace River Community Church in Decatur, AL. Soliciting a minor, Child Sexual Abuse Material, failing to register as a sex offender",
    "position": [
      "party official",
      "religious leader"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "party official",
      "religious leader"
    ]
  },
  {
    "id": 1196,
    "name": "Ashley Crouse, New V",
    "year": null,
    "description": "Ashley Crouse, pastor at New Vision Baptist Fellowship Church, in Granite Falls, NC, arrested for possession of child sex abuse material. Bail is $1 milion : X",
    "position": [
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1197,
    "name": "David Scott, the head of Exxon’s shale oil and gas",
    "year": 2024,
    "description": "David Scott, the head of Exxon’s shale oil and gas business has been arrested and charged with sexual assault in Houston, TX. Charges were dropped in February",
    "position": [],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": []
  },
  {
    "id": 1198,
    "name": "Tom Garrett, VA GOP",
    "year": null,
    "description": "Tom Garrett, VA GOP Congressman - domestic violence",
    "position": [
      "congress",
      "party official"
    ],
    "crime": [
      "domestic violence",
      "violence"
    ],
    "tags": [
      "congress",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1199,
    "name": "Thomas Garrett, a Milwaukie, OR, police officer has been",
    "year": 2010,
    "description": "Thomas Garrett, a Milwaukie, OR, police officer has been charged with domestic violence, assaulting the mother of his 1 year-old in front of her children",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "assault",
      "domestic violence",
      "violence"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1200,
    "name": "Del. Matt Far",
    "year": 2012,
    "description": "Republican Del. Matt Fariss, a member of the VA House since 2012,is charged with hit-and-run and accused of swerving to strike a woman he had been dating with his vehicle. She was injured.",
    "position": [
      "congress",
      "party member"
    ],
    "crime": [],
    "tags": [
      "congress",
      "party member",
      "republican"
    ]
  },
  {
    "id": 1201,
    "name": "Brad Benson, GOP Granbury, TX, City Council",
    "year": null,
    "description": "Brad Benson, GOP Granbury, TX, City Council candidate arrested on 2 counts of possession of Child Sexual Abuse Material and two counts of felony first-degree child pornography possession after his home was searched. He was arrested the day before the election.",
    "position": [
      "candidate",
      "local official",
      "party official"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "candidate",
      "local official",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1202,
    "name": "Ted Suhl, a health services corrupt executive",
    "year": 2023,
    "description": "Ted Suhl, a health services corrupt executive pardoned by Trump, has been sued by former residents of his “Lord’s Ranch” who claim he covered up child rape and abuse, even threatening reprisals for reporting abuse. Trigger Warning:",
    "position": [],
    "crime": [
      "rape",
      "sexual abuse"
    ],
    "tags": [
      "maga"
    ]
  },
  {
    "id": 1203,
    "name": "Paul Schofield and h",
    "year": null,
    "description": "Paul Schofield and his wife recorded themselves raping her 4 year-old child. Pled Guilty. : X",
    "position": [],
    "crime": [
      "rape"
    ],
    "tags": []
  },
  {
    "id": 1204,
    "name": "Wade Lee Schvaneveldt, Soda Springs, ID, teacher",
    "year": 2023,
    "description": "Wade Lee Schvaneveldt, Soda Springs, ID, teacher and coach was sentenced to 8 to 18 years in Jun 2023 for raping on of his players",
    "position": [
      "coach",
      "educator"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "coach",
      "educator"
    ]
  },
  {
    "id": 1205,
    "name": "Kyle Hilleary, pastor",
    "year": null,
    "description": "Kyle Hilleary, pastor at anti-gay church and educator at Christian school in Mississippi, was charged with child exploitation",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child exploitation"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1206,
    "name": "David Prince, OK Corrections officer and Associate",
    "year": null,
    "description": "David Prince, OK Corrections officer and Associate Pastor and Candace Owens fan, arrested for possession of Child Sexual Abuse Material",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1207,
    "name": "Alyson Cranick",
    "year": null,
    "description": "Alyson Cranick accused of repeatedly raping an 11- year-old boy, her student. : X",
    "position": [],
    "crime": [
      "rape"
    ],
    "tags": []
  },
  {
    "id": 1208,
    "name": "Daniel J Abraham, a Chr",
    "year": null,
    "description": "Daniel J Abraham, a Christian school teacher in NC, is charged with sexual battery, indecent liberties with a child.",
    "position": [
      "educator"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1209,
    "name": "Phillip F",
    "year": null,
    "description": "Phillip Fisher Jr, a pastor, Republican ward leader, and a Philadephia Moms for Liberty coordinator pleaded guilty to aggravated sexual abuse of a 14-year-old boy",
    "position": [
      "party member",
      "party official",
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "party member",
      "party official",
      "religious leader",
      "republican"
    ]
  },
  {
    "id": 1210,
    "name": "Jeffrey Thomas Singleton, a",
    "year": null,
    "description": "Jeffrey Thomas Singleton, a code enforcement officer, arrested for possession of Child Sexual Abuse Material that included infants (and animals). Materials on his phone showed him raping his dogs. Florida",
    "position": [],
    "crime": [
      "child pornography",
      "rape",
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1211,
    "name": "Joseph Ortega, Las",
    "year": null,
    "description": "Joseph Ortega, Las Vegas police officer, arrested for child abuse and domestic violence with a deadly weapon : X",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "domestic violence",
      "sexual abuse",
      "violence"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1212,
    "name": "Justin Sigmon, Franklin",
    "year": 2023,
    "description": "Justin Sigmon, Franklin County Sheriff, was convicted of sexually abusing his niece.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1213,
    "name": "Reagan Anderson",
    "year": null,
    "description": "Reagan Anderson was a teacher at a private christian school. She’s been charged with sexual battery of one of her students and sendng him nude photos of herself.",
    "position": [
      "educator"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1214,
    "name": "Trammell Crow, brother to Harlan Crow, and big GOP",
    "year": null,
    "description": "Trammell Crow, brother to Harlan Crow, and big GOP donor in his own right, has been sued, claiming he financed and participated in a sex trafficking ring",
    "position": [
      "party official"
    ],
    "crime": [
      "sexual trafficking"
    ],
    "tags": [
      "party official",
      "republican"
    ]
  },
  {
    "id": 1215,
    "name": "Patrick Walsh, one of the funders who bankrolled Trump's",
    "year": null,
    "description": "Patrick Walsh, one of the funders who bankrolled Trump's Truth Social has been sued for sexual harassment including sexual battery by two women. NY",
    "position": [],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "maga"
    ]
  },
  {
    "id": 1216,
    "name": "Ryan Fournier, a co-founder of Students for Trump who",
    "year": 2023,
    "description": "Ryan Fournier, a co-founder of Students for Trump who now leads Radical Alert, has been charged with misdemeanor assault for grabbing his girlfriend and striking her on the forehead with his handgun, what used to be called pistol whipping.",
    "position": [],
    "crime": [
      "assault"
    ],
    "tags": [
      "maga"
    ]
  },
  {
    "id": 1217,
    "name": "Chr",
    "year": 2024,
    "description": "Christian Ziegler, Florida Republican Party Chair and close friend and confidante of Ron DeSantis, has been accused of rape. His wife is co-founder of the book-banning Moms for Liberty. The accuser told police she had been a third in consensual sexual encounters with the Zieglers.The police did not charge him with rape and instead forwarded charges of video voyeurism to prosecutors",
    "position": [
      "law enforcement",
      "party member",
      "party official"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "law enforcement",
      "party member",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1218,
    "name": "David J. Turley",
    "year": 2015,
    "description": "David J. Turley was the mayor of Woodland Park when he was charged with sexual assault of a child by a person in a position of trust. He pleaded guilty and avoided jail time through four years of intensive probations. (2015, Colorado) : X",
    "position": [
      "local official"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1219,
    "name": "Jeffrey Brienza, former NYPD captain, has been",
    "year": 2023,
    "description": "Jeffrey Brienza, former NYPD captain, has been accused of rape by a retired police officer. He was also alleged to stalk a four-year-old girl.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1220,
    "name": "Justin Wells, Tucker",
    "year": 2008,
    "description": "Justin Wells, Tucker Carlson’s producer at Fox News, is accused of sexual assault by another FOX news producer. NY",
    "position": [],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": []
  },
  {
    "id": 1221,
    "name": "William Oswald, SC Bapt",
    "year": null,
    "description": "William Oswald, SC Baptist pastor & former state senate candidate, sentenced to 40 years for raping 2 young girl. One was younger than 11. Rush Limbaugh fan (see Beks)",
    "position": [
      "candidate",
      "religious leader"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "candidate",
      "religious leader"
    ]
  },
  {
    "id": 1223,
    "name": "Johnathan Andrew Edwards, Sheriff’s",
    "year": null,
    "description": "Johnathan Andrew Edwards, a Sheriff’s deputy in Harnett County, NC, was charged with 10 counts of 1st degree sexual exploitation of several minors and obstruction of justice. : X",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "child exploitation"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1224,
    "name": "John Sweeney, NY",
    "year": 2020,
    "description": "John Sweeney, former NY congressman, was accused of domestic violence after a 911 call brought police to his home. His wife claimed she was forced to issue denial. He was active in 2020 election denial efforts.",
    "position": [
      "congress",
      "law enforcement"
    ],
    "crime": [
      "domestic violence",
      "violence"
    ],
    "tags": [
      "congress",
      "law enforcement"
    ]
  },
  {
    "id": 1225,
    "name": "Jose Saez Jr, Brentwood, NY, Iglesia Cr",
    "year": 2023,
    "description": "Jose Saez Jr, a Brentwood, NY, pastor at Iglesia Cristiana Alumbrando el Camino, has been charged with the production and possession of Child Sexual Abuse Material. He claimed to find his victims at his church.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1226,
    "name": "Brock Fredin, a W",
    "year": null,
    "description": "Brock Fredin, a Wisconsin right-wing twitter user/influencer frequently amplified by Donald Trump, has a history of stalking and harassing women.",
    "position": [],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "maga"
    ]
  },
  {
    "id": 1227,
    "name": "William Gleason, a Republican who held several positions",
    "year": null,
    "description": "William Gleason, a Republican who held several positions in the Toms River borough including heading the Recreation Committee, has been arrested and held without bail for",
    "position": [
      "party member"
    ],
    "crime": [],
    "tags": [
      "party member",
      "republican"
    ]
  },
  {
    "id": 1228,
    "name": "Albert Benjamin Wharton, a",
    "year": null,
    "description": "Albert Benjamin Wharton, a pastor at a conservative Baptist church, has been charged with 30 felony counts of child sexual abuse.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1229,
    "name": "Cameron Cotrill, a media min",
    "year": null,
    "description": "Cameron Cotrill, a media minister at Center Pointe church in Ocean Springs, MS pleaded guilty to possession of Child Sexual Abuse Material.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1230,
    "name": "Chr",
    "year": 2023,
    "description": "Christopher Terranova, 34 year-old NYPD officer, accused of sexual abuse via coercion of three children Update: Sentenced to 40 years",
    "position": [],
    "crime": [
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1231,
    "name": "Clarice Schillinger, Republican",
    "year": 2023,
    "description": "Clarice Schillinger, Republican candidate for PA LT. Gov and a conservative “parental rights” activist was arrested for assault after punching a minor at a party where she provided alcohols to minors - what we call contributing to the delinquency in liberal circles.",
    "position": [
      "activist",
      "candidate",
      "party member"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "activist",
      "candidate",
      "party member",
      "republican"
    ]
  },
  {
    "id": 1232,
    "name": "Thomas Wall, a",
    "year": null,
    "description": "Thomas Wall, a former pastor at the conservative Pentecostal Fellowship Church and a Christian school administrator pled guilty in a deal that dismissed all but one charge against him and whose sentence is agreed to be one year/time served. He was accused of raping several girls under the age of 16.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1233,
    "name": "Calvin Weber, a dent",
    "year": 2023,
    "description": "Calvin Weber, a dentist in Glenwood, IA, was convicted of assaulting a patient. She claimed he called her sexy and touched her without her permission.",
    "position": [],
    "crime": [
      "assault"
    ],
    "tags": []
  },
  {
    "id": 1234,
    "name": "Eric Spofford, former CEO of Granite State Recover and",
    "year": 2023,
    "description": "Eric Spofford, former CEO of Granite State Recover and Republican party donor, has been accused by several women of sexual harassment.",
    "position": [
      "party member"
    ],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "party member",
      "republican"
    ]
  },
  {
    "id": 1235,
    "name": "Andrew N Lackey, Seward County Community College",
    "year": 2023,
    "description": "Andrew N Lackey, Seward County Community College teacher charged with sexually assaulting a child.",
    "position": [
      "educator"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1236,
    "name": "Patrick Stephen Miller, a former Immanuel Bapt",
    "year": 2022,
    "description": "Patrick Stephen Miller, a former Immanuel Baptist Church youth minister, was originally charged with second-degree sexual assault, pleaded guilty instead to misdemeanor harassment in January 2022. Now he wants his record expunged despite a new allegation.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault",
      "sexual assault",
      "sexual harassment"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1237,
    "name": "Immanuel Bapt",
    "year": 2023,
    "description": "Immanuel Baptist Church’s pastor Steven Smith never reported the allegations against 1238 to the congregation although the church did inform the police, and in his plea deal he was not required to register as a sex offender, he was able to get a job at another church.",
    "position": [
      "law enforcement",
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "law enforcement",
      "religious leader"
    ]
  },
  {
    "id": 1238,
    "name": "Mark Rivera, Chr",
    "year": 2023,
    "description": "Mark Rivera, lay pastor at Christ Our Light Anglican IL (anti-gay splinter church) was convicted of child sexual abuse and pled guilty to an additional charge in 2023. Accused of molesting several more children.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child molestation",
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1239,
    "name": "Jake Freeman, a",
    "year": null,
    "description": "Jake Freeman, a police officer in Las Vegas, was arrested for aggravated stalking, attempted home invasion, & destruction of property, all against his ex-wife. He died by suicide after his arrest.",
    "position": [
      "law enforcement"
    ],
    "crime": [],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1240,
    "name": "Dillon Herrington, the Alabama sedition",
    "year": null,
    "description": "Dillon Herrington, the Alabama seditionist known as MAGA Lumberjack, has been charged with rape.",
    "position": [],
    "crime": [
      "rape"
    ],
    "tags": [
      "republican"
    ]
  },
  {
    "id": 1241,
    "name": "Richard Shaw, a",
    "year": 2024,
    "description": "Richard Shaw, a pastor from Riverton, WY, was arrested and will be extradited to Florida for molesting a child who was younger than twelve. He admitted doing it and claimed an addiction to pornography.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child molestation"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1242,
    "name": "State House Republican Leader Matt Hall - domestic",
    "year": null,
    "description": "State House Republican Leader Matt Hall - domestic violence Michigan",
    "position": [
      "congress",
      "party member",
      "party official"
    ],
    "crime": [
      "domestic violence",
      "violence"
    ],
    "tags": [
      "congress",
      "party member",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1243,
    "name": "NH State Sen. Andy Sanborn",
    "year": 2018,
    "description": "NH State Sen. Andy Sanborn was accused of paying off an intern or getting him a legislative job to keep quiet about sexual harassment. There are additional allegations as well.",
    "position": [],
    "crime": [
      "sexual harassment"
    ],
    "tags": []
  },
  {
    "id": 1244,
    "name": "Rand York tried to protect and cover up rape of nine-year-",
    "year": null,
    "description": "Rand York tried to protect and cover up rape of nine-year- old child by a pastor he supervised. Told the child’s mother not to report to police.",
    "position": [
      "law enforcement",
      "religious leader"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "law enforcement",
      "religious leader"
    ]
  },
  {
    "id": 1245,
    "name": "Nathaniel Jon Pineda, a teacher at Dream City Chr",
    "year": null,
    "description": "Nathaniel Jon Pineda, a teacher at Dream City Christian School in Glendale, AZ, has been charged with luring a minor, four counts of sexual conduct with a minor and four counts of sexual abuse. Caught when parents found texts on 15yo daughter’s phone",
    "position": [
      "educator"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1246,
    "name": "Cole Carter, Alabama",
    "year": 2024,
    "description": "Cole Carter, Alabama fireman, pleaded guilty to sexually abusing two children and creating Child Sexual Abuse Material. ht/Beks : X",
    "position": [],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1247,
    "name": "Cortney T. Andrew, a Utah church leader",
    "year": 2024,
    "description": "Cortney T. Andrew, a Utah church leader pleaded guilty to grooming, enticement of a minor ht/Beks",
    "position": [
      "party official"
    ],
    "crime": [],
    "tags": [
      "party official"
    ]
  },
  {
    "id": 1248,
    "name": "Gary Joseph Hawkins, a Utah firefighter, has been",
    "year": null,
    "description": "Gary Joseph Hawkins, a Utah firefighter, has been charged with child sexual exploitation. : X",
    "position": [],
    "crime": [
      "child exploitation"
    ],
    "tags": []
  },
  {
    "id": 1249,
    "name": "Micah Whitfield, the",
    "year": null,
    "description": "Micah Whitfield, the technical director of the Arend Arts Center and an employee of Bentonville, Arkansas, Schools was charged with sexual assault of a Bentonville high school student. Pic/Beks",
    "position": [],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": []
  },
  {
    "id": 1250,
    "name": "Shawn Gooden, an LDS church leader, lobby",
    "year": null,
    "description": "Shawn Gooden, an LDS church leader, lobbyist, and lawyer was convicted in VA of assaulting a child and has been charged with rape and sexual abuse of a child in PA.",
    "position": [
      "lobbyist",
      "party official"
    ],
    "crime": [
      "assault",
      "rape",
      "sexual abuse"
    ],
    "tags": [
      "lobbyist",
      "party official"
    ]
  },
  {
    "id": 1251,
    "name": "Rhett Hintze, a lobby",
    "year": null,
    "description": "Rhett Hintze, a lobbyist and “stake president” of seven area LDS churches, is charged of failing to report. He is alleged to have known of Shawn Gooden’s actions for 2 years and not reporting it.",
    "position": [
      "lobbyist"
    ],
    "crime": [],
    "tags": [
      "lobbyist"
    ]
  },
  {
    "id": 1252,
    "name": "Brad Nash, former",
    "year": 2023,
    "description": "Brad Nash, former Mayor of Salem, MO, Dent County Fire Chief, Emergency Manager, charged with two counts of first- degree statutory sodomy and one count of second-degree child molestation",
    "position": [
      "local official"
    ],
    "crime": [
      "child molestation",
      "sodomy"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1253,
    "name": "Paul Humphrey, Indianapol",
    "year": null,
    "description": "Paul Humphrey, Indianapolis police officer who follows rightwing FB account, was charged with child seduction, sexual misconduct with a minor.",
    "position": [
      "law enforcement"
    ],
    "crime": [],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1254,
    "name": "Lillie Bowman, Norr",
    "year": null,
    "description": "Lillie Bowman, Norris, OK, high school teacher pled no contest to third-degree sexual abuse by a school employee in a plea deal. She sexually abused a student. : X",
    "position": [
      "educator"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1255,
    "name": "Donald H. Briggs, former",
    "year": 2016,
    "description": "Donald H. Briggs, former mayor of Millbrook, NY was arrested in 2016, charged with two counts of third-degree criminal sexual act. The victim was under 17. His name is on lists posted by MAGAs who list him as a Dem (Not every person in NY is a Dem, guys)",
    "position": [
      "local official"
    ],
    "crime": [],
    "tags": [
      "local official",
      "republican"
    ]
  },
  {
    "id": 1256,
    "name": "Corey Botelho, PA",
    "year": null,
    "description": "Corey Botelho, a PA sheriff’s deputy, soccer coach, and gun/tactical businessman who was also an anti-mask/anti- vaxxer, and anti-government 2nd amendment fanatic, charged with 79 sex crimes against children, raping a girl since she was 8 until she was",
    "position": [
      "coach",
      "law enforcement"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "coach",
      "law enforcement"
    ]
  },
  {
    "id": 1257,
    "name": "Jamol Jones",
    "year": 2018,
    "description": "Jamol Jones is a former police officer and was recently appointed to the Arkansas Board of Corrections by Sarah Huckabee Sanders. However, he was fired as a police officer for “a sexual relationship with a minor.” Why no prosecution for statutory rape?",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1258,
    "name": "Kenneth M. Richens, head of Utah children’s charity",
    "year": null,
    "description": "Kenneth M. Richens, head of Utah children’s charity is accused of participating in sex tourism. Pleaded guilty to two counts of child sexual exploitation in an agreement that dropped eight charges. He had CSAM on his phone after returning from trip to Phillipines.",
    "position": [],
    "crime": [
      "child exploitation",
      "child pornography"
    ],
    "tags": []
  },
  {
    "id": 1259,
    "name": "Dale Kenyon, former",
    "year": null,
    "description": "Dale Kenyon, former mayor of Clayton, New York, pleaded guilty in a plea deal. He pleaded to a third-degree criminal sex act, dispensing with a 22-count indictment of third- degree sex acts with a 14-year-old By the way, this guy shows up on the lists MAGAs post, claiming he is a Dem. : X",
    "position": [
      "local official"
    ],
    "crime": [],
    "tags": [
      "local official",
      "republican"
    ]
  },
  {
    "id": 1260,
    "name": "Sedition",
    "year": null,
    "description": "Seditionist Kyle Colton, CA, has been indicted for receiving Child Sexual Abuse Material",
    "position": [],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1261,
    "name": "David Helbling, CA, Assemblies",
    "year": null,
    "description": "David Helbling, CA, Assemblies of God pastor has been charged with kidnapping to commit rape and sexual abuse of child under 14 and of child under 10.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "kidnapping",
      "rape",
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1262,
    "name": "Lynn Lindaman, a",
    "year": 2024,
    "description": "Lynn Lindaman, a pediatric orthopedic surgeon in Ankeny, Iowa has been found guilty of sexually assaulting a child. He will receive an enhanced sentence thanks to a deferred sentence for a related offense 25 years ago. How did he get licensed?",
    "position": [],
    "crime": [
      "assault"
    ],
    "tags": []
  },
  {
    "id": 1263,
    "name": "Bobby Leonard",
    "year": 2024,
    "description": "Pastor Bobby Leonard of Bible Baptist Tabernacle in Monroe, NC, preached that he would acquit a man who raped a woman if the woman was wearing shorts.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1264,
    "name": "Trevor Goodson, Tennessee",
    "year": null,
    "description": "Trevor Goodson, Tennessee teacher and basketball coach, arrested and charged with sexual abuse of a child",
    "position": [
      "coach",
      "educator"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "coach",
      "educator"
    ]
  },
  {
    "id": 1265,
    "name": "David Wakefield, principal",
    "year": 2024,
    "description": "David Wakefield, principal and athletic director at Damascus Christian School, has been charged with sexually : X abusing a 14-year-old child for four years.",
    "position": [
      "educator"
    ],
    "crime": [],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1266,
    "name": "Rachel Wakefield, substitute teacher and coach at",
    "year": null,
    "description": "Rachel Wakefield, substitute teacher and coach at Damascus Christian School has been charged with sexually abusing a 14-year-old girl for four years.",
    "position": [
      "coach",
      "educator"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "coach",
      "educator"
    ]
  },
  {
    "id": 1267,
    "name": "David Templett, a",
    "year": null,
    "description": "David Templett, a police officer in Latta, SC, is charged with sex crimes involving an 11-year-old child",
    "position": [
      "law enforcement"
    ],
    "crime": [],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1268,
    "name": "Daniel Edward Duffey, a GOP political strateg",
    "year": 2024,
    "description": "Daniel Edward Duffey, a GOP political strategist and former political director for MT Governor Gianforte, has pleaded not guilty to stalking charges. He is charged with stalking and harassing a man whom he accuses of sexual assault, posting flyers, making accusations on man’s wedding site, etc.",
    "position": [
      "governor",
      "party official"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "governor",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1269,
    "name": "Dustin Ledford, an elementary school counselor in",
    "year": 2024,
    "description": "Dustin Ledford, an elementary school counselor in Cleveland County, NC, was arrested for felony child abuse, sexual act, and indecent liberties with a child.",
    "position": [],
    "crime": [
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1271,
    "name": "Kyle Hayden Lewter, Alabama",
    "year": null,
    "description": "Kyle Hayden Lewter, Alabama Young Republicans leader, arrested for sexual torture and murder",
    "position": [
      "party member",
      "party official"
    ],
    "crime": [],
    "tags": [
      "party member",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1272,
    "name": "Floyd Godfrey, a gay conversion therap",
    "year": 2023,
    "description": "Floyd Godfrey, a gay conversion therapist, surrendered his license after sexual misconduct allegations were brought by two employees",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1273,
    "name": "John Goodrich, former b",
    "year": 2024,
    "description": "John Goodrich, former bishop in the Morman church, has been indicted for sexually assaulting his daughter. Charges include rape, sodomy and two counts of aggravated sexual battery by a parent. : X",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault",
      "rape",
      "sodomy"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1274,
    "name": "Church of Jesus Chr",
    "year": null,
    "description": "Church of Jesus Christ of Latter Day Saints - organizational coverup",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1275,
    "name": "Paul Rytting, Director",
    "year": null,
    "description": "Paul Rytting, Director of Risk Management Division of LDS Church, for covering up and preventing prosecution of sexual abusers of children",
    "position": [],
    "crime": [
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1276,
    "name": "Chr",
    "year": null,
    "description": "Christopher J. Ballard, a Colorado religious academy teacher was charged with sexual assault of a child, accused of making students create Child Sexual Abuse Material",
    "position": [
      "educator"
    ],
    "crime": [
      "assault",
      "child pornography",
      "sexual abuse",
      "sexual assault"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1277,
    "name": "Dan Rodimer, GOP House",
    "year": 2024,
    "description": "Dan Rodimer, a GOP House candidate, has been charged with murder after killing someone in a brawl. He’s been involved in at least three other brawls in the past.",
    "position": [
      "candidate",
      "congress",
      "party official"
    ],
    "crime": [],
    "tags": [
      "candidate",
      "congress",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1278,
    "name": "Denn",
    "year": 2024,
    "description": "Dennis Coggins, the Mayor of Hoxie, Arkansas, has been sued for sexual harassment - pressuring her for sex as she tried to rent a house from him. He forced an embrace on her repeatedly and constantly asked for sex in return for rent and utility discounts that she refused.",
    "position": [
      "congress",
      "local official"
    ],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "congress",
      "local official"
    ]
  },
  {
    "id": 1279,
    "name": "Les Stapleton, Mayor",
    "year": null,
    "description": "Les Stapleton, Mayor of Prestonburg, KY, resigned shortly after being sued for sexual harassment and sexual assault of a city employee - but he said did not resign because of it.",
    "position": [
      "local official"
    ],
    "crime": [
      "assault",
      "sexual assault",
      "sexual harassment"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1280,
    "name": "William Keith Dodd, a",
    "year": null,
    "description": "William Keith Dodd, a pastor in Kansas, pled no contest to raping a child under the age of fourteen.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1281,
    "name": "Marvin Leroy Mosley, a",
    "year": null,
    "description": "Marvin Leroy Mosley, a now-former pastor of the extreme- right God’s Missionary Church in Lehighton, PA, has been : X sentenced to 6 to 23 months for raping three children under",
    "position": [
      "religious leader"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1282,
    "name": "Jeffrey Duncan, Nebraska Lutherans",
    "year": null,
    "description": "Jeffrey Duncan, a Nebraska pastor and one time Lutherans for Life staffer, was sentenced to 4.5 years for sexually abusing a child.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1283,
    "name": "Jon Stone, GOP NH",
    "year": 2024,
    "description": "Jon Stone, GOP NH state representative, responded to an investigation into him for an inappropriate relationship with a minor (started at 15) by threatening to rape the police chief’s wife and kill his fellow officers in a shooting spree.",
    "position": [
      "law enforcement",
      "party official",
      "state legislator"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "law enforcement",
      "party official",
      "republican",
      "state legislator"
    ]
  },
  {
    "id": 1284,
    "name": "Monte LaVelle Chitty, a FL Bapt",
    "year": null,
    "description": "Monte LaVelle Chitty, a FL Baptist pastor and former cop, is accused of raping a 15yo after he gave her alcohol and she passed out.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1285,
    "name": "Justin Hicks, MO state rep who",
    "year": null,
    "description": "Justin Hicks, MO state rep who is running for Congress, was subject to a restraining order after threatening to kill a woman while choking her. The information was brought out by one of his competitors in the primary for a Congressional race",
    "position": [
      "congress"
    ],
    "crime": [],
    "tags": [
      "congress"
    ]
  },
  {
    "id": 1286,
    "name": "Spencer Greendyke, ID",
    "year": 2024,
    "description": "Spencer Greendyke, ID orthopedic surgeon, is charged with 2 counts of producing Child Sexual Abuse Material and 6 counts of video voyeurism for putting hidden camera in bathroom at his practice.",
    "position": [],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1287,
    "name": "Charles O. Lake, Lake Alfred (FL) City Comm",
    "year": 2024,
    "description": "Charles O. Lake, Lake Alfred (FL) City Commissioner & former mayor, charged with possession of more than 300 Child Sexual Abuse Materials - children from 2 to 12",
    "position": [
      "local official"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1288,
    "name": "Tifany Adams, Chair of Cimarron County Republican Party",
    "year": null,
    "description": "Tifany Adams, Chair of Cimarron County Republican Party in Oklahoma was charged with kidnapping and murdering two women, one was the mother of her grandchildren.",
    "position": [
      "party member",
      "party official"
    ],
    "crime": [
      "kidnapping"
    ],
    "tags": [
      "party member",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1289,
    "name": "Jesse Law, Clark",
    "year": null,
    "description": "Jesse Law, Clark County (NV) GOP County Chair, was arrested on suspicion of domestic battery. The DA declined to prosecute. He was charged with stalking when a tracking : X device was found on ex-fiancee's car. He reached a deal without charges dropping to disorderly conduct if he can behave for six months.",
    "position": [
      "party official"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "party official",
      "republican"
    ]
  },
  {
    "id": 1290,
    "name": "Brian Ormes, Kentucky",
    "year": null,
    "description": "Brian Ormes, a Kentucky primary candidate for state house, was arrested for strangulation of a minor after his kid was almost struck by a ball at Walmart.",
    "position": [
      "candidate",
      "congress"
    ],
    "crime": [],
    "tags": [
      "candidate",
      "congress"
    ]
  },
  {
    "id": 1291,
    "name": "Solomon Peña, NM",
    "year": 2025,
    "description": "Solomon Peña, failed NM state house candidate, has been arrested in murder for hire effort to get rid of witnesses to his upcoming trial for hiring people to shoot at Democratic Party candidate homes. He was convicted in March 2025",
    "position": [
      "candidate",
      "congress"
    ],
    "crime": [],
    "tags": [
      "candidate",
      "congress"
    ]
  },
  {
    "id": 1292,
    "name": "Robert Lookingbill, Thurmond MD Town Comm",
    "year": 2024,
    "description": "Robert Lookingbill, Thurmond MD Town Commissioner, was arrested for sexual abusing a child",
    "position": [
      "local official"
    ],
    "crime": [],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1293,
    "name": "Zack Scrivner, Kern County Superv",
    "year": null,
    "description": "Zack Scrivner, Kern County Supervisor (CA) and Kevin McCarthy protege, is being investigated for sexual assault of his daughter after one of his other children stabbed him in the chest to defend her.",
    "position": [],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": []
  },
  {
    "id": 1294,
    "name": "NH State Rep. Jess Edwards fought to retain child",
    "year": 2024,
    "description": "NH State Rep. Jess Edwards fought to retain child marriage, thinking if they were of “ripe and fertile age” they should be able to be married.",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1295,
    "name": "David Love, Kentucky retired police officer and member of",
    "year": null,
    "description": "David Love, Kentucky retired police officer and member of Patriots Guard Riders was arrested, charged with raping 13- year-old",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1296,
    "name": "Bill Halle, Butler school board member and founder of the",
    "year": null,
    "description": "Bill Halle, Butler school board member and founder of the Patriot Party, a PA GOP extremist offshoot, charged with grooming, sexual assault, corruption of minor",
    "position": [
      "party official"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "party official",
      "republican"
    ]
  },
  {
    "id": 1297,
    "name": "Seth Waxman, Mason, MI VP of Planning Comm",
    "year": 2024,
    "description": "Seth Waxman, Mason, MI VP of Planning Commission, arrested for soliciting a minor. : X",
    "position": [],
    "crime": [
      "prostitution"
    ],
    "tags": []
  },
  {
    "id": 1298,
    "name": "Victor Franklin, Wysox Township Superv",
    "year": null,
    "description": "Victor Franklin, Wysox Township Supervisor, (Pennsylvania) charged with possession of Child Sexual Abuse Material",
    "position": [],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1299,
    "name": "Jerry Dan Heflin, a Deacon at Unity Bapt",
    "year": null,
    "description": "Jerry Dan Heflin, a Deacon at Unity Baptist Church - a far- right conservative church, in Sylvester, Georgia, was charged with 66 felony counts, including child molestation, aggravated sodomy and incest. : X",
    "position": [],
    "crime": [
      "child molestation",
      "sodomy"
    ],
    "tags": []
  },
  {
    "id": 1300,
    "name": "Retired Air Force General Mike McClendon (TX) has been",
    "year": null,
    "description": "Retired Air Force General Mike McClendon (TX) has been charged with the continuous rape of a child under 14.",
    "position": [],
    "crime": [
      "rape"
    ],
    "tags": []
  },
  {
    "id": 1301,
    "name": "Chr",
    "year": null,
    "description": "Christopher Matthew Codding, a youth pastor in Georgia, pleaded guilty to Child Molestation and Sodomy. He taught sexual abuse protection at the church.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child molestation",
      "sexual abuse",
      "sodomy"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1302,
    "name": "Randy Saylor, Assoc. Living Word",
    "year": null,
    "description": "Randy Saylor, Assoc. Pastor at Living Word church, Michigan has been charged with sexual assault involving a child under 13",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1303,
    "name": "Leo Riley, priest",
    "year": 2024,
    "description": "Leo Riley, priest in FL and IA, charged with five counts of sexual abuse in IA and also accused of sexual abuse in FL though no charges yet filed. Case: 01311 FECR154879 (DUBUQUE)",
    "position": [
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1304,
    "name": "Elliot “Alu” Axelman, a former Republican for the NH state",
    "year": 2022,
    "description": "Elliot “Alu” Axelman, a former Republican for the NH state house, has been accused of assaulting a 14-year-old girl at a Libertarian festival in 2022. His trial begins in June.",
    "position": [
      "congress",
      "party member"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "congress",
      "party member",
      "republican"
    ]
  },
  {
    "id": 1305,
    "name": "Jeffrey Allan Hill",
    "year": null,
    "description": "Jeffrey Allan Hill was a youth coach before his arrest for possessing Child Sexual Abuse Material. He pled guilty to a federal charge, but still faces several state charges.",
    "position": [
      "coach"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "coach"
    ]
  },
  {
    "id": 1306,
    "name": "Gabe LeBlanc, former Lafourche Par",
    "year": 2024,
    "description": "Gabe LeBlanc, former Lafourche Parish deputy, has been arrested for producing Child Sexual Abuse Material.",
    "position": [],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1307,
    "name": "Lou",
    "year": null,
    "description": "Louisiana News Director/ Bill Lunn is being investigated for soliciting a minor, caught in a catfish trap.",
    "position": [],
    "crime": [
      "prostitution"
    ],
    "tags": []
  },
  {
    "id": 1308,
    "name": "Barry Fike, Chr",
    "year": null,
    "description": "Barry Fike, former pastor, former teacher at Christian school, former Pepperdine professor pled guilty to online sex crimes with a child. : X",
    "position": [
      "educator",
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "educator",
      "religious leader"
    ]
  },
  {
    "id": 1309,
    "name": "Russell Jon Tusing, Sovereign Grace",
    "year": null,
    "description": "Russell Jon Tusing, a Sovereign Grace pastor, has been arrested for molesting a child. Sovereign Grace churches are so extreme, they argue that disagreeing with their faith is persecution.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child molestation"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1310,
    "name": "Samuel Jason Ingle, Dean of Asheville Chr",
    "year": 2024,
    "description": "Samuel Jason Ingle, Dean of Asheville Christian Academy and a graduate of Liberty University has been arrested for engaging in a sexual act with a student. While registered independent, he chose the GOP primary ballot.",
    "position": [
      "party official"
    ],
    "crime": [],
    "tags": [
      "party official",
      "republican"
    ]
  },
  {
    "id": 1311,
    "name": "Ronnie Allen Killingsworth, a far-right Chr",
    "year": null,
    "description": "Ronnie Allen Killingsworth, a far-right Christian pastor and decades-long book banner, has been convicted of raping three children in his church. He was sentenced to 42 years in prison.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1312,
    "name": "Gregory McLean, a Naval Commander from Jacksonville",
    "year": null,
    "description": "Gregory McLean, a Naval Commander from Jacksonville FL, was sentenced to 160 months for distributing Child Sexual Abuse Material and 120 months for unlawfully retaining national defense information, served concurrently. : X",
    "position": [],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1313,
    "name": "Robert Morr",
    "year": null,
    "description": "Robert Morris of TX (not 1035 VA) was pastor of Gateway Church in Southlake, TX, confessed to moral failure for his relationship with a “young lady” who was 12 at the time she claims he began molesting her and raping her. He was Trump’s spiritual advisor.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child molestation",
      "rape"
    ],
    "tags": [
      "maga",
      "religious leader"
    ]
  },
  {
    "id": 1314,
    "name": "Neil Fr",
    "year": 2024,
    "description": "Neil Friske, a Republican state representative in Michigan, was arrested for a felony level offense, allegedly menacing a stripper with a gun, chasing her outside his home. Police were called for shots fired. He said he was exercising his 2nd amendment rights.",
    "position": [
      "law enforcement",
      "party member",
      "state legislator"
    ],
    "crime": [],
    "tags": [
      "law enforcement",
      "party member",
      "republican",
      "state legislator"
    ]
  },
  {
    "id": 1315,
    "name": "Thomas L. Deane",
    "year": null,
    "description": "Thomas L. Deane was a high school teacher and lacrosse coach in Florida. He has been sentenced to 23 years for possession of Child Sexual Abuse Material.",
    "position": [
      "coach",
      "educator"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "coach",
      "educator"
    ]
  },
  {
    "id": 1316,
    "name": "Luke Cunningham, Turning Point",
    "year": 2024,
    "description": "Luke Cunningham, youth pastor at Turning Point Community Church and Lakeside Baptist Church, in Texas, charged with sexually assaulting a child.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1317,
    "name": "Ryan Ivy, a",
    "year": null,
    "description": "Ryan Ivy, a youth pastor in Bluff Dale, TX, was originally charged with online solicitation of a minor. A hung jury in his first trial, he reached a plea deal, pleading guilty to online harassment.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1318,
    "name": "Joel Bruce Searby, former GOP consultant and current",
    "year": null,
    "description": "Joel Bruce Searby, former GOP consultant and current charter school initiative leader, arrested for soliciting a minor.",
    "position": [
      "party official"
    ],
    "crime": [
      "prostitution"
    ],
    "tags": [
      "party official",
      "republican"
    ]
  },
  {
    "id": 1319,
    "name": "Jonathan Edward Elwing, Palm View",
    "year": null,
    "description": "Jonathan Edward Elwing, senior pastor at Palm View Baptist Church in Palmetto, FL, charged with purchasing child sexual abuse imagery. : X",
    "position": [
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1320,
    "name": "Martin W. Wallace, a therap",
    "year": 2024,
    "description": "Martin W. Wallace, a therapist in Sibley, IA, has been charged with sexually abusing a 13-year-old patient. Supposedly there have been many accusations, no professional discipline.",
    "position": [],
    "crime": [
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1321,
    "name": "Patrick Stephen Miller",
    "year": 2024,
    "description": "Patrick Stephen Miller was Associate Children’s Ministry Director for Immanuel Baptist in Little Rock, AR, when he was charged with sexually assaulting two minor children. So he got a job as Assc. Children’s Ministry Director at First Moore Baptist, in OK.",
    "position": [],
    "crime": [
      "assault"
    ],
    "tags": []
  },
  {
    "id": 1322,
    "name": "Trevor Renare, Bannock",
    "year": null,
    "description": "Trevor Renare, Bannock County, ID, Sheriff’s Deputy, has been charged with sexual battery of a minor",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1323,
    "name": "Chr",
    "year": 2024,
    "description": "Christopher Cassidy, formerly a police officer in Tammany Parish, LA, has been sentenced to 15 years for 78 counts of child sexual abuse material and 111 counts of sexual abuse of animals",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1324,
    "name": "Denn",
    "year": null,
    "description": "Dennis Houchin, a retired U.S. Air Force Senior Master Sergeant in Vero Beach, CA, was charged with possession of child sexual abuse imagery. He allegedly created CSAM featuring a young relative. : X",
    "position": [],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1325,
    "name": "Jonathan Shaheen, former",
    "year": 2024,
    "description": "Jonathan Shaheen, former evangelical pastor, sentenced to 2 years for possession and distribution of CSAM. Colorado Spring, CO",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child pornography"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1326,
    "name": "Keith Farrell, Republican City",
    "year": 2024,
    "description": "Keith Farrell, Republican City Councilman in Providence, KY, indicted for sexual abuse of a minor under 16",
    "position": [
      "local official",
      "party member"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "local official",
      "party member",
      "republican"
    ]
  },
  {
    "id": 1327,
    "name": "Walter Dav",
    "year": 2024,
    "description": "Walter Davis Lundy, former advisor to failed GOP congressional candidate and current Hamilton County Mayor Weston Wamp has been indicted for beating adult son with a baseball bat.",
    "position": [
      "candidate",
      "congress",
      "local official",
      "party official"
    ],
    "crime": [],
    "tags": [
      "candidate",
      "congress",
      "local official",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1328,
    "name": "Joshua Kindred, Trump-appointed",
    "year": 2024,
    "description": "Joshua Kindred, a Trump-appointed federal judge, resigned after a judicial review board found that he committed sexual misconduct and lied to investigators.",
    "position": [
      "judge"
    ],
    "crime": [],
    "tags": [
      "judge",
      "maga"
    ]
  },
  {
    "id": 1329,
    "name": "Riley Carter, Aberdeen,",
    "year": 2025,
    "description": "Riley Carter, Aberdeen, WA City Councilman, arrested twice this year, for domestic abuse and the rape of a child under the age of 12. Convicted June 2025. Sentenced to",
    "position": [
      "local official"
    ],
    "crime": [
      "rape",
      "sexual abuse"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1330,
    "name": "Michael Paustian, Chr",
    "year": null,
    "description": "Michael Paustian, Christian publishing house creative director, sentenced to 8 years to life for child sexual abuse : X",
    "position": [
      "congress"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "congress"
    ]
  },
  {
    "id": 1331,
    "name": "George Bardmesser, GOP",
    "year": null,
    "description": "George Bardmesser, GOP candidate for Sunny Isles Beach commissioner (FL) arrested for striking one teen and putting another in a chokehold",
    "position": [
      "candidate",
      "local official",
      "party official"
    ],
    "crime": [],
    "tags": [
      "candidate",
      "local official",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1332,
    "name": "Brett Callaway, Chair of Buncombe County GOP, found",
    "year": null,
    "description": "Brett Callaway, Chair of Buncombe County GOP, found guilty of assault of a woman, a school board member. It seems the judge will not impose punishment because “that’s the state of politics today.”",
    "position": [
      "judge",
      "party official"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "judge",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1333,
    "name": "RJ May, Republican State Rep in South Carolina, Chair of",
    "year": null,
    "description": "RJ May, Republican State Rep in South Carolina, Chair of Freedom Caucus, is under investigation for possession of CSAM - a search warrant served and devices collected.",
    "position": [
      "party member",
      "party official"
    ],
    "crime": [
      "child pornography"
    ],
    "tags": [
      "party member",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1334,
    "name": "Joshua Dane Wells, a",
    "year": null,
    "description": "Joshua Dane Wells, a part-time deputy, pastor, and foster parent in Dekalb County, Alabama, has been arrested for inappropriate sexual conduct with minors. Host of rightwing Pentecostal Holiness podcast.",
    "position": [
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1335,
    "name": "Mike Vereb, Republican Democratic",
    "year": null,
    "description": "Mike Vereb, the Republican aide to Democratic Governor Josh Shapiro, was accused of sexual harassment. The state paid $295,000 to settle the claim.",
    "position": [
      "governor",
      "party member"
    ],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "governor",
      "party member",
      "republican"
    ]
  },
  {
    "id": 1336,
    "name": "James Robert Murphey, a",
    "year": null,
    "description": "James Robert Murphey, a youth pastor at a church in High Point, North Carolina, has been arrested and charged with 30 counts of sexual battery involving teens.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1337,
    "name": "Dean Allen Wallowing Bull, GOP House",
    "year": null,
    "description": "Dean Allen Wallowing Bull, a GOP state House candidate from Lame Deer, MT, has been charged with sexual abuse of two people who had no ability to refuse and an attempted : X sexual abuse of another.",
    "position": [
      "candidate",
      "congress",
      "party official"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "candidate",
      "congress",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1338,
    "name": "Paul Calhoun, the",
    "year": null,
    "description": "Paul Calhoun, the former Mayor of Lake View, AL, was charged with possession of Child Sexual Abuse Material. He was originally appointed by Republican Governor Robert Bentley.",
    "position": [
      "governor",
      "local official",
      "party member"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "governor",
      "local official",
      "party member",
      "republican"
    ]
  },
  {
    "id": 1339,
    "name": "Doug Pitassi, CEO of Pacific Office Automation, OR’s",
    "year": 2024,
    "description": "Doug Pitassi, CEO of Pacific Office Automation, OR’s largest employer, and a Trump/GOP donor is accused of sexual harassment including unwanted touching. He pled guilty to exposing himself to teenagers when he was a teacher at Centennial High 40 years ago.",
    "position": [
      "educator",
      "party official"
    ],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "educator",
      "maga",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1340,
    "name": "Andy Santana. Treasurer",
    "year": null,
    "description": "Andy Santana. Treasurer of Miami Republican mayoral candidate Alex Ataola’s campaign, has been arrested for sex (rape) with a minor",
    "position": [
      "candidate",
      "local official",
      "party member"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "candidate",
      "local official",
      "party member",
      "republican"
    ]
  },
  {
    "id": 1341,
    "name": "John D Jessup, Republican Hancock County",
    "year": 2024,
    "description": "John D Jessup, Republican Hancock County Commissioner of Indiana is facing trial for sexual assault in Las Vegas",
    "position": [
      "local official",
      "party member"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "local official",
      "party member",
      "republican"
    ]
  },
  {
    "id": 1342,
    "name": "Dave McCormick, PA GOP Senate nominee, d",
    "year": 2024,
    "description": "Dave McCormick, PA GOP Senate nominee, discouraged and threatened women who made allegations of sexual harassment against employees of the company where he was co-CEO",
    "position": [
      "party official"
    ],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "party official",
      "republican"
    ]
  },
  {
    "id": 1343,
    "name": "Leroy Dr",
    "year": null,
    "description": "Leroy Driscoll, Indianapolis Police Department Chaplain and Trump supporter, accused of repeatedly raping a child since she was around 5.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "law enforcement",
      "maga"
    ]
  },
  {
    "id": 1344,
    "name": "Clayton Sallee, a",
    "year": null,
    "description": "Clayton Sallee, a teacher in Farmington, AR, was arrested for sexual assault of a minor : X",
    "position": [
      "educator"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1345,
    "name": "David McCauley, Republican city council member and",
    "year": null,
    "description": "David McCauley, Republican city council member and former mayor of Buckhannon, has been charged with producing child sexual abuse material",
    "position": [
      "local official",
      "party member"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "local official",
      "party member",
      "republican"
    ]
  },
  {
    "id": 1346,
    "name": "Zachary Joseph Radcliff, CPAC worship leader and",
    "year": null,
    "description": "Zachary Joseph Radcliff, CPAC worship leader and Michigan Christian musician, is charged with one count of first-degree criminal sexual conduct, four counts of child sexually abusive activity, and six counts of using a computer/internet to commit a crime.",
    "position": [
      "party official"
    ],
    "crime": [
      "sexual abuse",
      "child exploitation"
    ],
    "tags": [
      "party official"
    ]
  },
  {
    "id": 1347,
    "name": "Doug Brown, Buncombe Co GOP Chair, has been found",
    "year": 2024,
    "description": "Doug Brown, Buncombe Co GOP Chair, has been found guilty of assaulting a woman, a local school board member. NC",
    "position": [
      "party official"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "party official",
      "republican"
    ]
  },
  {
    "id": 1348,
    "name": "Stephen Bojekian, retired",
    "year": 2024,
    "description": "Stephen Bojekian, retired chief of Bergen County Sheriff’s Dept, has been arrested for possession of CSAM.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "child pornography"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1349,
    "name": "Ryan C. Capps, a",
    "year": null,
    "description": "Ryan C. Capps, a former middle school teacher in Durant, OK, has been convicted of child exploitation and sentenced to 25 years.",
    "position": [
      "educator"
    ],
    "crime": [
      "child exploitation"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1350,
    "name": "Kevin Menon, a Las Vegas police sergeant, has been",
    "year": null,
    "description": "Kevin Menon, a Las Vegas police sergeant, has been arrested for possession of child sexual abuse material",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1351,
    "name": "Starr Emery, Republican MT House",
    "year": null,
    "description": "Starr Emery, Republican MT House candidate, has been charged with child endangerment for allowing a 2-year-old to wander unsupervised on the street. She is running a campaign for “safe children,’ ‘sound families’ and standing up for MT families. She has pled not guilty",
    "position": [
      "candidate",
      "congress",
      "party member"
    ],
    "crime": [],
    "tags": [
      "candidate",
      "congress",
      "party member",
      "republican"
    ]
  },
  {
    "id": 1352,
    "name": "Rebecca Hood, Gordon County, GA, County",
    "year": 2024,
    "description": "Rebecca Hood, Gordon County, GA, County Commissioner, and her husband have been charged with cruelty to their adopted children. : X",
    "position": [
      "local official"
    ],
    "crime": [],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1353,
    "name": "Blake Steiner, the Baton Rouge city-par",
    "year": null,
    "description": "Blake Steiner, the Baton Rouge city-parish's chief building officer has been arrested for possession of child sexual abuse material",
    "position": [],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1354,
    "name": "James Burland, Republican lobby",
    "year": null,
    "description": "James Burland, Republican lobbyist and lawyer has been charged with possession of child sexual abuse material",
    "position": [
      "lobbyist",
      "party member"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "lobbyist",
      "party member",
      "republican"
    ]
  },
  {
    "id": 1355,
    "name": "Jason Yates, MN,",
    "year": 2024,
    "description": "Jason Yates, MN, of My Faith Votes, was arrested for possession of child sexual abuse material. Told police he had a prior conviction for CSAM that was expunged.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1356,
    "name": "Bobby Cheshire, TX, former Angelina County",
    "year": 2024,
    "description": "Bobby Cheshire, TX, former Angelina County Commissioner, already in prison for familial violence, is preparing for trial for aggravated sexual assault of a child and child indecency.",
    "position": [
      "local official"
    ],
    "crime": [
      "assault",
      "sexual assault",
      "violence"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1357,
    "name": "David Paul Daniel, NC Insurrection",
    "year": null,
    "description": "David Paul Daniel, NC Insurrectionist, faces charges of child pornography possession and sexual exploitation of a minor",
    "position": [],
    "crime": [
      "child exploitation",
      "child pornography"
    ],
    "tags": []
  },
  {
    "id": 1358,
    "name": "James Cowan, evangelical",
    "year": null,
    "description": "James Cowan, evangelical pastor of Little River church in AR, sentenced to 50 years for raping his children.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1359,
    "name": "Eric Stearns, a teacher at St. Helens High School",
    "year": null,
    "description": "Eric Stearns, a teacher at St. Helens High School was charged with sexual abuse of his students",
    "position": [
      "educator"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1360,
    "name": "Mark Collins, a",
    "year": null,
    "description": "Mark Collins, a former teacher at St. Helens high School, charged with sexual abuse of students : X",
    "position": [
      "educator"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1361,
    "name": "Peter Hegseth, Secretary",
    "year": null,
    "description": "Peter Hegseth, Secretary of Defense nominee, was accused of sexual assault. He settled with the woman. He was never prosecuted. His mother’s letter accusing him of abusing women has been made public.",
    "position": [],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": []
  },
  {
    "id": 1362,
    "name": "Michael “Luke Atwell, former Palo Verde teacher, has been",
    "year": null,
    "description": "Michael “Luke Atwell, former Palo Verde teacher, has been charged with sexually abusing a student when the student was between 11 and 14.",
    "position": [
      "educator"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1363,
    "name": "Ricci Wynne (Raw Ricci) who rose to fame as a MAGA",
    "year": null,
    "description": "Ricci Wynne (Raw Ricci) who rose to fame as a MAGA influencer and FOX News guest by harassing and shaming homeless people has been arrested for producing child sexual abuse material and trafficking",
    "position": [],
    "crime": [
      "child pornography",
      "sexual abuse",
      "sexual trafficking"
    ],
    "tags": [
      "republican"
    ]
  },
  {
    "id": 1364,
    "name": "Taylor Lew",
    "year": null,
    "description": "Taylor Lewis, a police officer in Springfield, Louisiana, was arrested, charged with indecent behavior with a juvenile.",
    "position": [
      "law enforcement"
    ],
    "crime": [],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1365,
    "name": "Charles Kyote Dunn, City Manager of Waurika, OK, has",
    "year": null,
    "description": "Charles Kyote Dunn, City Manager of Waurika, OK, has been charged with child sexual abuse",
    "position": [],
    "crime": [
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1366,
    "name": "Michael Priest, co-founder with h",
    "year": null,
    "description": "Michael Priest, co-founder with his wife of 99+1 charity for foster kids in OK, has been charged with child sexual abuse",
    "position": [
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1367,
    "name": "Michael “Luke” Atwell, Nevada high school teacher and",
    "year": null,
    "description": "Michael “Luke” Atwell, Nevada high school teacher and basketball coach, has been charged with child sexual abuse.",
    "position": [
      "coach",
      "educator"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "coach",
      "educator"
    ]
  },
  {
    "id": 1368,
    "name": "Matthew Huttle, Indiana insurrection",
    "year": null,
    "description": "Matthew Huttle, Indiana insurrectionist pardoned by Trump, was previously sentenced to 2.5 years for battery of his son, beating him so badly he could not sit properly for a week. He was shot to death a week after his release in a clash with police.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "law enforcement",
      "maga"
    ]
  },
  {
    "id": 1369,
    "name": "Theodore Middendorf, Illino",
    "year": 2024,
    "description": "Theodore Middendorf, Illinois insurrectionist pardoned by Trump, raped a seven year old child. He pleaded guilty in May 2024",
    "position": [],
    "crime": [
      "rape"
    ],
    "tags": [
      "maga"
    ]
  },
  {
    "id": 1370,
    "name": "Peter Schwartz, Kentucky insurrection",
    "year": 2023,
    "description": "Peter Schwartz, Kentucky insurrectionist pardoned by Trump. He assaulted police on Jan. 6 and had an extensive history of violent behavior including domestic violence.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "assault",
      "domestic violence",
      "violence"
    ],
    "tags": [
      "law enforcement",
      "maga"
    ]
  },
  {
    "id": 1371,
    "name": "Daniel Ball, Florida insurrection",
    "year": null,
    "description": "Daniel Ball, Florida insurrectionist pardoned by Trump, has a criminal record that includes Domestic Violence Battery by Strangulation,\"",
    "position": [],
    "crime": [
      "domestic violence",
      "violence"
    ],
    "tags": [
      "maga"
    ]
  },
  {
    "id": 1372,
    "name": "Kasey Hopkins, Kansas insurrection",
    "year": null,
    "description": "Kasey Hopkins, Kansas insurrectionist pardoned by Trump, raped a woman, battering her and urinated in her mouth",
    "position": [],
    "crime": [
      "rape"
    ],
    "tags": [
      "maga"
    ]
  },
  {
    "id": 1373,
    "name": "Edward Richmond, Jr., Lou",
    "year": null,
    "description": "Edward Richmond, Jr., Louisiana insurrectionist pardoned by Trump was court martialed for shooting a handcuffed Iraqi and convicted. He has also been charged with domestic violence though, as often happens, charges were dropped",
    "position": [],
    "crime": [
      "domestic violence",
      "violence"
    ],
    "tags": [
      "maga"
    ]
  },
  {
    "id": 1374,
    "name": "Benjamin Martin, CAlifornia insurrection",
    "year": 2016,
    "description": "Benjamin Martin, CAlifornia insurrectionist pardoned by Trump, pled to battery charge in 2016 for beating his 14- year-old daughter and in 2018 for assaulting his girlfriend.",
    "position": [],
    "crime": [
      "assault"
    ],
    "tags": [
      "maga"
    ]
  },
  {
    "id": 1375,
    "name": "Andrew Taake, TX insurrection",
    "year": null,
    "description": "Andrew Taake, TX insurrectionist is wanted for online solicitation of a minor.",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1376,
    "name": "Harr",
    "year": null,
    "description": "Harrison “Ted” Clark of Florida was elected to the Clay Soil and Water Conservation District. He has been arrested for online solicitation of a minor in a predator sting.",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1377,
    "name": "Aaron Craig Gleason, hatemongering writer for The",
    "year": null,
    "description": "Aaron Craig Gleason, hatemongering writer for The Federalist, the Daily Wire, and The Imaginative Conservative and religion teacher and soccer coach at Christian school has been arrested for soliciting a child under the age of 12.",
    "position": [
      "coach",
      "educator"
    ],
    "crime": [
      "prostitution"
    ],
    "tags": [
      "coach",
      "educator"
    ]
  },
  {
    "id": 1378,
    "name": "Ryan D. Jenks, former GOP leg",
    "year": null,
    "description": "Ryan D. Jenks, former GOP legislative candidate in Idaho, has been arrested for lewd conduct with and sexual abuse of a minor under sixteen. He is co-owner of a mental health clinic for children and teens and active in youth sports.",
    "position": [
      "candidate",
      "party official"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "candidate",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1379,
    "name": "Chr",
    "year": null,
    "description": "Christopher David Burk, SLC Fire Captain, EMT instructor, juvenile detention center employee has 13 charges for unwanted touching/groping women during instruction or after class.",
    "position": [],
    "crime": [
      "sexual harassment"
    ],
    "tags": []
  },
  {
    "id": 1380,
    "name": "John Giarrusso III., a New Hampshire police officer, has",
    "year": null,
    "description": "John Giarrusso III., a New Hampshire police officer, has been charged with possession and distribution of child sexual abuse material. He has presented himself as an advocate for children on social media.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1381,
    "name": "Justin Eichorn",
    "year": null,
    "description": "Justin Eichorn is a Minnesota state senator. The same day he introduced a bill to make distaste for Trump (Trump Derangement Syndrome) a mental illness, he was arrested for soliciting a minor.",
    "position": [
      "state legislator"
    ],
    "crime": [
      "prostitution"
    ],
    "tags": [
      "maga",
      "state legislator"
    ]
  },
  {
    "id": 1382,
    "name": "Erik Sickinger, mayor",
    "year": null,
    "description": "Erik Sickinger, mayor pro tem of Irmo, SC, has been arrested for grooming and raping a 15-year-old boy.",
    "position": [
      "local official"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1383,
    "name": "Casey Medina, Rochester",
    "year": null,
    "description": "Casey Medina, Rochester NY police trainee, pleaded guilty to possession of CSAM and cyberstalking : X",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "child pornography"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1384,
    "name": "Dan Halloran, former Republican NYC councilmember from",
    "year": null,
    "description": "Dan Halloran, former Republican NYC councilmember from Queens, was arrested at Miami airport for posession of Child Sexual Abuse Material",
    "position": [
      "local official",
      "party member"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "local official",
      "party member",
      "republican"
    ]
  },
  {
    "id": 1385,
    "name": "Gerald “Jerry” Cummings, recently elected Oregon GOP",
    "year": null,
    "description": "Gerald “Jerry” Cummings, recently elected Oregon GOP Chair, is accused of domestic violence and marital rape. He began a sexual relationship with his wife when she was 16, married her when she was 19, violently abused her and kept her sexually compliant with threats to rape children whom he mentioned by name. He resigned when this story came out.",
    "position": [
      "party official"
    ],
    "crime": [
      "domestic violence",
      "rape",
      "sexual abuse",
      "violence"
    ],
    "tags": [
      "party official",
      "republican"
    ]
  },
  {
    "id": 1386,
    "name": "Matthew Henry Laparra, NC Trinity Worship Center",
    "year": null,
    "description": "Matthew Henry Laparra, NC Trinity Worship Center worship director, has been charged with 3 counts of statuatory rape and two of taking indecent liberties with a child.",
    "position": [],
    "crime": [
      "rape"
    ],
    "tags": []
  },
  {
    "id": 1387,
    "name": "Tyler F",
    "year": null,
    "description": "Tyler Fischer, a right-wing comedian, has been banned from FOX News for harassing a woman who works there. He says he only asked her if she wanted to go out for coffee and that FOX has “gone full woke.” FOX!",
    "position": [],
    "crime": [
      "sexual harassment"
    ],
    "tags": []
  },
  {
    "id": 1388,
    "name": "Frederick Piccolo, a former spokesperson for Ron",
    "year": null,
    "description": "Frederick Piccolo, a former spokesperson for Ron DeSantis who later became Comms Director for New College of Florida has been charged with exposing himself. His attorney blamed it on his recent diagnosis of Parkinson’s",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1389,
    "name": "John Kevin Taylor, Mayor",
    "year": null,
    "description": "John Kevin Taylor, Mayor of Mount Washington, KY, has been arrested for possession of child sexual abuse material. His wife was indicted for failure to report, destruction of evidence",
    "position": [
      "local official"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1390,
    "name": "Gary Thomas Keesee, Jr., a former Ohio megachurch",
    "year": null,
    "description": "Gary Thomas Keesee, Jr., a former Ohio megachurch leader, has been charged with sexually abusing three children over the course of nine years, victims range from ages 6 to 15, though abuse began when 5 or 6 years old. : X",
    "position": [
      "party official"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "party official"
    ]
  },
  {
    "id": 1391,
    "name": "James Vincent Henry",
    "year": null,
    "description": "James Vincent Henry was pastor of Crossroads Assembly of God Church in Delight, Arkansas. He was sentenced to 110 years in prison for possession of child sexual abuse material. He faced 100 charges, pleaded guilty to 11, and was sentenced to ten years for each, to be served consecutively.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1392,
    "name": "Gail Priest, co-founder of 99+1 Foundation, an OK foster",
    "year": null,
    "description": "Gail Priest, co-founder of 99+1 Foundation, an OK foster care advocacy organization, was charged with failure to report. In essence, knowing her husband Michael Priest (1366) was sexually abusing children. He was arrested 7/24. She arrested 3/25",
    "position": [
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1393,
    "name": "Jay Quam, GOP Gov. Tim",
    "year": null,
    "description": "Jay Quam, retired judge appointed by GOP Gov. Tim Pawlenty, was reprimanded by the Board of Judicial Standards for sexual harassment and relationship with cler.",
    "position": [
      "judge",
      "party official"
    ],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "judge",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1394,
    "name": "Nicholas Hacker, ND State",
    "year": null,
    "description": "Nicholas Hacker, ND State Senator and on state university board, received communications from convicted pedophile colleague Ray Holmberg with detailed descriptions of sexual encounters with underage sex worker in Taiwan. Failed to report Holmberg’s activities though he has not been prosecuted.",
    "position": [
      "state legislator"
    ],
    "crime": [],
    "tags": [
      "state legislator"
    ]
  },
  {
    "id": 1395,
    "name": "Nathan Rees, UND professor, received emails from",
    "year": null,
    "description": "Nathan Rees, UND professor, received emails from pedophile Ray Holmber describing his grooming of a student and made no report even though he is a teacher.",
    "position": [
      "educator"
    ],
    "crime": [],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1396,
    "name": "Jovante Teague, newly elected GOP Party vice’chair in",
    "year": null,
    "description": "Jovante Teague, newly elected GOP Party vice’chair in Florida, pleaded guilty to smuggling contraband as a prison guard in a plea deal that let him off the hook for the more serious allegations of pursuing a sexual relationship with a prisoner, an abuse of power.",
    "position": [
      "party official"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "party official",
      "republican"
    ]
  },
  {
    "id": 1397,
    "name": "Stephen Kamnik, a PA State Police Corporal, has been",
    "year": null,
    "description": "Stephen Kamnik, a PA State Police Corporal, has been arrested for creation of child sexual abuse material.using AI, secretly recording women’s locker room of colleagues.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1398,
    "name": "Rodney Creech, Ohio",
    "year": null,
    "description": "Rodney Creech, Ohio state representative (GOP) was stripped of committee assignments after an investigation found he inappropriately touched a minor family member and crawled into that minor’s bed with an erection. No criminal complaint filed.",
    "position": [
      "party official",
      "state legislator"
    ],
    "crime": [],
    "tags": [
      "party official",
      "republican",
      "state legislator"
    ]
  },
  {
    "id": 1399,
    "name": "Jeremy Franc",
    "year": null,
    "description": "Jeremy Francis Plonski, a MN state trooper, was arrested for production of child sexual abuse material of himself raping an infant.",
    "position": [],
    "crime": [
      "child pornography",
      "rape",
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1400,
    "name": "David G. McConkie, El Paso County, CO, Deputy D",
    "year": null,
    "description": "David G. McConkie, El Paso County, CO, Deputy District Atty and Mormon Bishop, was charged with sexual assault of a child. He avoided jail with a plea deal in spite of his confession. : X",
    "position": [
      "religious leader"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1401,
    "name": "John Denzel, Catholic school Safe Environment",
    "year": null,
    "description": "John Denzel, Catholic school Safe Environment Coordinator in charge of background checks, etc. arrested for possession of child sexual abuse material.",
    "position": [],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1402,
    "name": "Judd Stone, the TX Solicitor General who argued that",
    "year": null,
    "description": "Judd Stone, the TX Solicitor General who argued that knowing abortion happened caused anyone harm has had to resign after a civil sex harassment suit revealed he tols his colleagues about his violent rape fantasies that involved them. He also shared with judges and governor’s staff.",
    "position": [
      "governor",
      "judge"
    ],
    "crime": [
      "rape",
      "sexual harassment"
    ],
    "tags": [
      "governor",
      "judge"
    ]
  },
  {
    "id": 1403,
    "name": "Robert J. May, SC",
    "year": null,
    "description": "Robert J. (RJ) May, SC state representative and a founder of SC Freedom Caucus, charged with 10 counts of distributing child sexual abuse material. No bail",
    "position": [
      "state legislator"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "state legislator"
    ]
  },
  {
    "id": 1404,
    "name": "David Finkel, School Board VP and former Republican",
    "year": null,
    "description": "David Finkel, School Board VP and former Republican primary mayoral candidate, has resigned from all local board positions after federal warrant in CSAM investigation. He was subsequently arrested and charged with possession of CSAM",
    "position": [
      "candidate",
      "local official",
      "party member"
    ],
    "crime": [
      "child pornography"
    ],
    "tags": [
      "candidate",
      "local official",
      "party member",
      "republican"
    ]
  },
  {
    "id": 1405,
    "name": "Joshua Dice, a teacher at Calvary Chr",
    "year": null,
    "description": "Joshua Dice, a teacher at Calvary Christian Academy & Calvary Baptist Church employee, was arrested for online solicitation and traveling to meet a minor. : X",
    "position": [
      "educator"
    ],
    "crime": [],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1406,
    "name": "Michael Tait, the DC evangelical singer, rallied for Trump in",
    "year": 2004,
    "description": "Michael Tait, the DC evangelical singer, rallied for Trump in Miami, his song “God Is Not Dead” is a MAGA anthem. He is accused of sexual assault by three men. Tait admitted to nonconsensual sexual conduct and said accusations are largely true.",
    "position": [],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "maga",
      "republican"
    ]
  },
  {
    "id": 1407,
    "name": "Daniel Merrick, a",
    "year": 2023,
    "description": "Daniel Merrick, a pastor of a messianic church and a Chrisitian musician was charged with over 800 counts of possessing child sexual abuse material",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1408,
    "name": "Kevin Chr",
    "year": null,
    "description": "Kevin Christensen, Utah judge, resigned after arrest for several sex crimes against children",
    "position": [
      "judge"
    ],
    "crime": [],
    "tags": [
      "judge"
    ]
  },
  {
    "id": 1409,
    "name": "Ned B. Hansen",
    "year": null,
    "description": "Ned B. Hansen was fire chief of Tremonton, UT, until he was sued by relatives who allege he sexually abused and exploited them.",
    "position": [],
    "crime": [
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1410,
    "name": "Richard Renno, Benton County, M",
    "year": null,
    "description": "Richard Renno, Benton County, Missouri, Treasurer, has been charged with child enticement (more commonly called soliciting a minor) using a data app.",
    "position": [],
    "crime": [
      "prostitution"
    ],
    "tags": []
  },
  {
    "id": 1411,
    "name": "Elgene Gary, former Grand",
    "year": null,
    "description": "Elgene Gary, former Grand Isle, LA, City Council member and police officer has been convicted of sexual battery of a child.",
    "position": [
      "law enforcement",
      "local official"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "law enforcement",
      "local official"
    ]
  },
  {
    "id": 1412,
    "name": "David Whitmire, Liberty County Comm",
    "year": null,
    "description": "David Whitmire, Liberty County Commissioner (TX), has been accused of sexual assault and offering to pay for sex with money and in exchange for the right to child custody",
    "position": [
      "local official"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1413,
    "name": "William Kenneth Kendall, a Utah d",
    "year": null,
    "description": "William Kenneth Kendall, a Utah district judge, has been accused of sexual assault, forcibly touching a woman without consent after giving her THC.",
    "position": [
      "judge"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "judge"
    ]
  },
  {
    "id": 1414,
    "name": "Timothy McGhee, GOP",
    "year": null,
    "description": "Timothy McGhee, former GOP candidate for VA House District 30, has been charged with taking indecent liberties with a high school student he met while substitute teaching.",
    "position": [
      "candidate",
      "congress",
      "party official"
    ],
    "crime": [],
    "tags": [
      "candidate",
      "congress",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1415,
    "name": "Kurt Schenk, a former Coatesville PA City Council member",
    "year": null,
    "description": "Kurt Schenk, a former Coatesville PA City Council member and the pastor of New Beginning Church of the Cross has been charged with sexually assaulting a woman who is intellectually disabled, instead of taking her home, taking her to his home where he assaulted her.",
    "position": [
      "local official",
      "religious leader"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "local official",
      "religious leader"
    ]
  },
  {
    "id": 1416,
    "name": "Mike Maroney, W VA",
    "year": null,
    "description": "Mike Maroney, a former W VA state senator, was arrested for indecent exposure, masturbating at a grocery store while playing lotto machines. Shortly after he was arrested for DUI. His plea deal was rejected by the judge. A week later, he was arrested for bond violation",
    "position": [
      "judge",
      "state legislator"
    ],
    "crime": [],
    "tags": [
      "judge",
      "state legislator"
    ]
  },
  {
    "id": 1417,
    "name": "Scott Finkbeiner, Hot Springs County",
    "year": null,
    "description": "Scott Finkbeiner, Hot Springs County Sheriff in Ark., has pleaded guilty to misleading the FBI into a multiple offense case that included working with a drug dealer, witness tampering, and sexual coercion of women associates of the drug dealer.",
    "position": [
      "law enforcement"
    ],
    "crime": [],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1418,
    "name": "Carlton Huffman, GOP Strateg",
    "year": 2023,
    "description": "Carlton Huffman, GOP Strategist who accused Matt Schlapp, is accused of forcible fondling and digital penetration. He claims all was consensual.",
    "position": [
      "party official"
    ],
    "crime": [
      "child molestation"
    ],
    "tags": [
      "party official",
      "republican"
    ]
  },
  {
    "id": 1419,
    "name": "Antonio Brown, former",
    "year": 2019,
    "description": "Antonio Brown, former NFL player who endorsed Trump, was accused of exposing himself to a woman at a pool in Dubai. Two other women have accused him of sexual misconduct, including rape. He is now wanted for attempted murder in Miami.",
    "position": [],
    "crime": [
      "rape"
    ],
    "tags": [
      "maga"
    ]
  },
  {
    "id": 1420,
    "name": "Le’Veon Bell, former NFL player who endorsed Trump",
    "year": null,
    "description": "Le’Veon Bell, former NFL player who endorsed Trump was ordered to pay $25 million to a woman (a relative) whom he : X and his brother sexually abused since she was 6 or 7 years old.",
    "position": [],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "maga"
    ]
  },
  {
    "id": 1421,
    "name": "Johnny Hunt, former president of the Southern Bapt",
    "year": null,
    "description": "Johnny Hunt, former president of the Southern Baptist Convention was accused of sexual assault. The Guidepost investigation found allegations credible. So did the judge who dismissed his defamation lawsuit. He was pastor of megachurch in Georgia.",
    "position": [
      "judge",
      "religious leader"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "judge",
      "religious leader"
    ]
  },
  {
    "id": 1422,
    "name": "Brad Namdar",
    "year": 2022,
    "description": "Brad Namdar was a GOP Congressional primary candidate in TX-32. He was also an outspoken advocate against human trafficking. He lost his endorsements & was asked to leave anti-trafficking organization after an escort told media he hired her twice & didn’t pay for the second. He is also alleged to have inappropriately touched a student who was under age.",
    "position": [
      "candidate",
      "congress",
      "party official"
    ],
    "crime": [
      "sexual trafficking"
    ],
    "tags": [
      "candidate",
      "congress",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1423,
    "name": "Will Gardner, ND Sec.",
    "year": 2018,
    "description": "Will Gardner, ND Sec. of State candidate dropped out of the race after his past conviction for disorderly conduct caused by being caught peeping on girl’s dorm with pants undone. He was 29.",
    "position": [
      "candidate"
    ],
    "crime": [],
    "tags": [
      "candidate"
    ]
  },
  {
    "id": 1424,
    "name": "Jon Stanard, UT state rep, hired a sex worker. I don’t",
    "year": null,
    "description": "Jon Stanard, UT state rep, hired a sex worker. I don’t usually note these non-coerced adult interactions, but he used taxpayer funds to pay for the hotel.",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1425,
    "name": "Russ Casey, a",
    "year": null,
    "description": "Russ Casey, a TX Justice of the Peace, accused of indecent exposure, sexual harassment, and assault. Also caught with fraudulent signatures on candidate filing, forced to withdraw from GOP primary.",
    "position": [
      "candidate",
      "party official"
    ],
    "crime": [
      "assault",
      "sexual harassment"
    ],
    "tags": [
      "candidate",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1426,
    "name": "Mike Yenni, former Jefferson County Par",
    "year": 2024,
    "description": "Mike Yenni, former Jefferson County Parish president, resigned after being caught sexting a minor, soliciting a minor. He was hired as Deputy Registrar in 2024.",
    "position": [],
    "crime": [
      "prostitution"
    ],
    "tags": []
  },
  {
    "id": 1427,
    "name": "Matt McCullough, GOP",
    "year": 2022,
    "description": "Matt McCullough, GOP candidate for senate senate in PA, was arrested for public intoxication after police were called when he groped the breasts of a strip club employee.",
    "position": [
      "candidate",
      "law enforcement",
      "party official"
    ],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "candidate",
      "law enforcement",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1428,
    "name": "Carl DeMaio, San Diego",
    "year": 2014,
    "description": "Carl DeMaio, San Diego city council member, mayoral candidate, and congressional candidate, accused of sexual harassment, masturbating in front of people (unwanted)",
    "position": [
      "candidate",
      "congress",
      "local official"
    ],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "candidate",
      "congress",
      "local official"
    ]
  },
  {
    "id": 1429,
    "name": "Lawrence Taylor, NFL",
    "year": null,
    "description": "Lawrence Taylor, NFL player, accused of statutory rape, pled guilty to two misdemeanours and listed as sexual offender",
    "position": [],
    "crime": [
      "rape"
    ],
    "tags": []
  },
  {
    "id": 1430,
    "name": "Justin Rhodes, M",
    "year": null,
    "description": "Justin Rhodes, Mississippi pastor arrested for molesting a child, had previous “moral failing” while leading the Baptist Missionary Association",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child molestation"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1431,
    "name": "Curt",
    "year": null,
    "description": "Curtis Cochran, Swain County NC Sheriff currently suspended after his arrest for felonious restraint, assault on a : X female, sexual battery and solicitation to commit prostitution.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "assault",
      "prostitution"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1432,
    "name": "Grant Hill, who",
    "year": null,
    "description": "Grant Hill, who was recently released from prison for two sex offenses, one against a 13-year-old, is running in the GOP primary for Iowa State House 88.",
    "position": [
      "congress",
      "party official"
    ],
    "crime": [],
    "tags": [
      "congress",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1433,
    "name": "Michael Doran, Lorain County (Ohio) Recorder has been",
    "year": null,
    "description": "Michael Doran, Lorain County (Ohio) Recorder has been charged with 3rd degree sexual imposition after a special prosecutor was appointed and found probable cause to file charges.",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1434,
    "name": "Stephen Kopp, director",
    "year": null,
    "description": "Stephen Kopp, director of extremist Bob Jones University summer camp, has been charged with criminal sexual conduct with a minor. The arrest warrant states he engaged in multiple “sex acts” with a 15-year-old child.",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1435,
    "name": "Brandon Westmoreland, Republican",
    "year": null,
    "description": "Brandon Westmoreland, former Republican candidate for mayor of Davenport, IA, has been arrested for sexual abuse of a woman who was too drunk to consent. He was identified by DNA from rape kit. He is currently on probation for suspended sentence for B&E.",
    "position": [
      "candidate",
      "local official",
      "party member"
    ],
    "crime": [
      "rape",
      "sexual abuse"
    ],
    "tags": [
      "candidate",
      "local official",
      "party member",
      "republican"
    ]
  },
  {
    "id": 1436,
    "name": "Curlon Edwards, a Baltimore police officer, has been",
    "year": null,
    "description": "Curlon Edwards, a Baltimore police officer, has been charged with raping a 16-year-old girl. Held without bail.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1437,
    "name": "Chr",
    "year": null,
    "description": "Christopher Seibert, former vice-principal at Catholic school in Stayton, OR, was indicted on counts of first-degree sex abuse and one count of second-degree unlawful sexual penetration of a minor.",
    "position": [
      "educator"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1438,
    "name": "Chr",
    "year": null,
    "description": "Christopher Allen Guinup, a Fairmont, WV, police officer admitted to sexually abusing nine-year-old girl",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1439,
    "name": "Scott Truelove, on the East Noble County School Board in",
    "year": null,
    "description": "Scott Truelove, on the East Noble County School Board in Indiana, was arrested for public indecency (exposing himself.) He resigned and lost his job at the library.",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1440,
    "name": "James A. Taylor, Fort Pierce (FL) City Comm",
    "year": null,
    "description": "James A. Taylor, Fort Pierce (FL) City Commissioner has been arrested and charged with 24 felony counts including soliciting a 12 year-old, sending nude photos to the child, and more.",
    "position": [
      "local official"
    ],
    "crime": [
      "prostitution"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1441,
    "name": "Ryan Walters, Oklahoma’s Superintendent of Public",
    "year": null,
    "description": "Ryan Walters, Oklahoma’s Superintendent of Public Instruction wanted to buy 55,000 Trump bibles for public schools. Christian Nationalist, nonconsensual exposure of pics of nude women on his screen during board meeting.",
    "position": [],
    "crime": [],
    "tags": [
      "maga"
    ]
  },
  {
    "id": 1442,
    "name": "Linda McMahon, Trump’s Education Secretary, has been",
    "year": null,
    "description": "Linda McMahon, Trump’s Education Secretary, has been sued for role in organizational coverup of sexual abuse of ringboys (minors) at WWE.",
    "position": [],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "maga"
    ]
  },
  {
    "id": 1443,
    "name": "Cory Mills, a",
    "year": null,
    "description": "Cory Mills, a Florida Congressman, was investigated for domestic violence after his DC girlfriend told police he assaulted her. She refused to press charges and the case was dropped. Now his former FL girlfriend, Miss United States has filed for a restraining order, providing police with reams of evidence of his harassment and threats.",
    "position": [
      "congress",
      "law enforcement"
    ],
    "crime": [
      "assault",
      "domestic violence",
      "sexual harassment",
      "violence"
    ],
    "tags": [
      "congress",
      "law enforcement"
    ]
  },
  {
    "id": 1444,
    "name": "J. Stuart Adams, Utah Senate President, changed the",
    "year": null,
    "description": "J. Stuart Adams, Utah Senate President, changed the consent law when his relative faced statutory rape charges. The girl was 13. The boy was 18.",
    "position": [],
    "crime": [
      "rape"
    ],
    "tags": []
  },
  {
    "id": 1445,
    "name": "Caitlin R. Crum, a teacher at Calvary Chr",
    "year": 2022,
    "description": "Caitlin R. Crum, a teacher at Calvary Christian Academy was charged in 2022 with sexual battery, producing child sexual exploitation material",
    "position": [
      "educator"
    ],
    "crime": [
      "child exploitation"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1446,
    "name": "Michael Medlin, formerly",
    "year": null,
    "description": "Michael Medlin, formerly a sheriff’s deputy and school resource officer in NC, pleaded guilty to charges of providing alcohol to a minor, assault and accessing a government computer in a scheme grooming one of his wife’s students.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "assault"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1447,
    "name": "Ami Medlin, a",
    "year": null,
    "description": "Ami Medlin, a high school teacher in NC, pleaded guilty to indecent liberties with a minor in a grooming/sexual abuse scheme with her husband : X",
    "position": [
      "educator"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1448,
    "name": "Hector Carranza, a police officer in Gresham, OR, 4 counts",
    "year": null,
    "description": "Hector Carranza, a police officer in Gresham, OR, 4 counts of 3rd-degree rape, 12 counts of 3rd-degree sodomy, 24 counts of 2nd-degree sex abuse, 5 counts of using a child in display of sexually explicit conduct, 5 counts of encouraging child sexual abuse, 5 counts of luring a minor, and 1 count of attempting to use a child in display of sexually explicit conduct.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "rape",
      "sexual abuse",
      "sodomy"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1449,
    "name": "Gregg Hayden, Sheriff’s",
    "year": null,
    "description": "Gregg Hayden, former school board member, Sheriff’s lieutenant, school safety supervisor in Anderson County, SC, is charged with third-degree criminal sexual conduct with a minor and second-degree attempted criminal sexual conduct with a minor. : X",
    "position": [
      "law enforcement"
    ],
    "crime": [],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1450,
    "name": "Stewart Ruch, one of the leaders who left the Ep",
    "year": null,
    "description": "Stewart Ruch, one of the leaders who left the Episcopal church in opposition to its “liberalism” to form the Anglican Church in North America, has been charged in a church trial for covering up a sexual abuses",
    "position": [
      "party official"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "party official"
    ]
  },
  {
    "id": 1451,
    "name": "Dayton Aldrich, a Santa Barbara city employee, gun club",
    "year": null,
    "description": "Dayton Aldrich, a Santa Barbara city employee, gun club president, who once sought a seat on Goleta City Council has been arrested on drug, gun, and child sexual abuse materia charges. Check out his shirt.",
    "position": [
      "local official"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1452,
    "name": "James Yokeley, Surrey County Elections Chair in NC, put",
    "year": null,
    "description": "James Yokeley, Surrey County Elections Chair in NC, put MDMA and cocaine in his granddaughters’ ice cream. They did not consume the drugs. He is charged with contaminating their food and child endangerment child abuse",
    "position": [
      "party official"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "party official"
    ]
  },
  {
    "id": 1453,
    "name": "Ron Weinberg, state",
    "year": null,
    "description": "Ron Weinberg, state representative in Colorado and former chair of Larimer County GOP, has been accused of making unwanted sexual advances by two women. No criminal complaint has been filed, Weinberg denies allegations, but has stepped back from leadership in House.",
    "position": [
      "congress",
      "party official",
      "state legislator"
    ],
    "crime": [],
    "tags": [
      "congress",
      "party official",
      "republican",
      "state legislator"
    ]
  },
  {
    "id": 1454,
    "name": "Scott Soucek, child protection activ",
    "year": 2009,
    "description": "Scott Soucek, child protection activist who campaigned for Trump’s fight against child predators has been indicted on 10 counts of possession of CSAM. Was also arrested in 2009 with CSAM, but not charged. Wife was Wisconsin Trump delegate.",
    "position": [
      "activist"
    ],
    "crime": [
      "child pornography"
    ],
    "tags": [
      "activist",
      "maga"
    ]
  },
  {
    "id": 1455,
    "name": "Joseph Brent Walker, Mormon B",
    "year": null,
    "description": "Joseph Brent Walker, Mormon Bishop, conservative “family values” columnist, LDS Public Affairs, charged with distributing material harmful to minor, enticing a minor Utah Case No: 251701696",
    "position": [
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1456,
    "name": "Ty Burns, OK",
    "year": null,
    "description": "Ty Burns, OK state rep, resigned after pleading guilty to 3 charges of domestic abuse and assault. Received a suspended sentence and mandated therapy as he claims PTSD from military service triggered violence. : X",
    "position": [],
    "crime": [
      "assault",
      "sexual abuse",
      "violence"
    ],
    "tags": []
  },
  {
    "id": 1457,
    "name": "Jon Reep, anti-woke, pro-MAGA comedian, has been",
    "year": null,
    "description": "Jon Reep, anti-woke, pro-MAGA comedian, has been arrested for child sexual exploitation.",
    "position": [],
    "crime": [
      "child exploitation"
    ],
    "tags": [
      "republican"
    ]
  },
  {
    "id": 1458,
    "name": "Adam King, Johnson",
    "year": null,
    "description": "Adam King, Johnson County TX Sheriff, on leave after charges of abuse of office, sexual harassment, corrupt influence",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "sexual abuse",
      "sexual harassment"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1459,
    "name": "Terry Steinwand, former",
    "year": null,
    "description": "Terry Steinwand, former Director of North Dakota Game and Fish, who was appointed by multiple Republican governors has been arrested for gross sexual imposition of a minor under the age of 15.",
    "position": [
      "governor",
      "party member"
    ],
    "crime": [],
    "tags": [
      "governor",
      "party member",
      "republican"
    ]
  },
  {
    "id": 1460,
    "name": "James Gosnell Jr, the SC Mag",
    "year": null,
    "description": "James Gosnell Jr, the SC Magistrate Judge infamous for calling Dylann Roof’s family victims and using the n-word, has been arrested for possessing child sexual abuse material. Denied bail.",
    "position": [
      "judge"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "judge"
    ]
  },
  {
    "id": 1461,
    "name": "Michael D. Pruitt, is",
    "year": null,
    "description": "Michael D. Pruitt, is being investigated for stalking a minor girl whom he also gave alcohol and cannabis gummies. Her mother took out a restraining order to get him to leave her daughter alone.",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1462,
    "name": "Matthew Stephen Masiewicz, Sovereign Grace Fellowship",
    "year": null,
    "description": "Matthew Stephen Masiewicz, Sovereign Grace Fellowship pastor, has been charged with twelve counts of child sexual exploitation and one count of visual representation of child sexual abuse.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "child exploitation",
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1463,
    "name": "Jordan J. Williams, teen min",
    "year": null,
    "description": "Jordan J. Williams, teen ministry leader at VineLife Church, arrested for possession of child sex abuse material",
    "position": [
      "party official"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "party official"
    ]
  },
  {
    "id": 1464,
    "name": "Michael Jafferakos, a Brooklyn NY basketball coach, has",
    "year": null,
    "description": "Michael Jafferakos, a Brooklyn NY basketball coach, has been arrested for paying minors to make sex videos.",
    "position": [
      "coach"
    ],
    "crime": [],
    "tags": [
      "coach"
    ]
  },
  {
    "id": 1465,
    "name": "Nick Fountain, MontCo. township superv",
    "year": null,
    "description": "Nick Fountain, MontCo. township supervisor and day care operator arrested for soliciting child pornography, sexual solicitation of a minor. Update, charged with sexual abuse of a child from when he was 9 until he was 16.",
    "position": [],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": []
  },
  {
    "id": 1466,
    "name": "Peter Bardunias, VP of Community Engagement at Clifton",
    "year": null,
    "description": "Peter Bardunias, VP of Community Engagement at Clifton Park NY Chamber, has been arrested for soliciting a minor via undercover police officer presenting as 15 year-old girl.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "prostitution"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1467,
    "name": "Paul Ingrassia, a Trump appointee to the Dept. of",
    "year": null,
    "description": "Paul Ingrassia, a Trump appointee to the Dept. of Homeland Security was accused of sexual harassment. Five witnesses affirm he canceled a subordinate’s hotel room telling her she was to stay with him. She filed a complaint then withdrew it fearing retaliation.",
    "position": [],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "maga"
    ]
  },
  {
    "id": 1468,
    "name": "Michael S. Ritchason, pastor",
    "year": null,
    "description": "Michael S. Ritchason, pastor of Riverside Community Church in Peoria, IL, is also a former teacher and City Councilman. He has been charged with giving harmful (sexual) materials to a child. Not sex ed, but prurient material",
    "position": [
      "educator",
      "local official",
      "religious leader"
    ],
    "crime": [],
    "tags": [
      "educator",
      "local official",
      "religious leader"
    ]
  },
  {
    "id": 1469,
    "name": "Michael Bo Peacock, former coach at Grapevine Faith",
    "year": null,
    "description": "Michael Bo Peacock, former coach at Grapevine Faith Christian School in Texas, was convicted of extorting minors to create child sexual abuse material and sentenced to forty years in prison",
    "position": [
      "coach"
    ],
    "crime": [
      "child pornography",
      "rape",
      "sexual abuse"
    ],
    "tags": [
      "coach"
    ]
  },
  {
    "id": 1470,
    "name": "Michael Brown, founder of FIRE School of Min",
    "year": null,
    "description": "Michael Brown, founder of FIRE School of Ministry",
    "position": [],
    "crime": [],
    "tags": []
  },
  {
    "id": 1471,
    "name": "Les Hughey, founder",
    "year": null,
    "description": "Les Hughey, founder of Highlands Church, Scottsdale, AZ, accused of sexually abusing more than a dozen people as youth pastor in Modesto.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1472,
    "name": "John C. Sapp, youth",
    "year": null,
    "description": "John C. Sapp, youth pastor at Maranatha Fellowship, Dover, DE, 89 counts of child sex abuse.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1473,
    "name": "Silas Shelton, Ohio advocate of banning LGBT books and",
    "year": null,
    "description": "Silas Shelton, Ohio advocate of banning LGBT books and a pastor at Blanchester Community Ministries, has been arrested for charges including child rape and sexual battery after a detective said he abused a minor over a period of about six years.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "rape",
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1474,
    "name": "Maurizio Miglietta, a NJ doctor, has been",
    "year": null,
    "description": "Maurizio Miglietta, a NJ doctor, has been charged with rape at gunpoint. He is regional dean and professor of surgery at Touro College of Osteopathic Medicine and served in several high-ranking medical posts and teaching positions.",
    "position": [],
    "crime": [
      "rape"
    ],
    "tags": []
  },
  {
    "id": 1475,
    "name": "Jon Sheptock",
    "year": 2022,
    "description": "Jon Sheptock is a Christian musician and former pastor. He sang at a Trump rally in 2022. He has been charged with possession and production of child sexual abuse imagery.",
    "position": [
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "maga",
      "religious leader"
    ]
  },
  {
    "id": 1476,
    "name": "Dominic Olivares, a",
    "year": null,
    "description": "Dominic Olivares, a former Greenville, NC, police officer, arrested on two counts of first degree sexual exploitation of a minor, three counts of second degree sexual exploitation of a minor, and three counts of third degree sexual exploitation of : X a minor.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "child exploitation"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1477,
    "name": "Joe Evans Carr, Sullivan County (TN) Comm",
    "year": null,
    "description": "Joe Evans Carr, Sullivan County (TN) Commissioner, was arrested and charged with sexual battery after groping a woman in a bar and getting in a fight with her boyfriend.",
    "position": [
      "local official"
    ],
    "crime": [
      "sexual harassment"
    ],
    "tags": [
      "local official"
    ]
  },
  {
    "id": 1478,
    "name": "Dustin Weir, Somerset",
    "year": null,
    "description": "Dustin Weir, Somerset County (PA) Sheriff, has been charged with corruption of minors during a “Shop With a Cop” event at Walmart. Took 15 year-old girl to condom aisle, wanted to take her pic with condoms, added lewd comments.",
    "position": [
      "law enforcement"
    ],
    "crime": [],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1479,
    "name": "Dan McKeon, NE",
    "year": null,
    "description": "Dan McKeon, NE state senator, has been cited for public indecency after touching a staffer’s butt. He said it was a mistake in tone, not intent, whatever that means.",
    "position": [
      "state legislator"
    ],
    "crime": [],
    "tags": [
      "state legislator"
    ]
  },
  {
    "id": 1480,
    "name": "Bradley Douglas Quillen, a middle school teacher in",
    "year": null,
    "description": "Bradley Douglas Quillen, a middle school teacher in Arkansas, has been charged with 17 counts of possession of CSAM and 4 counts of engaging children in sexually explicit conduct. Additional federal charges include online enticement, sexual exploitation of child, receipt of CSAM",
    "position": [
      "educator"
    ],
    "crime": [
      "child exploitation",
      "child pornography"
    ],
    "tags": [
      "educator"
    ]
  },
  {
    "id": 1481,
    "name": "James Wagner",
    "year": null,
    "description": "James Wagner is the former Sheriff of Dakota County, Nebraska. He has been charged with child abuse and possession of child sexual abuse material. He was texting a minor girl, parent notified police, police pretended to be girl to catch a predator.",
    "position": [
      "law enforcement"
    ],
    "crime": [
      "child pornography",
      "sexual abuse"
    ],
    "tags": [
      "law enforcement"
    ]
  },
  {
    "id": 1482,
    "name": "George Bell founded the Anchor Bapt",
    "year": null,
    "description": "George Bell founded the Anchor Baptist Church in Columbus, OH, and served as pastor for 35 years. He pleaded guilty to 2 counts of rape of a child under the age of",
    "position": [
      "religious leader"
    ],
    "crime": [
      "rape"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1483,
    "name": "Joshua David Kemper, an outspoken anti-gay, anti-trans",
    "year": null,
    "description": "Joshua David Kemper, an outspoken anti-gay, anti-trans youth pastor from Coarsegold, CA, arrested for child sex abuse : X",
    "position": [
      "religious leader"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "religious leader"
    ]
  },
  {
    "id": 1484,
    "name": "Joseph Burkhart, a Republican at-large Bellevue OH City",
    "year": null,
    "description": "Joseph Burkhart, a Republican at-large Bellevue OH City Council member, was charged with 22 charges: assault, strangulation, menacing by stalking, burglary, telecommunications harassment, tampering with evidence, and possession of a controlled substance. He is chair of the Public Safety Committee",
    "position": [
      "local official",
      "party member",
      "party official"
    ],
    "crime": [
      "assault",
      "sexual harassment"
    ],
    "tags": [
      "local official",
      "party member",
      "party official",
      "republican"
    ]
  },
  {
    "id": 1485,
    "name": "George Mason, a lobby",
    "year": 2024,
    "description": "George Mason, a lobbyist for Trump’s 2024 campaign, has been charged with possession and distribution of child sex abuse material",
    "position": [
      "lobbyist"
    ],
    "crime": [
      "sexual abuse"
    ],
    "tags": [
      "lobbyist",
      "maga"
    ]
  },
  {
    "id": 1486,
    "name": "John Emanuel Banuelos pardoned by Trump has been",
    "year": null,
    "description": "John Emanuel Banuelos pardoned by Trump has been arrested for kidnapping and sexually assaulting a woman in Salt Lake City.",
    "position": [],
    "crime": [
      "assault",
      "kidnapping"
    ],
    "tags": [
      "maga"
    ]
  },
  {
    "id": 1487,
    "name": "Matthew McGinley, Colorado",
    "year": null,
    "description": "Matthew McGinley, a Colorado worship pastor and former Christian school teacher has been charged with sexual assault of minor student",
    "position": [
      "educator",
      "religious leader"
    ],
    "crime": [
      "assault",
      "sexual assault"
    ],
    "tags": [
      "educator",
      "religious leader"
    ]
  },
  {
    "id": 2022,
    "name": "Slashed her tires…",
    "year": 2023,
    "description": "Slashed her tires…",
    "position": [],
    "crime": [],
    "tags": []
  }
]